package com.vandit.bhagavadgita;

import android.content.Intent;
import android.support.v4.app.Fragment;
import android.support.v4.app.FragmentManager;
import android.support.v4.app.FragmentPagerAdapter;
import android.support.v4.view.ViewPager;
import android.support.v7.app.ActionBar;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.support.v7.widget.DividerItemDecoration;
import android.support.v7.widget.LinearLayoutManager;
import android.support.v7.widget.RecyclerView;
import android.util.Log;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.ImageButton;
import android.widget.TextView;
import android.widget.Toast;

import com.google.android.gms.ads.AdListener;
import com.google.android.gms.ads.AdRequest;
import com.google.android.gms.ads.InterstitialAd;
import com.google.android.gms.ads.MobileAds;
import com.vandit.bhagavadgita.Adapter.ShlokAdapter;
import com.vandit.bhagavadgita.Model.RecyclerBean;

import java.util.ArrayList;

public class ShlokActivity extends AppCompatActivity {
    int n = 0, i = 0, no = 0;
    ViewPager viewPager;
    ArrayList<RecyclerBean> arrayList;
    ImageButton imgbtnback;
    TextView txtshlok_name, txtshlok_desc;
    String name, desc;
    private InterstitialAd minterstitialAd;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        ActionBar actionBar = getSupportActionBar();
        actionBar.hide();
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_shlok);
        MobileAds.initialize(this,"ca-app-pub-5340005248246861~4049341677");
        minterstitialAd=new InterstitialAd(this);
        minterstitialAd.setAdUnitId("ca-app-pub-5340005248246861/6123311997");
        minterstitialAd.loadAd(new AdRequest.Builder().build());
        minterstitialAd.setAdListener(new AdListener(){
            @Override
            public void onAdClosed() {
                super.onAdClosed();
                minterstitialAd.loadAd(new AdRequest.Builder().build());
            }

            @Override
            public void onAdFailedToLoad(int i) {
                super.onAdFailedToLoad(i);
                Toast.makeText(ShlokActivity.this, "Failed :"+i, Toast.LENGTH_SHORT).show();
            }

            @Override
            public void onAdLeftApplication() {
                super.onAdLeftApplication();
            }

            @Override
            public void onAdOpened() {
                super.onAdOpened();
            }

            @Override
            public void onAdLoaded() {
                super.onAdLoaded();
            }
        });
        imgbtnback = findViewById(R.id.imgbtnback1);
        viewPager = findViewById(R.id.view_pager);
        final Intent intent = getIntent();
        n = intent.getIntExtra("apos", -1);
        i = intent.getIntExtra("spos", -1);
        no = intent.getIntExtra("no_of_shlok", -1);
        Log.e("Values", String.valueOf(n));
        Log.e("Values", String.valueOf(i));
      //  viewPager.setCurrentItem(i);
        viewPager.setAdapter(new FragmentPager(getSupportFragmentManager()));
        viewPager.setOnPageChangeListener(new ViewPager.OnPageChangeListener() {
            @Override
            public void onPageScrolled(int position, float positionOffset, int positionOffsetPixels) {

            }

            @Override
            public void onPageSelected(int position) {

            }

            @Override
            public void onPageScrollStateChanged(int state) {

            }
        });
        viewPager.setCurrentItem(i);
 //       alladhyay(n, i);
        imgbtnback.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                Intent intent1 = new Intent(ShlokActivity.this, Shlok_listActivity.class);
                intent1.putExtra("pos", n);
                startActivity(intent1);
                finish();
            }
        });
    }

    public class FragmentPager extends FragmentPagerAdapter {
        public FragmentPager(FragmentManager fm) {
            super(fm);
        }

        @Override
        public Fragment getItem(int position) {
            if (position < no ) {
                alladhyay(n, position);
                   return ShlokFragment.newInstance(name, desc);
               }
           return null;
        }

        @Override
        public int getCount() {
            return no-1;
        }
    }

    @Override
    public void onBackPressed() {
        super.onBackPressed();
        Log.e("I:",String.valueOf(i));
        if(i%19==0){
            if(minterstitialAd.isLoaded()){
                minterstitialAd.show();
            }
        }
    }

    public void alladhyay(int n, int i){
        if(n!=-1 && i!=-1) {
            if (n == 0) {
                if(i==0){
                    name="धर्मक्षेत्रे कुरुक्षेत्रे समवेता युयुत्सवः ।\n" +
                            "मामकाः पाण्डवाश्चैव किमकुर्वत संजय||";
                    desc="भावार्थ : धृतराष्ट्र बोले- हे संजय! धर्मभूमि कुरुक्षेत्र में एकत्रित, युद्ध की इच्छावाले मेरे और पाण्डु के पुत्रों ने क्या किया?";
                }else if(i==1){
                    name="दृष्टवा तु पाण्डवानीकं व्यूढं दुर्योधनस्तदा ।\n" +
                            "आचार्यमुपसंगम्य राजा वचनमब्रवीत् ॥";
                    desc="भावार्थ : संजय बोले- उस समय राजा दुर्योधन ने व्यूहरचनायुक्त\n पाण्डवों की सेना को देखा और द्रोणाचार्य के पास जाकर\n यह वचन कहा";
                }else if(i==2){
                    name="पश्यैतां पाण्डुपुत्राणामाचार्य महतीं चमूम् ।\n" +
                            "व्यूढां द्रुपदपुत्रेण तव शिष्येण धीमता ॥";
                    desc="भावार्थ :  हे आचार्य! आपके बुद्धिमान् शिष्य द्रुपदपुत्र धृष्टद्युम्न\n द्वारा व्यूहाकार खड़ी की हुई पाण्डुपुत्रों की इस बड़ी भारी\n सेना को देखिए";
                }else if(i==3){
                    name="अत्र शूरा महेष्वासा भीमार्जुनसमा युधि ।\n" +
                            "युयुधानो विराटश्च द्रुपदश्च महारथः ॥";
                    desc="";
                }else if(i==4){
                    name="धृष्टकेतुश्चेकितानः काशिराजश्च वीर्यवान् ।\n" +
                            "पुरुजित्कुन्तिभोजश्च शैब्यश्च नरपुङवः ॥";
                    desc="";
                }else if(i==5){
                    name="युधामन्युश्च विक्रान्त उत्तमौजाश्च वीर्यवान् ।\n" +
                            "सौभद्रो द्रौपदेयाश्च सर्व एव महारथाः ॥";
                    desc="भावार्थ : इस सेना में बड़े-बड़े धनुषों वाले तथा युद्ध में भीम\n और अर्जुन के समान शूरवीर सात्यकि और विराट तथा महारथी\n राजा द्रुपद, धृष्टकेतु और चेकितान तथा बलवान काशिराज, पुरुजित, कुन्तिभोज \nऔर मनुष्यों में श्रेष्ठ शैब्य, पराक्रमी युधामन्यु तथा बलवान उत्तमौजा, \nसुभद्रापुत्र अभिमन्यु एवं द्रौपदी के पाँचों पुत्र- ये सभी महारथी हैं";
                }else if(i==6){
                    name="अस्माकं तु विशिष्टा ये तान्निबोध द्विजोत्तम ।\n" +
                            "नायका मम सैन्यस्य सञ्ज्ञार्थं तान्ब्रवीमि ते ॥";
                    desc="भावार्थ : हे ब्राह्मणश्रेष्ठ! अपने पक्ष में भी जो प्रधान हैं, उनको आप समझ लीजिए। आपकी जानकारी के लिए मेरी सेना के जो-जो सेनापति हैं, उनको बतलाता हूँ";
                }else if(i==7){
                    name="भवान्भीष्मश्च कर्णश्च कृपश्च समितिञ्जयः ।\n" +
                            "अश्वत्थामा विकर्णश्च सौमदत्तिस्तथैव च ॥";
                    desc="भावार्थ : आप-द्रोणाचार्य और पितामह भीष्म तथा कर्ण और संग्रामविजयी कृपाचार्य तथा वैसे ही अश्वत्थामा, विकर्ण और सोमदत्त का पुत्र भूरिश्रवा";
                }
                else if(i==8){
                    name="अन्ये च बहवः शूरा मदर्थे त्यक्तजीविताः ।\n" +
                            "नानाशस्त्रप्रहरणाः सर्वे युद्धविशारदाः ॥";
                    desc="भावार्थ : और भी मेरे लिए जीवन की आशा त्याग देने वाले बहुत-से शूरवीर अनेक प्रकार के शस्त्रास्त्रों से सुसज्जित और सब-के-सब युद्ध में चतुर हैं";
                }else if(i==9){
                    name="अपर्याप्तं तदस्माकं बलं भीष्माभिरक्षितम् ।\n" +
                            "पर्याप्तं त्विदमेतेषां बलं भीमाभिरक्षितम् ॥";
                    desc="भावार्थ : भीष्म पितामह द्वारा रक्षित हमारी वह सेना सब प्रकार से अजेय है और भीम द्वारा रक्षित इन लोगों की यह सेना जीतने में सुगम है";
                }
                else if(i==10){
                    name="अयनेषु च सर्वेषु यथाभागमवस्थिताः ।\n" +
                            "भीष्ममेवाभिरक्षन्तु भवन्तः सर्व एव हि ॥";
                    desc="भावार्थ : इसलिए सब मोर्चों पर अपनी-अपनी जगह स्थित रहते हुए आप लोग सभी निःसंदेह भीष्म पितामह की ही सब ओर से रक्षा करें";
                }
                else if(i==11){
                    name="तस्य सञ्जनयन्हर्षं कुरुवृद्धः पितामहः ।\n" +
                            "सिंहनादं विनद्योच्चैः शंख दध्मो प्रतापवान् ॥";
                    desc="भावार्थ :  कौरवों में वृद्ध बड़े प्रतापी पितामह भीष्म ने उस दुर्योधन के हृदय में हर्ष उत्पन्न करते हुए उच्च स्वर से सिंह की दहाड़ के समान गरजकर शंख बजाया";
                }else if(i==12){
                    name="ततः शंखाश्च भेर्यश्च पणवानकगोमुखाः ।\n" +
                            "सहसैवाभ्यहन्यन्त स शब्दस्तुमुलोऽभवत् ॥";
                    desc="भावार्थ : इसके पश्चात शंख और नगाड़े तथा ढोल, मृदंग और नरसिंघे आदि बाजे एक साथ ही बज उठे। उनका वह शब्द बड़ा भयंकर हुआ";
                }
                else if(i==13){
                    name="ततः श्वेतैर्हयैर्युक्ते महति स्यन्दने स्थितौ ।\n" +
                            "माधवः पाण्डवश्चैव दिव्यौ शंखौ प्रदध्मतुः ॥";
                    desc="भावार्थ : इसके अनन्तर सफेद घोड़ों से युक्त उत्तम रथ में बैठे हुए श्रीकृष्ण महाराज और अर्जुन ने भी अलौकिक शंख बजाए";
                }
                else if(i==14){
                    name="पाञ्चजन्यं हृषीकेशो देवदत्तं धनञ्जयः ।\n" +
                            "पौण्ड्रं दध्मौ महाशंख भीमकर्मा वृकोदरः ॥";
                    desc="भावार्थ :  श्रीकृष्ण महाराज ने पाञ्चजन्य नामक, अर्जुन ने देवदत्त नामक और भयानक कर्मवाले भीमसेन ने पौण्ड्र नामक महाशंख बजाया";
                }
                else if(i==15){
                    name="अनन्तविजयं राजा कुन्तीपुत्रो युधिष्ठिरः ।\n" +
                            "नकुलः सहदेवश्च सुघोषमणिपुष्पकौ ॥";
                    desc="भावार्थ : कुन्तीपुत्र राजा युधिष्ठिर ने अनन्तविजय नामक और नकुल तथा सहदेव ने सुघोष और मणिपुष्पक नामक शंख बजाए";
                }
                else if(i==16){
                    name="काश्यश्च परमेष्वासः शिखण्डी च महारथः ।\n" +
                            "धृष्टद्युम्नो विराटश्च सात्यकिश्चापराजितः ॥";
                    desc="";
                }
                else if(i==17){
                    name="द्रुपदो द्रौपदेयाश्च सर्वशः पृथिवीपते ।\n" +
                            "सौभद्रश्च महाबाहुः शंखान्दध्मुः पृथक्पृथक्\u200C ॥";
                    desc="भावार्थ : श्रेष्ठ धनुष वाले काशिराज और महारथी शिखण्डी एवं धृष्टद्युम्न तथा राजा विराट और अजेय सात्यकि, राजा द्रुपद एवं द्रौपदी के पाँचों पुत्र और बड़ी भुजावाले सुभद्रा पुत्र अभिमन्यु- इन सभी ने, हे राजन्! सब ओर से अलग-अलग शंख बजाए";
                }
                else if(i==18){
                    name="स घोषो धार्तराष्ट्राणां हृदयानि व्यदारयत् ।\n" +
                            "नभश्च पृथिवीं चैव तुमुलो व्यनुनादयन्॥";
                    desc="भावार्थ : और उस भयानक शब्द ने आकाश और पृथ्वी को भी गुंजाते हुए धार्तराष्ट्रों के अर्थात आपके पक्षवालों के हृदय विदीर्ण कर दिए";
                }else if(i==19){
                    Log.e("I",String.valueOf(i));
                    name="अथ व्यवस्थितान्दृष्ट्वा धार्तराष्ट्रान् कपिध्वजः ।\n" +
                            "प्रवृत्ते शस्त्रसम्पाते धनुरुद्यम्य पाण्डवः ॥ ";
                    desc="";
                }
                else if(i==20){
                    name="हृषीकेशं तदा वाक्यमिदमाह महीपते ।\n" +
                            "सेनयोरुभयोर्मध्ये रथं स्थापय मेऽच्युत ॥";
                    desc="भावार्थ : भावार्थ :  हे राजन्\u200C! इसके बाद कपिध्वज अर्जुन ने मोर्चा बाँधकर डटे हुए धृतराष्ट्र-संबंधियों को देखकर, उस शस्त्र चलने की तैयारी के समय धनुष उठाकर हृषीकेश श्रीकृष्ण महाराज से यह वचन कहा- हे अच्युत! मेरे रथ को दोनों सेनाओं के बीच में खड़ा कीजिए";
                }else if(i==21){
                    name="यावदेतान्निरीक्षेऽहं योद्धुकामानवस्थितान्\u200C ।\n" +
                            "कैर्मया सह योद्धव्यमस्मिन् रणसमुद्यमे ॥";
                    desc="भावार्थ : और जब तक कि मैं युद्ध क्षेत्र में डटे हुए युद्ध के अभिलाषी इन विपक्षी योद्धाओं को भली प्रकार देख न लूँ कि इस युद्ध रूप व्यापार में मुझे किन-किन के साथ युद्ध करना योग्य है, तब तक उसे खड़ा रखिए";
                }else if(i==22){
                    name="योत्स्यमानानवेक्षेऽहं य एतेऽत्र समागताः ।\n" +
                            "धार्तराष्ट्रस्य दुर्बुद्धेर्युद्धे प्रियचिकीर्षवः ॥";
                    desc="भावार्थ :  दुर्बुद्धि दुर्योधन का युद्ध में हित चाहने वाले जो-जो ये राजा लोग इस सेना में आए हैं, इन युद्ध करने वालों को मैं देखूँगा";
                }
                else if(i==23){
                    name="एवमुक्तो हृषीकेशो गुडाकेशेन भारत ।\n" +
                            "सेनयोरुभयोर्मध्ये स्थापयित्वा रथोत्तमम्\u200C ॥";
                    desc="";
                }
                else if(i==24){
                    name="भीष्मद्रोणप्रमुखतः सर्वेषां च महीक्षिताम् ।\n" +
                            "उवाच पार्थ पश्यैतान् समवेतान् कुरूनिति ॥";
                    desc="भावार्थ : संजय बोले- हे धृतराष्ट्र! अर्जुन द्वारा कहे अनुसार महाराज श्रीकृष्णचंद्र ने दोनों सेनाओं के बीच में भीष्म और द्रोणाचार्य के सामने तथा सम्पूर्ण राजाओं के सामने उत्तम रथ को खड़ा कर इस प्रकार कहा कि हे पार्थ! युद्ध के लिए जुटे हुए इन कौरवों को देख";
                }else if(i==25){
                    name="तत्रापश्यत्स्थितान् पार्थः पितृनथ पितामहान् ।\n" +
                            "आचार्यान्मातुलान्भ्रातृन्पुत्रान्पौत्रान्सखींस्तथा ॥\n" +
                            "श्वशुरान् सुहृदश्चैव सेनयोरुभयोरपि ।";
                    desc="भावार्थ : इसके बाद पृथापुत्र अर्जुन ने उन दोनों ही सेनाओं में स्थित ताऊ-चाचों को, दादों-परदादों को, गुरुओं को, मामाओं को, भाइयों को, पुत्रों को, पौत्रों को तथा मित्रों को, ससुरों को और सुहृदों को भी देखा";
                }else if(i==26){
                    name="तान्समीक्ष्य स कौन्तेयः सर्वान् बन्धूनवस्थितान्॥\n"+
                            "कृपया परयाविष्टो विषीदत्रिदमब्रवीत् ।";
                    desc="भावार्थ : उन उपस्थित सम्पूर्ण बंधुओं को देखकर वे कुंतीपुत्र अर्जुन अत्यन्त करुणा से युक्त होकर शोक करते हुए यह वचन बोले।";
                }else if(i==27){
                    name="दृष्टेवमं स्वजनं कृष्ण युयुत्सुं समुपस्थितम् ॥";
                    desc="";
                }else if(i==28){
                    name="सीदन्ति मम गात्राणि मुखं च परिशुष्यति । \n" +
                            "वेपथुश्च शरीरे में रोमहर्षश्च जायते ॥";
                    desc="भावार्थ : अर्जुन बोले- हे कृष्ण! युद्ध क्षेत्र में डटे हुए युद्ध के अभिलाषी इस स्वजनसमुदाय को देखकर मेरे अंग शिथिल हुए जा रहे हैं और मुख सूखा जा रहा है तथा मेरे शरीर में कम्प एवं रोमांच हो रहा है";
                }else if(i==29){
                    name="गाण्डीवं स्रंसते हस्तात्वक्चैव परिदह्यते ।\n" +
                            "न च शक्नोम्यवस्थातुं भ्रमतीव च मे मनः ॥";
                    desc="भावार्थ : हाथ से गांडीव धनुष गिर रहा है और त्वचा भी बहुत जल रही है तथा मेरा मन भ्रमित-सा हो रहा है, इसलिए मैं खड़ा रहने को भी समर्थ नहीं हूँ";
                }else if(i==30){
                    name="निमित्तानि च पश्यामि विपरीतानि केशव ।\n" +
                            "न च श्रेयोऽनुपश्यामि हत्वा स्वजनमाहवे ॥";
                    desc="भावार्थ :  हे केशव! मैं लक्षणों को भी विपरीत ही देख रहा हूँ तथा युद्ध में स्वजन-समुदाय को मारकर कल्याण भी नहीं देखता";
                }else if(i==31){
                    name="न काङ््षे विजयं कृष्ण न च राज्यं सुखानि च ।\n" +
                            "किं नो राज्येन गोविंद किं भोगैर्जीवितेन वा ॥";
                    desc="भावार्थ : हे कृष्ण! मैं न तो विजय चाहता हूँ और न राज्य तथा सुखों को ही। हे गोविंद! हमें ऐसे राज्य से क्या प्रयोजन है अथवा ऐसे भोगों से और जीवन से भी क्या लाभ है?";
                }else if(i==32){
                    name="येषामर्थे काङक्षितं नो राज्यं भोगाः सुखानि च ।\n" +
                            "त इमेऽवस्थिता युद्धे प्राणांस्त्यक्त्वा धनानि च ॥";
                    desc="भावार्थ : हमें जिनके लिए राज्य, भोग और सुखादि अभीष्ट हैं, वे ही ये सब धन और जीवन की आशा को त्यागकर युद्ध में खड़े हैं";
                }else if(i==33){
                    name="आचार्याः पितरः पुत्रास्तथैव च पितामहाः ।\n" +
                            "मातुलाः श्वशुराः पौत्राः श्यालाः संबंधिनस्तथा ॥";
                    desc="भावार्थ : गुरुजन, ताऊ-चाचे, लड़के और उसी प्रकार दादे, मामे, ससुर, पौत्र, साले तथा और भी संबंधी लोग हैं ";
                }else if(i==34){
                    name="एतान्न हन्तुमिच्छामि घ्नतोऽपि मधुसूदन ।\n" +
                            "अपि त्रैलोक्यराज्यस्य हेतोः किं नु महीकृते ॥";
                    desc="भावार्थ : हे मधुसूदन! मुझे मारने पर भी अथवा तीनों लोकों के राज्य के लिए भी मैं इन सबको मारना नहीं चाहता, फिर पृथ्वी के लिए तो कहना ही क्या है?";
                }else if(i==35){
                    name="निहत्य धार्तराष्ट्रान्न का प्रीतिः स्याज्जनार्दन ।\n" +
                            "पापमेवाश्रयेदस्मान्\u200C हत्वैतानाततायिनः ॥";
                    desc="भावार्थ : हे जनार्दन! धृतराष्ट्र के पुत्रों को मारकर हमें क्या प्रसन्नता होगी? इन आततायियों को मारकर तो हमें पाप ही लगेगा";
                }else if(i==36){
                    name="तस्मान्नार्हा वयं हन्तुं धार्तराष्ट्रान्स्वबान्धवान्\u200C ।\n" +
                            "स्वजनं हि कथं हत्वा सुखिनः स्याम माधव ॥";
                    desc="भावार्थ : अतएव हे माधव! अपने ही बान्धव धृतराष्ट्र के पुत्रों को मारने के लिए हम योग्य नहीं हैं क्योंकि अपने ही कुटुम्ब को मारकर हम कैसे सुखी होंगे?";
                }else if(i==37){
                    name="यद्यप्येते न पश्यन्ति लोभोपहतचेतसः ।\n" +
                            "कुलक्षयकृतं दोषं मित्रद्रोहे च पातकम्\u200C ॥";
                    desc="";
                }else if(i==38){
                    name="कथं न ज्ञेयमस्माभिः पापादस्मान्निवर्तितुम्\u200C ।\n" +
                            "कुलक्षयकृतं दोषं प्रपश्यद्भिर्जनार्दन ॥";
                    desc="भावार्थ : यद्यपि लोभ से भ्रष्टचित्त हुए ये लोग कुल के नाश से उत्पन्न दोष को और मित्रों से विरोध करने में पाप को नहीं देखते, तो भी हे जनार्दन! कुल के नाश से उत्पन्न दोष को जानने वाले हम लोगों को इस पाप से हटने के लिए क्यों नहीं विचार करना चाहिए?";
                }else if(i==39){
                    name="कुलक्षये प्रणश्यन्ति कुलधर्माः सनातनाः ।\n" +
                            "धर्मे नष्टे कुलं कृत्स्नमधर्मोऽभिभवत्युत ॥";
                    desc="भावार्थ : कुल के नाश से सनातन कुल-धर्म नष्ट हो जाते हैं तथा धर्म का नाश हो जाने पर सम्पूर्ण कुल में पाप भी बहुत फैल जाता है";
                }else if(i==40){
                    name="अधर्माभिभवात्कृष्ण प्रदुष्यन्ति कुलस्त्रियः ।\n" +
                            "स्त्रीषु दुष्टासु वार्ष्णेय जायते वर्णसंकरः ॥";
                    desc="भावार्थ : हे कृष्ण! पाप के अधिक बढ़ जाने से कुल की स्त्रियाँ अत्यन्त दूषित हो जाती हैं और हे वार्ष्णेय! स्त्रियों के दूषित हो जाने पर वर्णसंकर उत्पन्न होता है";
                }else if(i==41){
                    name="संकरो नरकायैव कुलघ्नानां कुलस्य च ।\n" +
                            "पतन्ति पितरो ह्येषां लुप्तपिण्डोदकक्रियाः ॥";
                    desc="भावार्थ : वर्णसंकर कुलघातियों को और कुल को नरक में ले जाने के लिए ही होता है। लुप्त हुई पिण्ड और जल की क्रिया वाले अर्थात श्राद्ध और तर्पण से वंचित इनके पितर लोग भी अधोगति को प्राप्त होते हैं";
                }else if(i==42){
                    name="दोषैरेतैः कुलघ्नानां वर्णसंकरकारकैः ।\n" +
                            "उत्साद्यन्ते जातिधर्माः कुलधर्माश्च शाश्वताः ॥";
                    desc="भावार्थ : इन वर्णसंकरकारक दोषों से कुलघातियों के सनातन कुल-धर्म और जाति-धर्म नष्ट हो जाते हैं";
                }else if(i==43){
                    name="उत्सन्नकुलधर्माणां मनुष्याणां जनार्दन ।\n" +
                            "नरकेऽनियतं वासो भवतीत्यनुशुश्रुम ॥";
                    desc="भावार्थ : हे जनार्दन! जिनका कुल-धर्म नष्ट हो गया है, ऐसे मनुष्यों का अनिश्चितकाल तक नरक में वास होता है, ऐसा हम सुनते आए हैं";
                }else if(i==44){
                    name="अहो बत महत्पापं कर्तुं व्यवसिता वयम्\u200C ।\n" +
                            "यद्राज्यसुखलोभेन हन्तुं स्वजनमुद्यताः ॥";
                    desc="भावार्थ : हा! शोक! हम लोग बुद्धिमान होकर भी महान पाप करने को तैयार हो गए हैं, जो राज्य और सुख के लोभ से स्वजनों को मारने के लिए उद्यत हो गए हैं";
                }else if(i==45){
                    name="यदि मामप्रतीकारमशस्त्रं शस्त्रपाणयः ।\n" +
                            "धार्तराष्ट्रा रणे हन्युस्तन्मे क्षेमतरं भवेत्\u200C ॥";
                    desc="भावार्थ : यदि मुझ शस्त्ररहित एवं सामना न करने वाले को शस्त्र हाथ में लिए हुए धृतराष्ट्र के पुत्र रण में मार डालें तो वह मारना भी मेरे लिए अधिक कल्याणकारक होगा";
                }else if(i==46){
                    name="एवमुक्त्वार्जुनः सङ्\u200Dख्ये रथोपस्थ उपाविशत्\u200C ।\n" +
                            "विसृज्य सशरं चापं शोकसंविग्नमानसः ॥";
                    desc="भावार्थ : संजय बोले- रणभूमि में शोक से उद्विग्न मन वाले अर्जुन इस प्रकार कहकर, बाणसहित धनुष को त्यागकर रथ के पिछले भाग में बैठ गए";
                }

            }else if(n==1){
                if(i==0){
                    name="तं तथा कृपयाविष्टमश्रुपूर्णाकुलेक्षणम्\u200C ।\n" +
                            "विषीदन्तमिदं वाक्यमुवाच मधुसूदनः ॥";
                    desc="भावार्थ : संजय बोले- उस प्रकार करुणा से व्याप्त और आँसुओं से पूर्ण तथा व्याकुल नेत्रों वाले शोकयुक्त उस अर्जुन के प्रति भगवान मधुसूदन ने यह वचन कहा";
                }else if(i==1){
                    name="कुतस्त्वा कश्मलमिदं विषमे समुपस्थितम्\u200C ।\n" +
                            "अनार्यजुष्टमस्वर्ग्यमकीर्तिकरमर्जुन॥";
                    desc="भावार्थ : श्रीभगवान बोले- हे अर्जुन! तुझे इस असमय में यह मोह किस हेतु से प्राप्त हुआ? क्योंकि न तो यह श्रेष्ठ पुरुषों द्वारा आचरित है, न स्वर्ग को देने वाला है और न कीर्ति को करने वाला ही है";
                }else if(i==2){
                    name="क्लैब्यं मा स्म गमः पार्थ नैतत्त्वय्युपपद्यते ।\n" +
                            "क्षुद्रं हृदयदौर्बल्यं त्यक्त्वोत्तिष्ठ परन्तप ॥";
                    desc="भावार्थ :  इसलिए हे अर्जुन! नपुंसकता को मत प्राप्त हो, तुझमें यह उचित नहीं जान पड़ती। हे परंतप! हृदय की तुच्छ दुर्बलता को त्यागकर युद्ध के लिए खड़ा हो जा";
                }else if(i==3){
                    name="कथं भीष्ममहं सङ्\u200Dख्ये द्रोणं च मधुसूदन ।\n" +
                            "इषुभिः प्रतियोत्स्यामि पूजार्हावरिसूदन ॥";
                    desc="भावार्थ : अर्जुन बोले- हे मधुसूदन! मैं रणभूमि में किस प्रकार बाणों से भीष्म पितामह और द्रोणाचार्य के विरुद्ध लड़ूँगा? क्योंकि हे अरिसूदन! वे दोनों ही पूजनीय हैं";
                }else if(i==4){
                    name="गुरूनहत्वा हि महानुभावा-\n" +
                            "ञ्छ्रेयो भोक्तुं भैक्ष्यमपीह लोके ।\n" +
                            "हत्वार्थकामांस्तु गुरूनिहैव\n" +
                            "भुंजीय भोगान्\u200C रुधिरप्रदिग्धान्\u200C ॥";
                    desc="भावार्थ : इसलिए इन महानुभाव गुरुजनों को न मारकर मैं इस लोक में भिक्षा का अन्न भी खाना कल्याणकारक समझता हूँ क्योंकि गुरुजनों को मारकर भी इस लोक में रुधिर से सने हुए अर्थ और कामरूप भोगों को ही तो भोगूँगा";
                }else if(i==5){
                    name="न चैतद्विद्मः कतरन्नो गरीयो-\n" +
                            "यद्वा जयेम यदि वा नो जयेयुः ।\n" +
                            "यानेव हत्वा न जिजीविषाम-\n" +
                            "स्तेऽवस्थिताः प्रमुखे धार्तराष्ट्राः ॥";
                    desc="भावार्थ : हम यह भी नहीं जानते कि हमारे लिए युद्ध करना और न करना- इन दोनों में से कौन-सा श्रेष्ठ है, अथवा यह भी नहीं जानते कि उन्हें हम जीतेंगे या हमको वे जीतेंगे। और जिनको मारकर हम जीना भी नहीं चाहते, वे ही हमारे आत्मीय धृतराष्ट्र के पुत्र हमारे मुकाबले में खड़े हैं";
                }else if(i==6){
                    name="कार्पण्यदोषोपहतस्वभावः\n" +
                            "पृच्छामि त्वां धर्मसम्मूढचेताः ।\n" +
                            "यच्छ्रेयः स्यान्निश्चितं ब्रूहि तन्मे\n" +
                            "शिष्यस्तेऽहं शाधि मां त्वां प्रपन्नम्\u200C ॥";
                    desc="भावार्थ : इसलिए कायरता रूप दोष से उपहत हुए स्वभाव वाला तथा धर्म के विषय में मोहित चित्त हुआ मैं आपसे पूछता हूँ कि जो साधन निश्चित कल्याणकारक हो, वह मेरे लिए कहिए क्योंकि मैं आपका शिष्य हूँ, इसलिए आपके शरण हुए मुझको शिक्षा दीजिए";
                }else if(i==7){
                    name="न हि प्रपश्यामि ममापनुद्या-\n" +
                            "द्यच्छोकमुच्छोषणमिन्द्रियाणाम्\u200C ।\n" +
                            "अवाप्य भूमावसपत्रमृद्धं-\n" +
                            "राज्यं सुराणामपि चाधिपत्यम्\u200C";
                    desc="भावार्थ : क्योंकि भूमि में निष्कण्टक, धन-धान्य सम्पन्न राज्य को और देवताओं के स्वामीपने को प्राप्त होकर भी मैं उस उपाय को नहीं देखता हूँ, जो मेरी इन्द्रियों के सुखाने वाले शोक को दूर कर सके";
                }else if(i==8){
                    name="एवमुक्त्वा हृषीकेशं गुडाकेशः परन्तप ।\n" +
                            "न योत्स्य इतिगोविन्दमुक्त्वा तूष्णीं बभूव ह ॥";
                    desc="भावार्थ : संजय बोले- हे राजन्\u200C! निद्रा को जीतने वाले अर्जुन अंतर्यामी श्रीकृष्ण महाराज के प्रति इस प्रकार कहकर फिर श्री गोविंद भगवान्\u200C से 'युद्ध नहीं करूँगा' यह स्पष्ट कहकर चुप हो गए";
                }else if(i==9){
                    name="तमुवाच हृषीकेशः प्रहसन्निव भारत ।\n" +
                            "सेनयोरुभयोर्मध्ये विषीदंतमिदं वचः ";
                    desc="भावार्थ : हे भरतवंशी धृतराष्ट्र! अंतर्यामी श्रीकृष्ण महाराज दोनों सेनाओं के बीच में शोक करते हुए उस अर्जुन को हँसते हुए से यह वचन बोले";
                }
                else if(i==10){
                    name="अशोच्यानन्वशोचस्त्वं प्रज्ञावादांश्च भाषसे ।\n" +
                            "गतासूनगतासूंश्च नानुशोचन्ति पण्डिताः ॥";
                    desc="भावार्थ : श्री भगवान बोले, हे अर्जुन! तू न शोक करने योग्य मनुष्यों के लिए शोक करता है और पण्डितों के से वचनों को कहता है, परन्तु जिनके प्राण चले गए हैं, उनके लिए और जिनके प्राण नहीं गए हैं उनके लिए भी पण्डितजन शोक नहीं करते";
                }else if(i==11){
                    name="न त्वेवाहं जातु नासं न त्वं नेमे जनाधिपाः ।\n" +
                            "न चैव न भविष्यामः सर्वे वयमतः परम्\u200C ॥";
                    desc="भावार्थ : न तो ऐसा ही है कि मैं किसी काल में नहीं था, तू नहीं था अथवा ये राजा लोग नहीं थे और न ऐसा ही है कि इससे आगे हम सब नहीं रहेंगे";
                }else if(i==12){
                    name="देहिनोऽस्मिन्यथा देहे कौमारं यौवनं जरा ।\n" +
                            "तथा देहान्तरप्राप्तिर्धीरस्तत्र न मुह्यति ॥";
                    desc="भावार्थ :  जैसे जीवात्मा की इस देह में बालकपन, जवानी और वृद्धावस्था होती है, वैसे ही अन्य शरीर की प्राप्ति होती है, उस विषय में धीर पुरुष मोहित नहीं होता";
                }else if(i==13){
                    name="मात्रास्पर्शास्तु कौन्तेय शीतोष्णसुखदुःखदाः ।\n" +
                            "आगमापायिनोऽनित्यास्तांस्तितिक्षस्व भारत ॥";
                    desc="भावार्थ : हे कुंतीपुत्र! सर्दी-गर्मी और सुख-दुःख को देने वाले इन्द्रिय और विषयों के संयोग तो उत्पत्ति-विनाशशील और अनित्य हैं, इसलिए हे भारत! उनको तू सहन कर";
                }else if(i==14){
                    name="यं हि न व्यथयन्त्येते पुरुषं पुरुषर्षभ ।\n" +
                            "समदुःखसुखं धीरं सोऽमृतत्वाय कल्पते ॥";
                    desc="भावार्थ : क्योंकि हे पुरुषश्रेष्ठ! दुःख-सुख को समान समझने वाले जिस धीर पुरुष को ये इन्द्रिय और विषयों के संयोग व्याकुल नहीं करते, वह मोक्ष के योग्य होता है";
                }else if(i==15){
                    name="नासतो विद्यते भावो नाभावो विद्यते सतः ।\n" +
                            "उभयोरपि दृष्टोऽन्तस्त्वनयोस्तत्वदर्शिभिः ॥";
                    desc="भावार्थ : असत्\u200C वस्तु की तो सत्ता नहीं है और सत्\u200C का अभाव नहीं है। इस प्रकार इन दोनों का ही तत्व तत्वज्ञानी पुरुषों द्वारा देखा गया है";
                }else if(i==16){
                    name="अविनाशि तु तद्विद्धि येन सर्वमिदं ततम्\u200C ।\n" +
                            "विनाशमव्ययस्यास्य न कश्चित्कर्तुमर्हति ॥";
                    desc="भावार्थ : नाशरहित तो तू उसको जान, जिससे यह सम्पूर्ण जगत्\u200C- दृश्यवर्ग व्याप्त है। इस अविनाशी का विनाश करने में कोई भी समर्थ नहीं है";
                }else if(i==17){
                    name="अन्तवन्त इमे देहा नित्यस्योक्ताः शरीरिणः ।\n" +
                            "अनाशिनोऽप्रमेयस्य तस्माद्युध्यस्व भारत ॥";
                    desc="भावार्थ : इस नाशरहित, अप्रमेय, नित्यस्वरूप जीवात्मा के ये सब शरीर नाशवान कहे गए हैं, इसलिए हे भरतवंशी अर्जुन! तू युद्ध कर";
                }else if(i==18){
                    name="य एनं वेत्ति हन्तारं यश्चैनं मन्यते हतम्\u200C ।\n" +
                            "उभौ तौ न विजानीतो नायं हन्ति न हन्यते ॥";
                    desc="भावार्थ : जो इस आत्मा को मारने वाला समझता है तथा जो इसको मरा मानता है, वे दोनों ही नहीं जानते क्योंकि यह आत्मा वास्तव में न तो किसी को मारता है और न किसी द्वारा मारा जाता है";
                }else if(i==19){
                    name="न जायते म्रियते वा कदाचि-\n" +
                            "न्नायं भूत्वा भविता वा न भूयः ।\n" +
                            "अजो नित्यः शाश्वतोऽयं पुराणो-\n" +
                            "न हन्यते हन्यमाने शरीरे ॥";
                    desc="भावार्थ : यह आत्मा किसी काल में भी न तो जन्मता है और न मरता ही है तथा न यह उत्पन्न होकर फिर होने वाला ही है क्योंकि यह अजन्मा, नित्य, सनातन और पुरातन है, शरीर के मारे जाने पर भी यह नहीं मारा जाता";
                }else if(i==20){
                    name="वेदाविनाशिनं नित्यं य एनमजमव्ययम्\u200C ।\n" +
                            "कथं स पुरुषः पार्थ कं घातयति हन्ति कम्\u200C ॥";
                    desc="भावार्थ : हे पृथापुत्र अर्जुन! जो पुरुष इस आत्मा को नाशरहित, नित्य, अजन्मा और अव्यय जानता है, वह पुरुष कैसे किसको मरवाता है और कैसे किसको मारता है?";
                }else if(i==21){
                    name="वासांसि जीर्णानि यथा विहाय\n" +
                            "नवानि गृह्णाति नरोऽपराणि ।\n" +
                            "तथा शरीराणि विहाय जीर्णा-\n" +
                            "न्यन्यानि संयाति नवानि देही ॥";
                    desc="भावार्थ : जैसे मनुष्य पुराने वस्त्रों को त्यागकर दूसरे नए वस्त्रों को ग्रहण करता है, वैसे ही जीवात्मा पुराने शरीरों को त्यागकर दूसरे नए शरीरों को प्राप्त होता है";
                }else if(i==22){
                    name="नैनं छिन्दन्ति शस्त्राणि नैनं दहति पावकः ।\n" +
                            "न चैनं क्लेदयन्त्यापो न शोषयति मारुतः ॥";
                    desc="भावार्थ :  इस आत्मा को शस्त्र नहीं काट सकते, इसको आग नहीं जला सकती, इसको जल नहीं गला सकता और वायु नहीं सुखा सकता";
                }else if(i==23){
                    name="अच्छेद्योऽयमदाह्योऽयमक्लेद्योऽशोष्य एव च ।\n" +
                            "नित्यः सर्वगतः स्थाणुरचलोऽयं सनातनः ॥";
                    desc="भावार्थ : क्योंकि यह आत्मा अच्छेद्य है, यह आत्मा अदाह्य, अक्लेद्य और निःसंदेह अशोष्य है तथा यह आत्मा नित्य, सर्वव्यापी, अचल, स्थिर रहने वाला और सनातन है";
                }else if(i==24){
                    name="अव्यक्तोऽयमचिन्त्योऽयमविकार्योऽयमुच्यते ।\n" +
                            "तस्मादेवं विदित्वैनं नानुशोचितुमर्हसि॥";
                    desc="भावार्थ : यह आत्मा अव्यक्त है, यह आत्मा अचिन्त्य है और यह आत्मा विकाररहित कहा जाता है। इससे हे अर्जुन! इस आत्मा को उपर्युक्त प्रकार से जानकर तू शोक करने के योग्य नहीं है अर्थात्\u200C तुझे शोक करना उचित नहीं है";
                }else if(i==25){
                    name="अथ चैनं नित्यजातं नित्यं वा मन्यसे मृतम्\u200C ।\n" +
                            "तथापि त्वं महाबाहो नैवं शोचितुमर्हसि ॥";
                    desc="भावार्थ : किन्तु यदि तू इस आत्मा को सदा जन्मने वाला तथा सदा मरने वाला मानता हो, तो भी हे महाबाहो! तू इस प्रकार शोक करने योग्य नहीं है";
                }else if(i==26){
                    name="जातस्त हि ध्रुवो मृत्युर्ध्रुवं जन्म मृतस्य च ।\n" +
                            "तस्मादपरिहार्येऽर्थे न त्वं शोचितुमर्हसि ॥";
                    desc="भावार्थ : क्योंकि इस मान्यता के अनुसार जन्मे हुए की मृत्यु निश्चित है और मरे हुए का जन्म निश्चित है। इससे भी इस बिना उपाय वाले विषय में तू शोक करने योग्य नहीं है";
                }else if(i==27){
                    name="अव्यक्तादीनि भूतानि व्यक्तमध्यानि भारत ।\n" +
                            "अव्यक्तनिधनान्येव तत्र का परिदेवना ॥";
                    desc="भावार्थ : हे अर्जुन! सम्पूर्ण प्राणी जन्म से पहले अप्रकट थे और मरने के बाद भी अप्रकट हो जाने वाले हैं, केवल बीच में ही प्रकट हैं, फिर ऐसी स्थिति में क्या शोक करना है?";
                }else if(i==28){
                    name="आश्चर्यवत्पश्यति कश्चिदेन-\n" +
                            "माश्चर्यवद्वदति तथैव चान्यः ।\n" +
                            "आश्चर्यवच्चैनमन्यः श्रृणोति\n" +
                            "श्रुत्वाप्येनं वेद न चैव कश्चित्\u200C ॥";
                    desc="भावार्थ : कोई एक महापुरुष ही इस आत्मा को आश्चर्य की भाँति देखता है और वैसे ही दूसरा कोई महापुरुष ही इसके तत्व का आश्चर्य की भाँति वर्णन करता है तथा दूसरा कोई अधिकारी पुरुष ही इसे आश्चर्य की भाँति सुनता है और कोई-कोई तो सुनकर भी इसको नहीं जानता";
                }else if(i==29){
                    name="देही नित्यमवध्योऽयं देहे सर्वस्य भारत ।\n" +
                            "तस्मात्सर्वाणि भूतानि न त्वं शोचितुमर्हसि ॥";
                    desc="भावार्थ : हे अर्जुन! यह आत्मा सबके शरीर में सदा ही अवध्य (जिसका वध नहीं किया जा सके) है। इस कारण सम्पूर्ण प्राणियों के लिए तू शोक करने योग्य नहीं है";
                }else if(i==30){
                    name="स्वधर्ममपि चावेक्ष्य न विकम्पितुमर्हसि ।\n" +
                            "धर्म्याद्धि युद्धाच्छ्रेयोऽन्यत्क्षत्रियस्य न विद्यते ॥";
                    desc="भावार्थ : तथा अपने धर्म को देखकर भी तू भय करने योग्य नहीं है अर्थात्\u200C तुझे भय नहीं करना चाहिए क्योंकि क्षत्रिय के लिए धर्मयुक्त युद्ध से बढ़कर दूसरा कोई कल्याणकारी कर्तव्य नहीं है";
                }else if(i==31){
                    name="यदृच्छया चोपपन्नां स्वर्गद्वारमपावृतम्\u200C ।\n" +
                            "सुखिनः क्षत्रियाः पार्थ लभन्ते युद्धमीदृशम्\u200C ॥";
                    desc="भावार्थ : हे पार्थ! अपने-आप प्राप्त हुए और खुले हुए स्वर्ग के द्वार रूप इस प्रकार के युद्ध को भाग्यवान क्षत्रिय लोग ही पाते हैं";
                }else if(i==32){
                    name="अथ चेत्त्वमिमं धर्म्यं सङ्\u200Dग्रामं न करिष्यसि ।\n" +
                            "ततः स्वधर्मं कीर्तिं च हित्वा पापमवाप्स्यसि ॥";
                    desc="भावार्थ :  किन्तु यदि तू इस धर्मयुक्त युद्ध को नहीं करेगा तो स्वधर्म और कीर्ति को खोकर पाप को प्राप्त होगा ";
                }else if(i==33){
                    name="अकीर्तिं चापि भूतानि\n" +
                            "कथयिष्यन्ति तेऽव्ययाम्\u200C ।\n" +
                            "सम्भावितस्य चाकीर्ति-\n" +
                            "र्मरणादतिरिच्यते ॥";
                    desc="भावार्थ : तथा सब लोग तेरी बहुत काल तक रहने वाली अपकीर्ति का भी कथन करेंगे और माननीय पुरुष के लिए अपकीर्ति मरण से भी बढ़कर है";
                }else if(i==34){
                    name="भयाद्रणादुपरतं मंस्यन्ते त्वां महारथाः ।\n" +
                            "येषां च त्वं बहुमतो भूत्वा यास्यसि लाघवम्\u200C";
                    desc="भावार्थ : इऔर जिनकी दृष्टि में तू पहले बहुत सम्मानित होकर अब लघुता को प्राप्त होगा, वे महारथी लोग तुझे भय के कारण युद्ध से हटा हुआ मानेंगे";
                }else if(i==35){
                    name="अवाच्यवादांश्च बहून्\u200C वदिष्यन्ति तवाहिताः ।\n" +
                            "निन्दन्तस्तव सामर्थ्यं ततो दुःखतरं नु किम्\u200C ॥";
                    desc="भावार्थ : तेरे वैरी लोग तेरे सामर्थ्य की निंदा करते हुए तुझे बहुत से न कहने योग्य वचन भी कहेंगे, उससे अधिक दुःख और क्या होगा?";
                }else if(i==36){
                    name="हतो वा प्राप्स्यसि स्वर्गं जित्वा वा भोक्ष्यसे महीम्\u200C ।\n" +
                            "तस्मादुत्तिष्ठ कौन्तेय युद्धाय कृतनिश्चयः ॥";
                    desc="भावार्थ : या तो तू युद्ध में मारा जाकर स्वर्ग को प्राप्त होगा अथवा संग्राम में जीतकर पृथ्वी का राज्य भोगेगा। इस कारण हे अर्जुन! तू युद्ध के लिए निश्चय करके खड़ा हो जा";
                }else if(i==37){
                    name="सुखदुःखे समे कृत्वा लाभालाभौ जयाजयौ ।\n" +
                            "ततो युद्धाय युज्यस्व नैवं पापमवाप्स्यसि ॥";
                    desc="भावार्थ : जय-पराजय, लाभ-हानि और सुख-दुख को समान समझकर, उसके बाद युद्ध के लिए तैयार हो जा, इस प्रकार युद्ध करने से तू पाप को नहीं प्राप्त होगा";
                }else if(i==38){
                    name="एषा तेऽभिहिता साङ्\u200Dख्ये बुद्धिर्योगे त्विमां श्रृणु ।\n" +
                            "बुद्ध्\u200Cया युक्तो यया पार्थ कर्मबन्धं प्रहास्यसि ॥";
                    desc="भावार्थ : हे पार्थ! यह बुद्धि तेरे लिए ज्ञानयोग के विषय में कही गई और अब तू इसको कर्मयोग के (अध्याय 3 श्लोक 3 की टिप्पणी में इसका विस्तार देखें।) विषय में सुन- जिस बुद्धि से युक्त हुआ तू कर्मों के बंधन को भली-भाँति त्याग देगा अर्थात सर्वथा नष्ट कर डालेगा";
                }else if(i==39){
                    name="यनेहाभिक्रमनाशोऽस्ति प्रत्यवातो न विद्यते ।\n" +
                            "स्वल्पमप्यस्य धर्मस्य त्रायते महतो भयात्\u200C ॥";
                    desc="भावार्थ : इस कर्मयोग में आरंभ का अर्थात बीज का नाश नहीं है और उलटा फलरूप दोष भी नहीं है, बल्कि इस कर्मयोग रूप धर्म का थोड़ा-सा भी साधन जन्म-मृत्यु रूप महान भय से रक्षा कर लेता है";
                }else if(i==40){
                    name="व्यवसायात्मिका बुद्धिरेकेह कुरुनन्दन ।\n" +
                            "बहुशाका ह्यनन्ताश्च बुद्धयोऽव्यवसायिनाम्\u200C ॥";
                    desc="भावार्थ :  हे अर्जुन! इस कर्मयोग में निश्चयात्मिका बुद्धि एक ही होती है, किन्तु अस्थिर विचार वाले विवेकहीन सकाम मनुष्यों की बुद्धियाँ निश्चय ही बहुत भेदों वाली और अनन्त होती हैं";
                }else if(i==41){
                    name="यामिमां पुष्पितां वाचं प्रवदन्त्यविपश्चितः ।\n" +
                            "वेदवादरताः पार्थ नान्यदस्तीति वादिनः ॥";
                    desc="";
                }else if(i==42){
                    name="कामात्मानः स्वर्गपरा जन्मकर्मफलप्रदाम्\u200C ।\n" +
                            "क्रियाविश्लेषबहुलां भोगैश्वर्यगतिं प्रति ॥";
                    desc="";
                }else if(i==43){
                    name="भोगैश्वर्यप्रसक्तानां तयापहृतचेतसाम्\u200C ।\n" +
                            "व्यवसायात्मिका बुद्धिः समाधौ न विधीयते ॥";
                    desc="भावार्थ : हे अर्जुन! जो भोगों में तन्मय हो रहे हैं, जो कर्मफल के प्रशंसक वेदवाक्यों में ही प्रीति रखते हैं, जिनकी बुद्धि में स्वर्ग ही परम प्राप्य वस्तु है और जो स्वर्ग से बढ़कर दूसरी कोई वस्तु ही नहीं है- ऐसा कहने वाले हैं, वे अविवेकीजन इस प्रकार की जिस पुष्पित अर्थात्\u200C दिखाऊ शोभायुक्त वाणी को कहा करते हैं, जो कि जन्मरूप कर्मफल देने वाली एवं भोग तथा ऐश्वर्य की प्राप्ति के लिए नाना प्रकार की बहुत-सी क्रियाओं का वर्णन करने वाली है, उस वाणी द्वारा जिनका चित्त हर लिया गया है, जो भोग और ऐश्वर्य में अत्यन्त आसक्त हैं, उन पुरुषों की परमात्मा में निश्चियात्मिका बुद्धि नहीं होती";
                }else if(i==44){
                    name="त्रैगुण्यविषया वेदा निस्त्रैगुण्यो भवार्जुन ।\n" +
                            "निर्द्वन्द्वो नित्यसत्वस्थो निर्योगक्षेम आत्मवान्\u200C ॥";
                    desc="भावार्थ : हे अर्जुन! वेद उपर्युक्त प्रकार से तीनों गुणों के कार्य रूप समस्त भोगों एवं उनके साधनों का प्रतिपादन करने वाले हैं, इसलिए तू उन भोगों एवं उनके साधनों में आसक्तिहीन, हर्ष-शोकादि द्वंद्वों से रहित, नित्यवस्तु परमात्मा में स्थित योग (अप्राप्त की प्राप्ति का नाम 'योग' है।) क्षेम (प्राप्त वस्तु की रक्षा का नाम 'क्षेम' है।) को न चाहने वाला और स्वाधीन अन्तःकरण वाला हो";
                }else if(i==45){
                    name="यावानर्थ उदपाने सर्वतः सम्प्लुतोदके ।\n" +
                            "तावान्सर्वेषु वेदेषु ब्राह्मणस्य विजानतः ॥";
                    desc="भावार्थ : सब ओर से परिपूर्ण जलाशय के प्राप्त हो जाने पर छोटे जलाशय में मनुष्य का जितना प्रयोजन रहता है, ब्रह्म को तत्व से जानने वाले ब्राह्मण का समस्त वेदों में उतना ही प्रयोजन रह जाता है";
                }else if(i==46){
                    name="कर्मण्येवाधिकारस्ते मा फलेषु कदाचन ।\n" +
                            "मा कर्मफलहेतुर्भुर्मा ते संगोऽस्त्वकर्मणि ॥";
                    desc="भावार्थ : तेरा कर्म करने में ही अधिकार है, उसके फलों में कभी नहीं। इसलिए तू कर्मों के फल हेतु मत हो तथा तेरी कर्म न करने में भी आसक्ति न हो";
                }else if(i==47){
                    name="योगस्थः कुरु कर्माणि संग त्यक्त्वा धनंजय ।\n" +
                            "सिद्धयसिद्धयोः समो भूत्वा समत्वं योग उच्यते ॥";
                    desc="भावार्थ : हे धनंजय! तू आसक्ति को त्यागकर तथा सिद्धि और असिद्धि में समान बुद्धिवाला होकर योग में स्थित हुआ कर्तव्य कर्मों को कर, समत्व (जो कुछ भी कर्म किया जाए, उसके पूर्ण होने और न होने में तथा उसके फल में समभाव रहने का नाम 'समत्व' है।) ही योग कहलाता है";
                }else if(i==48){
                    name="दूरेण ह्यवरं कर्म बुद्धियोगाद्धनंजय ।\n" +
                            "बुद्धौ शरणमन्विच्छ कृपणाः फलहेतवः ॥";
                    desc="भावार्थ : इस समत्वरूप बुद्धियोग से सकाम कर्म अत्यन्त ही निम्न श्रेणी का है। इसलिए हे धनंजय! तू समबुद्धि में ही रक्षा का उपाय ढूँढ अर्थात्\u200C बुद्धियोग का ही आश्रय ग्रहण कर क्योंकि फल के हेतु बनने वाले अत्यन्त दीन हैं";
                }else if(i==49){
                    name="बुद्धियुक्तो जहातीह उभे सुकृतदुष्कृते ।\n" +
                            "तस्माद्योगाय युज्यस्व योगः कर्मसु कौशलम्\u200C ॥";
                    desc="भावार्थ : समबुद्धियुक्त पुरुष पुण्य और पाप दोनों को इसी लोक में त्याग देता है अर्थात उनसे मुक्त हो जाता है। इससे तू समत्व रूप योग में लग जा, यह समत्व रूप योग ही कर्मों में कुशलता है अर्थात कर्मबंध से छूटने का उपाय है";
                }else if(i==50){
                    name="कर्मजं बुद्धियुक्ता हि फलं त्यक्त्वा मनीषिणः ।\n" +
                            "जन्मबन्धविनिर्मुक्ताः पदं गच्छन्त्यनामयम्\u200C ॥";
                    desc="भावार्थ : क्योंकि समबुद्धि से युक्त ज्ञानीजन कर्मों से उत्पन्न होने वाले फल को त्यागकर जन्मरूप बंधन से मुक्त हो निर्विकार परम पद को प्राप्त हो जाते हैं";
                }else if(i==51){
                    name="यदा ते मोहकलिलं बुद्धिर्व्यतितरिष्यति ।\n" +
                            "तदा गन्तासि निर्वेदं श्रोतव्यस्य श्रुतस्य च ॥";
                    desc="भावार्थ : जिस काल में तेरी बुद्धि मोहरूपी दलदल को भलीभाँति पार कर जाएगी, उस समय तू सुने हुए और सुनने में आने वाले इस लोक और परलोक संबंधी सभी भोगों से वैराग्य को प्राप्त हो जाएगा";
                }else if(i==52){
                    name="श्रुतिविप्रतिपन्ना ते यदा स्थास्यति निश्चला ।\n" +
                            "समाधावचला बुद्धिस्तदा योगमवाप्स्यसि ॥";
                    desc="भावार्थ : भाँति-भाँति के वचनों को सुनने से विचलित हुई तेरी बुद्धि जब परमात्मा में अचल और स्थिर ठहर जाएगी, तब तू योग को प्राप्त हो जाएगा अर्थात तेरा परमात्मा से नित्य संयोग हो जाएगा";
                }else if(i==53){
                    name="स्थितप्रज्ञस्य का भाषा समाधिस्थस्य केशव ।\n" +
                            "स्थितधीः किं प्रभाषेत किमासीत व्रजेत किम्\u200C ॥";
                    desc="भावार्थ : अर्जुन बोले- हे केशव! समाधि में स्थित परमात्मा को प्राप्त हुए स्थिरबुद्धि पुरुष का क्या लक्षण है? वह स्थिरबुद्धि पुरुष कैसे बोलता है, कैसे बैठता है और कैसे चलता है?";
                }else if(i==54){
                    name="प्रजहाति यदा कामान्\u200C सर्वान्पार्थ मनोगतान्\u200C ।\n" +
                            "आत्मयेवात्मना तुष्टः स्थितप्रज्ञस्तदोच्यते ॥";
                    desc="भावार्थ : श्री भगवान्\u200C बोले- हे अर्जुन! जिस काल में यह पुरुष मन में स्थित सम्पूर्ण कामनाओं को भलीभाँति त्याग देता है और आत्मा से आत्मा में ही संतुष्ट रहता है, उस काल में वह स्थितप्रज्ञ कहा जाता है";
                }else if(i==55){
                    name="दुःखेष्वनुद्विग्नमनाः सुखेषु विगतस्पृहः ।\n" +
                            "वीतरागभयक्रोधः स्थितधीर्मुनिरुच्यते ॥";
                    desc="भावार्थ :  दुःखों की प्राप्ति होने पर जिसके मन में उद्वेग नहीं होता, सुखों की प्राप्ति में सर्वथा निःस्पृह है तथा जिसके राग, भय और क्रोध नष्ट हो गए हैं, ऐसा मुनि स्थिरबुद्धि कहा जाता है";
                }else if(i==56){
                    name="यः सर्वत्रानभिस्नेहस्तत्तत्प्राप्य शुभाशुभम्\u200C ।\n" +
                            "नाभिनंदति न द्वेष्टि तस्य प्रज्ञा प्रतिष्ठिता ॥";
                    desc="भावार्थ : जो पुरुष सर्वत्र स्नेहरहित हुआ उस-उस शुभ या अशुभ वस्तु को प्राप्त होकर न प्रसन्न होता है और न द्वेष करता है, उसकी बुद्धि स्थिर है";
                }else if(i==57){
                    name="यदा संहरते चायं कूर्मोऽङ्गनीव सर्वशः ।\n" +
                            "इन्द्रियाणीन्द्रियार्थेभ्यस्तस्य प्रज्ञा प्रतिष्ठिता ॥";
                    desc="भावार्थ : और कछुवा सब ओर से अपने अंगों को जैसे समेट लेता है, वैसे ही जब यह पुरुष इन्द्रियों के विषयों से इन्द्रियों को सब प्रकार से हटा लेता है, तब उसकी बुद्धि स्थिर है (ऐसा समझना चाहिए)";
                }else if(i==58){
                    name="विषया विनिवर्तन्ते निराहारस्य देहिनः ।\n" +
                            "रसवर्जं रसोऽप्यस्य परं दृष्टवा निवर्तते ॥";
                    desc="भावार्थ : इन्द्रियों द्वारा विषयों को ग्रहण न करने वाले पुरुष के भी केवल विषय तो निवृत्त हो जाते हैं, परन्तु उनमें रहने वाली आसक्ति निवृत्त नहीं होती। इस स्थितप्रज्ञ पुरुष की तो आसक्ति भी परमात्मा का साक्षात्कार करके निवृत्त हो जाती है";
                }else if(i==59){
                    name="यततो ह्यपि कौन्तेय पुरुषस्य विपश्चितः ।\n" +
                            "इन्द्रियाणि प्रमाथीनि हरन्ति प्रसभं मनः ॥";
                    desc="भावार्थ : हे अर्जुन! आसक्ति का नाश न होने के कारण ये प्रमथन स्वभाव वाली इन्द्रियाँ यत्न करते हुए बुद्धिमान पुरुष के मन को भी बलात्\u200C हर लेती हैं॥";
                }else if(i==60){
                    name="तानि सर्वाणि संयम्य युक्त आसीत मत्परः ।\n" +
                            "वशे हि यस्येन्द्रियाणि तस्य प्रज्ञा प्रतिष्ठिता ॥";
                    desc="भावार्थ : इसलिए साधक को चाहिए कि वह उन सम्पूर्ण इन्द्रियों को वश में करके समाहित चित्त हुआ मेरे परायण होकर ध्यान में बैठे क्योंकि जिस पुरुष की इन्द्रियाँ वश में होती हैं, उसी की बुद्धि स्थिर हो जाती है";
                }else if(i==61){
                    name="ध्यायतो विषयान्पुंसः संगस्तेषूपजायते ।\n" +
                            "संगात्संजायते कामः कामात्क्रोधोऽभिजायते ॥";
                    desc="भावार्थ : विषयों का चिन्तन करने वाले पुरुष की उन विषयों में आसक्ति हो जाती है, आसक्ति से उन विषयों की कामना उत्पन्न होती है और कामना में विघ्न पड़ने से क्रोध उत्पन्न होता है";
                }else if(i==62){
                    name="क्रोधाद्\u200Dभवति सम्मोहः सम्मोहात्स्मृतिविभ्रमः ।\n" +
                            "स्मृतिभ्रंशाद् बुद्धिनाशो बुद्धिनाशात्प्रणश्यति ॥";
                    desc="भावार्थ : क्रोध से अत्यन्त मूढ़ भाव उत्पन्न हो जाता है, मूढ़ भाव से स्मृति में भ्रम हो जाता है, स्मृति में भ्रम हो जाने से बुद्धि अर्थात ज्ञानशक्ति का नाश हो जाता है और बुद्धि का नाश हो जाने से यह पुरुष अपनी स्थिति से गिर जाता है";
                }else if(i==63){
                    name="रागद्वेषवियुक्तैस्तु विषयानिन्द्रियैश्चरन्\u200C ।\n" +
                            "आत्मवश्यैर्विधेयात्मा प्रसादमधिगच्छति ॥";
                    desc="भावार्थ : परंन्तु अपने अधीन किए हुए अन्तःकरण वाला साधक अपने वश में की हुई, राग-द्वेष रहित इन्द्रियों द्वारा विषयों में विचरण करता हुआ अन्तःकरण की प्रसन्नता को प्राप्त होता है";
                }else if(i==64){
                    name="प्रसादे सर्वदुःखानां हानिरस्योपजायते ।\n" +
                            "प्रसन्नचेतसो ह्याशु बुद्धिः पर्यवतिष्ठते ॥";
                    desc="भावार्थ : अन्तःकरण की प्रसन्नता होने पर इसके सम्पूर्ण दुःखों का अभाव हो जाता है और उस प्रसन्नचित्त वाले कर्मयोगी की बुद्धि शीघ्र ही सब ओर से हटकर एक परमात्मा में ही भलीभाँति स्थिर हो जाती है";
                }else if(i==65){
                    name="नास्ति बुद्धिरयुक्तस्य न चायुक्तस्य भावना ।\n" +
                            "न चाभावयतः शान्तिरशान्तस्य कुतः सुखम्\u200C ॥";
                    desc="भावार्थ : न जीते हुए मन और इन्द्रियों वाले पुरुष में निश्चयात्मिका बुद्धि नहीं होती और उस अयुक्त मनुष्य के अन्तःकरण में भावना भी नहीं होती तथा भावनाहीन मनुष्य को शान्ति नहीं मिलती और शान्तिरहित मनुष्य को सुख कैसे मिल सकता है?";
                }else if(i==66){
                    name="इन्द्रियाणां हि चरतां यन्मनोऽनुविधीयते ।\n" +
                            "तदस्य हरति प्रज्ञां वायुर्नावमिवाम्भसि ॥";
                    desc="भावार्थ : क्योंकि जैसे जल में चलने वाली नाव को वायु हर लेती है, वैसे ही विषयों में विचरती हुई इन्द्रियों में से मन जिस इन्द्रिय के साथ रहता है, वह एक ही इन्द्रिय इस अयुक्त पुरुष की बुद्धि को हर लेती है";
                }else if(i==67){
                    name="तस्माद्यस्य महाबाहो निगृहीतानि सर्वशः ।\n" +
                            "इन्द्रियाणीन्द्रियार्थेभ्यस्तस्य प्रज्ञा प्रतिष्ठिता ॥";
                    desc="भावार्थ : इसलिए हे महाबाहो! जिस पुरुष की इन्द्रियाँ इन्द्रियों के विषयों में सब प्रकार निग्रह की हुई हैं, उसी की बुद्धि स्थिर है";
                }else if(i==68){
                    name="या निशा सर्वभूतानां तस्यां जागर्ति संयमी ।\n" +
                            "यस्यां जाग्रति भूतानि सा निशा पश्यतो मुनेः ॥";
                    desc="भावार्थ : सम्पूर्ण प्राणियों के लिए जो रात्रि के समान है, उस नित्य ज्ञानस्वरूप परमानन्द की प्राप्ति में स्थितप्रज्ञ योगी जागता है और जिस नाशवान सांसारिक सुख की प्राप्ति में सब प्राणी जागते हैं, परमात्मा के तत्व को जानने वाले मुनि के लिए वह रात्रि के समान है";
                }else if(i==69){
                    name="आपूर्यमाणमचलप्रतिष्ठं-\n" +
                            "समुद्रमापः प्रविशन्ति यद्वत्\u200C ।\n" +
                            "तद्वत्कामा यं प्रविशन्ति सर्वे\n" +
                            "स शान्तिमाप्नोति न कामकामी ॥";
                    desc="भावार्थ : जैसे नाना नदियों के जल सब ओर से परिपूर्ण, अचल प्रतिष्ठा वाले समुद्र में उसको विचलित न करते हुए ही समा जाते हैं, वैसे ही सब भोग जिस स्थितप्रज्ञ पुरुष में किसी प्रकार का विकार उत्पन्न किए बिना ही समा जाते हैं, वही पुरुष परम शान्ति को प्राप्त होता है, भोगों को चाहने वाला नहीं";
                }else if(i==70){
                    name="विहाय कामान्यः सर्वान्पुमांश्चरति निःस्पृहः ।\n" +
                            "निर्ममो निरहंकारः स शान्तिमधिगच्छति ॥";
                    desc="भावार्थ : जो पुरुष सम्पूर्ण कामनाओं को त्याग कर ममतारहित, अहंकाररहित और स्पृहारहित हुआ विचरता है, वही शांति को प्राप्त होता है अर्थात वह शान्ति को प्राप्त है";
                }else if(i==71){
                    name="एषा ब्राह्मी स्थितिः पार्थ नैनां प्राप्य विमुह्यति ।\n" +
                            "स्थित्वास्यामन्तकालेऽपि ब्रह्मनिर्वाणमृच्छति ॥";
                    desc="भावार्थ : हे अर्जुन! यह ब्रह्म को प्राप्त हुए पुरुष की स्थिति है, इसको प्राप्त होकर योगी कभी मोहित नहीं होता और अंतकाल में भी इस ब्राह्मी स्थिति में स्थित होकर ब्रह्मानन्द को प्राप्त हो जाता है";
                }
            }else if(n==2){
                if(i==0){
                    name="ज्यायसी चेत्कर्मणस्ते मता बुद्धिर्जनार्दन ।\n" +
                            "तत्किं कर्मणि घोरे मां नियोजयसि केशव ॥";
                    desc="भावार्थ : अर्जुन बोले- हे जनार्दन! यदि आपको कर्म की अपेक्षा ज्ञान श्रेष्ठ मान्य है तो फिर हे केशव! मुझे भयंकर कर्म में क्यों लगाते हैं?";
                }else if(i==1){
                    name="व्यामिश्रेणेव वाक्येन बुद्धिं मोहयसीव मे ।\n" +
                            "तदेकं वद निश्चित्य येन श्रेयोऽहमाप्नुयाम्\u200C ॥";
                    desc="भावार्थ : आप मिले हुए-से वचनों से मेरी बुद्धि को मानो मोहित कर रहे हैं। इसलिए उस एक बात को निश्चित करके कहिए जिससे मैं कल्याण को प्राप्त हो जाऊँ";
                }else if(i==2){
                    name="लोकेऽस्मिन्द्विविधा निष्ठा पुरा प्रोक्ता मयानघ ।\n" +
                            "ज्ञानयोगेन साङ्\u200Dख्यानां कर्मयोगेन योगिनाम्\u200C ॥";
                    desc="भावार्थ :  श्रीभगवान बोले- हे निष्पाप! इस लोक में दो प्रकार की निष्ठा (साधन की परिपक्व अवस्था अर्थात पराकाष्ठा का नाम 'निष्ठा' है।) मेरे द्वारा पहले कही गई है। उनमें से सांख्य योगियों की निष्ठा तो ज्ञान योग से (माया से उत्पन्न हुए सम्पूर्ण गुण ही गुणों में बरतते हैं, ऐसे समझकर तथा मन, इन्द्रिय और शरीर द्वारा होने वाली सम्पूर्ण क्रियाओं में कर्तापन के अभिमान से रहित होकर सर्वव्यापी सच्चिदानंदघन परमात्मा में एकीभाव से स्थित रहने का नाम 'ज्ञान योग' है, इसी को 'संन्यास', 'सांख्ययोग' आदि नामों से कहा गया है।) और योगियों की निष्ठा कर्मयोग से (फल और आसक्ति को त्यागकर भगवदाज्ञानुसार केवल भगवदर्थ समत्व बुद्धि से कर्म करने का नाम 'निष्काम कर्मयोग' है, इसी को 'समत्वयोग', 'बुद्धियोग', 'कर्मयोग', 'तदर्थकर्म', 'मदर्थकर्म', 'मत्कर्म' आदि नामों से कहा गया है।) होती है";
                }else if(i==3){
                    name="न कर्मणामनारंभान्नैष्कर्म्यं पुरुषोऽश्नुते ।\n" +
                            "न च सन्न्यसनादेव सिद्धिं समधिगच्छति ॥";
                    desc="भावार्थ : मनुष्य न तो कर्मों का आरंभ किए बिना निष्कर्मता (जिस अवस्था को प्राप्त हुए पुरुष के कर्म अकर्म हो जाते हैं अर्थात फल उत्पन्न नहीं कर सकते, उस अवस्था का नाम 'निष्कर्मता' है।) को यानी योगनिष्ठा को प्राप्त होता है और न कर्मों के केवल त्यागमात्र से सिद्धि यानी सांख्यनिष्ठा को ही प्राप्त होता है";
                }else if(i==4){
                    name="न हि कश्चित्क्षणमपि जातु तिष्ठत्यकर्मकृत्\u200C ।\n" +
                            "कार्यते ह्यवशः कर्म सर्वः प्रकृतिजैर्गुणैः ॥";
                    desc="भावार्थ : निःसंदेह कोई भी मनुष्य किसी भी काल में क्षणमात्र भी बिना कर्म किए नहीं रहता क्योंकि सारा मनुष्य समुदाय प्रकृति जनित गुणों द्वारा परवश हुआ कर्म करने के लिए बाध्य किया जाता है";
                }else if(i==5){
                    name="कर्मेन्द्रियाणि संयम्य य आस्ते मनसा स्मरन्\u200C ।\n" +
                            "इन्द्रियार्थान्विमूढात्मा मिथ्याचारः स उच्यते ॥";
                    desc="भावार्थ : जो मूढ़ बुद्धि मनुष्य समस्त इन्द्रियों को हठपूर्वक ऊपर से रोककर मन से उन इन्द्रियों के विषयों का चिन्तन करता रहता है, वह मिथ्याचारी अर्थात दम्भी कहा जाता है";
                }else if(i==6){
                    name="यस्त्विन्द्रियाणि मनसा नियम्यारभतेऽर्जुन ।\n" +
                            "कर्मेन्द्रियैः कर्मयोगमसक्तः स विशिष्यते ॥";
                    desc="भावार्थ : किन्तु हे अर्जुन! जो पुरुष मन से इन्द्रियों को वश में करके अनासक्त हुआ समस्त इन्द्रियों द्वारा कर्मयोग का आचरण करता है, वही श्रेष्ठ है";
                }else if(i==7){
                    name="नियतं कुरु कर्म त्वं कर्म ज्यायो ह्यकर्मणः।\n" +
                            "शरीरयात्रापि च ते न प्रसिद्धयेदकर्मणः ॥";
                    desc="भावार्थ :  तू शास्त्रविहित कर्तव्यकर्म कर क्योंकि कर्म न करने की अपेक्षा कर्म करना श्रेष्ठ है तथा कर्म न करने से तेरा शरीर-निर्वाह भी नहीं सिद्ध होगा";
                }else if(i==8){
                    name="यज्ञार्थात्कर्मणोऽन्यत्र लोकोऽयं कर्मबंधनः ।\n" +
                            "तदर्थं कर्म कौन्तेय मुक्तसंगः समाचर ॥";
                    desc="भावार्थ : यज्ञ के निमित्त किए जाने वाले कर्मों से अतिरिक्त दूसरे कर्मों में लगा हुआ ही यह मुनष्य समुदाय कर्मों से बँधता है। इसलिए हे अर्जुन! तू आसक्ति से रहित होकर उस यज्ञ के निमित्त ही भलीभाँति कर्तव्य कर्म कर";
                }else if(i==9){
                    name="सहयज्ञाः प्रजाः सृष्टा पुरोवाचप्रजापतिः ।\n" +
                            "अनेन प्रसविष्यध्वमेष वोऽस्त्विष्टकामधुक्\u200C ॥";
                    desc="भावार्थ : प्रजापति ब्रह्मा ने कल्प के आदि में यज्ञ सहित प्रजाओं को रचकर उनसे कहा कि तुम लोग इस यज्ञ द्वारा वृद्धि को प्राप्त होओ और यह यज्ञ तुम लोगों को इच्छित भोग प्रदान करने वाला हो";
                }else if(i==10){
                    name="देवान्भावयतानेन ते देवा भावयन्तु वः ।\n" +
                            "परस्परं भावयन्तः श्रेयः परमवाप्स्यथ ॥";
                    desc="भावार्थ :  तुम लोग इस यज्ञ द्वारा देवताओं को उन्नत करो और वे देवता तुम लोगों को उन्नत करें। इस प्रकार निःस्वार्थ भाव से एक-दूसरे को उन्नत करते हुए तुम लोग परम कल्याण को प्राप्त हो जाओगे";
                }else if(i==11){
                    name="इष्टान्भोगान्हि वो देवा दास्यन्ते यज्ञभाविताः ।\n" +
                            "तैर्दत्तानप्रदायैभ्यो यो भुंक्ते स्तेन एव सः ॥";
                    desc="भावार्थ : यज्ञ द्वारा बढ़ाए हुए देवता तुम लोगों को बिना माँगे ही इच्छित भोग निश्चय ही देते रहेंगे। इस प्रकार उन देवताओं द्वारा दिए हुए भोगों को जो पुरुष उनको बिना दिए स्वयं भोगता है, वह चोर ही है";
                }else if(i==12){
                    name="यज्ञशिष्टाशिनः सन्तो मुच्यन्ते सर्वकिल्बिषैः ।\n" +
                            "भुञ्जते ते त्वघं पापा ये पचन्त्यात्मकारणात्\u200C ॥";
                    desc="भावार्थ : यज्ञ से बचे हुए अन्न को खाने वाले श्रेष्ठ पुरुष सब पापों से मुक्त हो जाते हैं और जो पापी लोग अपना शरीर-पोषण करने के लिए ही अन्न पकाते हैं, वे तो पाप को ही खाते हैं";
                }else if(i==13){
                    name="अन्नाद्भवन्ति भूतानि पर्जन्यादन्नसम्भवः ।\n" +
                            "यज्ञाद्भवति पर्जन्यो यज्ञः कर्मसमुद्भवः ॥";
                    desc="";
                }else if(i==14){
                    name="कर्म ब्रह्मोद्भवं विद्धि ब्रह्माक्षरसमुद्भवम्\u200C ।\n" +
                            "तस्मात्सर्वगतं ब्रह्म नित्यं यज्ञे प्रतिष्ठितम्\u200C ॥";
                    desc="भावार्थ : सम्पूर्ण प्राणी अन्न से उत्पन्न होते हैं, अन्न की उत्पत्ति वृष्टि से होती है, वृष्टि यज्ञ से होती है और यज्ञ विहित कर्मों से उत्पन्न होने वाला है। कर्मसमुदाय को तू वेद से उत्पन्न और वेद को अविनाशी परमात्मा से उत्पन्न हुआ जान। इससे सिद्ध होता है कि सर्वव्यापी परम अक्षर परमात्मा सदा ही यज्ञ में प्रतिष्ठित है";
                }else if(i==15){
                    name="एवं प्रवर्तितं चक्रं नानुवर्तयतीह यः ।\n" +
                            "अघायुरिन्द्रियारामो मोघं पार्थ स जीवति ॥";
                    desc="भावार्थ : हे पार्थ! जो पुरुष इस लोक में इस प्रकार परम्परा से प्रचलित सृष्टिचक्र के अनुकूल नहीं बरतता अर्थात अपने कर्तव्य का पालन नहीं करता, वह इन्द्रियों द्वारा भोगों में रमण करने वाला पापायु पुरुष व्यर्थ ही जीता है";
                }else if(i==16){
                    name="यस्त्वात्मरतिरेव स्यादात्मतृप्तश्च मानवः ।\n" +
                            "आत्मन्येव च सन्तुष्टस्तस्य कार्यं न विद्यते ॥";
                    desc="भावार्थ : परन्तु जो मनुष्य आत्मा में ही रमण करने वाला और आत्मा में ही तृप्त तथा आत्मा में ही सन्तुष्ट हो, उसके लिए कोई कर्तव्य नहीं है";
                }else if(i==17){
                    name="नैव तस्य कृतेनार्थो नाकृतेनेह कश्चन ।\n" +
                            "न चास्य सर्वभूतेषु कश्चिदर्थव्यपाश्रयः ॥";
                    desc="भावार्थ : उस महापुरुष का इस विश्व में न तो कर्म करने से कोई प्रयोजन रहता है और न कर्मों के न करने से ही कोई प्रयोजन रहता है तथा सम्पूर्ण प्राणियों में भी इसका किञ्चिन्मात्र भी स्वार्थ का संबंध नहीं रहता";
                }else if(i==18){
                    name="तस्मादसक्तः सततं कार्यं कर्म समाचर ।\n" +
                            "असक्तो ह्याचरन्कर्म परमाप्नोति पुरुषः ॥";
                    desc="भावार्थ :  इसलिए तू निरन्तर आसक्ति से रहित होकर सदा कर्तव्यकर्म को भलीभाँति करता रह क्योंकि आसक्ति से रहित होकर कर्म करता हुआ मनुष्य परमात्मा को प्राप्त हो जाता है";
                }else if(i==19){
                    name="कर्मणैव हि संसिद्धिमास्थिता जनकादयः ।\n" +
                            "लोकसंग्रहमेवापि सम्पश्यन्कर्तुमर्हसि ॥";
                    desc="भावार्थ : जनकादि ज्ञानीजन भी आसक्ति रहित कर्मद्वारा ही परम सिद्धि को प्राप्त हुए थे, इसलिए तथा लोकसंग्रह को देखते हुए भी तू कर्म करने के ही योग्य है अर्थात तुझे कर्म करना ही उचित है";
                }else if(i==20){
                    name="यद्यदाचरति श्रेष्ठस्तत्तदेवेतरो जनः ।\n" +
                            "स यत्प्रमाणं कुरुते लोकस्तदनुवर्तते ॥";
                    desc="भावार्थ : श्रेष्ठ पुरुष जो-जो आचरण करता है, अन्य पुरुष भी वैसा-वैसा ही आचरण करते हैं। वह जो कुछ प्रमाण कर देता है, समस्त मनुष्य-समुदाय उसी के अनुसार बरतने लग जाता है (यहाँ क्रिया में एकवचन है, परन्तु 'लोक' शब्द समुदायवाचक होने से भाषा में बहुवचन की क्रिया लिखी गई है।)";
                }else if(i==21){
                    name="न मे पार्थास्ति कर्तव्यं त्रिषु लोकेषु किंचन ।\n" +
                            "नानवाप्तमवाप्तव्यं वर्त एव च कर्मणि ॥";
                    desc="भावार्थ : हे अर्जुन! मुझे इन तीनों लोकों में न तो कुछ कर्तव्य है और न कोई भी प्राप्त करने योग्य वस्तु अप्राप्त है, तो भी मैं कर्म में ही बरतता हूँ";
                }else if(i==22){
                    name="यदि ह्यहं न वर्तेयं जातु कर्मण्यतन्द्रितः ।\n" +
                            "मम वर्त्मानुवर्तन्ते मनुष्याः पार्थ सर्वशः ॥";
                    desc="भावार्थ : क्योंकि हे पार्थ! यदि कदाचित्\u200C मैं सावधान होकर कर्मों में न बरतूँ तो बड़ी हानि हो जाए क्योंकि मनुष्य सब प्रकार से मेरे ही मार्ग का अनुसरण करते हैं";
                }else if(i==23){
                    name="यदि उत्सीदेयुरिमे लोका न कुर्यां कर्म चेदहम्\u200C ।\n" +
                            "संकरस्य च कर्ता स्यामुपहन्यामिमाः प्रजाः ॥";
                    desc="भावार्थ : इसलिए यदि मैं कर्म न करूँ तो ये सब मनुष्य नष्ट-भ्रष्ट हो जाएँ और मैं संकरता का करने वाला होऊँ तथा इस समस्त प्रजा को नष्ट करने वाला बनूँ";
                }else if(i==24){
                    name="सक्ताः कर्मण्यविद्वांसो यथा कुर्वन्ति भारत ।\n" +
                            "कुर्याद्विद्वांस्तथासक्तश्चिकीर्षुर्लोकसंग्रहम्\u200C ॥";
                    desc="भावार्थ : हे भारत! कर्म में आसक्त हुए अज्ञानीजन जिस प्रकार कर्म करते हैं, आसक्तिरहित विद्वान भी लोकसंग्रह करना चाहता हुआ उसी प्रकार कर्म करे";
                }else if(i==25){
                    name="न बुद्धिभेदं जनयेदज्ञानां कर्मसङि्गनाम्\u200C ।\n" +
                            "जोषयेत्सर्वकर्माणि विद्वान्युक्तः समाचरन्\u200C ॥";
                    desc="भावार्थ : परमात्मा के स्वरूप में अटल स्थित हुए ज्ञानी पुरुष को चाहिए कि वह शास्त्रविहित कर्मों में आसक्ति वाले अज्ञानियों की बुद्धि में भ्रम अर्थात कर्मों में अश्रद्धा उत्पन्न न करे, किन्तु स्वयं शास्त्रविहित समस्त कर्म भलीभाँति करता हुआ उनसे भी वैसे ही करवाए";
                }else if(i==26){
                    name="प्रकृतेः क्रियमाणानि गुणैः कर्माणि सर्वशः ।\n" +
                            "अहंकारविमूढात्मा कर्ताहमिति मन्यते ॥";
                    desc="भावार्थ : वास्तव में सम्पूर्ण कर्म सब प्रकार से प्रकृति के गुणों द्वारा किए जाते हैं, तो भी जिसका अन्तःकरण अहंकार से मोहित हो रहा है, ऐसा अज्ञानी 'मैं कर्ता हूँ' ऐसा मानता है";
                }else if(i==27){
                    name="तत्त्ववित्तु महाबाहो गुणकर्मविभागयोः ।\n" +
                            "गुणा गुणेषु वर्तन्त इति मत्वा न सज्जते ॥";
                    desc="भावार्थ : परन्तु हे महाबाहो! गुण विभाग और कर्म विभाग (त्रिगुणात्मक माया के कार्यरूप पाँच महाभूत और मन, बुद्धि, अहंकार तथा पाँच ज्ञानेन्द्रियाँ, पाँच कर्मेन्द्रियाँ और शब्दादि पाँच विषय- इन सबके समुदाय का नाम 'गुण विभाग' है और इनकी परस्पर की चेष्टाओं का नाम 'कर्म विभाग' है।) के तत्व (उपर्युक्त 'गुण विभाग' और 'कर्म विभाग' से आत्मा को पृथक अर्थात्\u200C निर्लेप जानना ही इनका तत्व जानना है।) को जानने वाला ज्ञान योगी सम्पूर्ण गुण ही गुणों में बरत रहे हैं, ऐसा समझकर उनमें आसक्त नहीं होता";
                }else if(i==28){
                    name="प्रकृतेर्गुणसम्मूढ़ाः सज्जन्ते गुणकर्मसु ।\n" +
                            "तानकृत्स्नविदो मन्दान्कृत्स्नविन्न विचालयेत्\u200C ॥";
                    desc="भावार्थ : प्रकृति के गुणों से अत्यन्त मोहित हुए मनुष्य गुणों में और कर्मों में आसक्त रहते हैं, उन पूर्णतया न समझने वाले मन्दबुद्धि अज्ञानियों को पूर्णतया जानने वाला ज्ञानी विचलित न करे";
                }else if(i==29){
                    name="मयि सर्वाणि कर्माणि सन्नयस्याध्यात्मचेतसा ।\n" +
                            "निराशीर्निर्ममो भूत्वा युध्यस्व विगतज्वरः ॥";
                    desc="भावार्थ : मुझ अन्तर्यामी परमात्मा में लगे हुए चित्त द्वारा सम्पूर्ण कर्मों को मुझमें अर्पण करके आशारहित, ममतारहित और सन्तापरहित होकर युद्ध कर";
                }else if(i==30){
                    name="ये मे मतमिदं नित्यमनुतिष्ठन्ति मानवाः ।\n" +
                            "श्रद्धावन्तोऽनसूयन्तो मुच्यन्ते तेऽति कर्मभिः ॥";
                    desc="भावार्थ : जो कोई मनुष्य दोषदृष्टि से रहित और श्रद्धायुक्त होकर मेरे इस मत का सदा अनुसरण करते हैं, वे भी सम्पूर्ण कर्मों से छूट जाते हैं";
                }else if(i==31){
                    name="ये त्वेतदभ्यसूयन्तो नानुतिष्ठन्ति मे मतम्\u200C ।\n" +
                            "सर्वज्ञानविमूढांस्तान्विद्धि नष्टानचेतसः ॥";
                    desc="भावार्थ : परन्तु जो मनुष्य मुझमें दोषारोपण करते हुए मेरे इस मत के अनुसार नहीं चलते हैं, उन मूर्खों को तू सम्पूर्ण ज्ञानों में मोहित और नष्ट हुए ही समझ";
                }else if(i==32){
                    name="सदृशं चेष्टते स्वस्याः प्रकृतेर्ज्ञानवानपि ।\n" +
                            "प्रकृतिं यान्ति भूतानि निग्रहः किं करिष्यति ॥";
                    desc="भावार्थ : सभी प्राणी प्रकृति को प्राप्त होते हैं अर्थात अपने स्वभाव के परवश हुए कर्म करते हैं। ज्ञानवान्\u200C भी अपनी प्रकृति के अनुसार चेष्टा करता है। फिर इसमें किसी का हठ क्या करेगा";
                }else if(i==33){
                    name="इन्द्रियस्येन्द्रियस्यार्थे रागद्वेषौ व्यवस्थितौ ।\n" +
                            "तयोर्न वशमागच्छेत्तौ ह्यस्य परिपन्थिनौ ॥";
                    desc="भावार्थ : इन्द्रिय-इन्द्रिय के अर्थ में अर्थात प्रत्येक इन्द्रिय के विषय में राग और द्वेष छिपे हुए स्थित हैं। मनुष्य को उन दोनों के वश में नहीं होना चाहिए क्योंकि वे दोनों ही इसके कल्याण मार्ग में विघ्न करने वाले महान्\u200C शत्रु हैं";
                }else if(i==34){
                    name="श्रेयान्स्वधर्मो विगुणः परधर्मात्स्वनुष्ठितात्\u200C ।\n" +
                            "स्वधर्मे निधनं श्रेयः परधर्मो भयावहः ॥";
                    desc="भावार्थ : अच्छी प्रकार आचरण में लाए हुए दूसरे के धर्म से गुण रहित भी अपना धर्म अति उत्तम है। अपने धर्म में तो मरना भी कल्याणकारक है और दूसरे का धर्म भय को देने वाला है";
                }else if(i==35){
                    name="अथ केन प्रयुक्तोऽयं पापं चरति पुरुषः ।\n" +
                            "अनिच्छन्नपि वार्ष्णेय बलादिव नियोजितः ॥";
                    desc="भावार्थ : अर्जुन बोले- हे कृष्ण! तो फिर यह मनुष्य स्वयं न चाहता हुआ भी बलात्\u200C लगाए हुए की भाँति किससे प्रेरित होकर पाप का आचरण करता है";
                }else if(i==36){
                    name="काम एष क्रोध एष रजोगुणसमुद्भवः ।\n" +
                            "महाशनो महापाप्मा विद्धयेनमिह वैरिणम्\u200C ॥";
                    desc="भावार्थ : श्री भगवान बोले- रजोगुण से उत्पन्न हुआ यह काम ही क्रोध है। यह बहुत खाने वाला अर्थात भोगों से कभी न अघानेवाला और बड़ा पापी है। इसको ही तू इस विषय में वैरी जान";
                }else if(i==37){
                    name="धूमेनाव्रियते वह्निर्यथादर्शो मलेन च।\n" +
                            "यथोल्बेनावृतो गर्भस्तथा तेनेदमावृतम्\u200C ॥";
                    desc="भावार्थ : जिस प्रकार धुएँ से अग्नि और मैल से दर्पण ढँका जाता है तथा जिस प्रकार जेर से गर्भ ढँका रहता है, वैसे ही उस काम द्वारा यह ज्ञान ढँका रहता है";
                }else if(i==38){
                    name="आवृतं ज्ञानमेतेन ज्ञानिनो नित्यवैरिणा ।\n" +
                            "कामरूपेण कौन्तेय दुष्पूरेणानलेन च ॥";
                    desc="भावार्थ : और हे अर्जुन! इस अग्नि के समान कभी न पूर्ण होने वाले काम रूप ज्ञानियों के नित्य वैरी द्वारा मनुष्य का ज्ञान ढँका हुआ है";
                }else if(i==39){
                    name="इन्द्रियाणि मनो बुद्धिरस्याधिष्ठानमुच्यते ।\n" +
                            "एतैर्विमोहयत्येष ज्ञानमावृत्य देहिनम्\u200C ॥";
                    desc="भावार्थ : इन्द्रियाँ, मन और बुद्धि- ये सब इसके वासस्थान कहे जाते हैं। यह काम इन मन, बुद्धि और इन्द्रियों द्वारा ही ज्ञान को आच्छादित करके जीवात्मा को मोहित करता है";
                }else if(i==40){
                    name="तस्मात्त्वमिन्द्रियाण्यादौ नियम्य भरतर्षभ ।\n" +
                            "पाप्मानं प्रजहि ह्येनं ज्ञानविज्ञाननाशनम्\u200C ॥";
                    desc="भावार्थ : इसलिए हे अर्जुन! तू पहले इन्द्रियों को वश में करके इस ज्ञान और विज्ञान का नाश करने वाले महान पापी काम को अवश्य ही बलपूर्वक मार डाल";
                }else if(i==41){
                    name="इन्द्रियाणि पराण्याहुरिन्द्रियेभ्यः परं मनः ।\n" +
                            "मनसस्तु परा बुद्धिर्यो बुद्धेः परतस्तु सः ॥";
                    desc="भावार्थ : इन्द्रियों को स्थूल शरीर से पर यानी श्रेष्ठ, बलवान और सूक्ष्म कहते हैं। इन इन्द्रियों से पर मन है, मन से भी पर बुद्धि है और जो बुद्धि से भी अत्यन्त पर है वह आत्मा है";
                }else if(i==42){
                    name="एवं बुद्धेः परं बुद्धवा संस्तभ्यात्मानमात्मना ।\n" +
                            "जहि शत्रुं महाबाहो कामरूपं दुरासदम्\u200C ॥";
                    desc="भावार्थ : इस प्रकार बुद्धि से पर अर्थात सूक्ष्म, बलवान और अत्यन्त श्रेष्ठ आत्मा को जानकर और बुद्धि द्वारा मन को वश में करके हे महाबाहो! तू इस कामरूप दुर्जय शत्रु को मार डाल";
                }

            }else if(n==3){
                if(i==0){
                    name="इमं विवस्वते योगं प्रोक्तवानहमव्ययम्\u200C ।\n" +
                            "विवस्वान्मनवे प्राह मनुरिक्ष्वाकवेऽब्रवीत्\u200C ॥";
                    desc="भावार्थ : श्री भगवान बोले- मैंने इस अविनाशी योग को सूर्य से कहा था, सूर्य ने अपने पुत्र वैवस्वत मनु से कहा और मनु ने अपने पुत्र राजा इक्ष्वाकु से कहा";
                }else if(i==1){
                    name="एवं परम्पराप्राप्तमिमं राजर्षयो विदुः ।\n" +
                            "स कालेनेह महता योगो नष्टः परन्तप ॥";
                    desc="भावार्थ : हे परन्तप अर्जुन! इस प्रकार परम्परा से प्राप्त इस योग को राजर्षियों ने जाना, किन्तु उसके बाद वह योग बहुत काल से इस पृथ्वी लोक में लुप्तप्राय हो गया";
                }else if(i==2){
                    name="स एवायं मया तेऽद्य योगः प्रोक्तः पुरातनः ।\n" +
                            "भक्तोऽसि मे सखा चेति रहस्यं ह्येतदुत्तमम्\u200C ॥";
                    desc="भावार्थ : तू मेरा भक्त और प्रिय सखा है, इसलिए वही यह पुरातन योग आज मैंने तुझको कहा है क्योंकि यह बड़ा ही उत्तम रहस्य है अर्थात गुप्त रखने योग्य विषय है";
                }else if(i==3){
                    name="अपरं भवतो जन्म परं जन्म विवस्वतः ।\n" +
                            "कथमेतद्विजानीयां त्वमादौ प्रोक्तवानिति ॥";
                    desc="भावार्थ : अर्जुन बोले- आपका जन्म तो अर्वाचीन-अभी हाल का है और सूर्य का जन्म बहुत पुराना है अर्थात कल्प के आदि में हो चुका था। तब मैं इस बात को कैसे समूझँ कि आप ही ने कल्प के आदि में सूर्य से यह योग कहा था?";
                }else if(i==4){
                    name="बहूनि मे व्यतीतानि जन्मानि तव चार्जुन ।\n" +
                            "तान्यहं वेद सर्वाणि न त्वं वेत्थ परन्तप ॥";
                    desc="भावार्थ : श्री भगवान बोले- हे परंतप अर्जुन! मेरे और तेरे बहुत से जन्म हो चुके हैं। उन सबको तू नहीं जानता, किन्तु मैं जानता हूँ";
                }else if(i==5){
                    name="अजोऽपि सन्नव्ययात्मा भूतानामीश्वरोऽपि सन्\u200C ।\n" +
                            "प्रकृतिं स्वामधिष्ठाय सम्भवाम्यात्ममायया ॥";
                    desc="भावार्थ : मैं अजन्मा और अविनाशीस्वरूप होते हुए भी तथा समस्त प्राणियों का ईश्वर होते हुए भी अपनी प्रकृति को अधीन करके अपनी योगमाया से प्रकट होता हूँ";
                }else if(i==6){
                    name="यदा यदा हि धर्मस्य ग्लानिर्भवति भारत ।\n" +
                            "अभ्युत्थानमधर्मस्य तदात्मानं सृजाम्यहम्\u200C ॥";
                    desc="भावार्थ : हे भारत! जब-जब धर्म की हानि और अधर्म की वृद्धि होती है, तब-तब ही मैं अपने रूप को रचता हूँ अर्थात साकार रूप से लोगों के सम्मुख प्रकट होता हूँ";
                }else if(i==7){
                    name="परित्राणाय साधूनां विनाशाय च दुष्कृताम्\u200C ।\n" +
                            "धर्मसंस्थापनार्थाय सम्भवामि युगे युगे ॥";
                    desc="भावार्थ : साधु पुरुषों का उद्धार करने के लिए, पाप कर्म करने वालों का विनाश करने के लिए और धर्म की अच्छी तरह से स्थापना करने के लिए मैं युग-युग में प्रकट हुआ करता हूँ";
                }else if(i==8){
                    name="जन्म कर्म च मे दिव्यमेवं यो वेत्ति तत्वतः ।\n" +
                            "त्यक्तवा देहं पुनर्जन्म नैति मामेति सोऽर्जुन ॥";
                    desc="भावार्थ : हे अर्जुन! मेरे जन्म और कर्म दिव्य अर्थात निर्मल और अलौकिक हैं- इस प्रकार जो मनुष्य तत्व से (सर्वशक्तिमान, सच्चिदानन्दन परमात्मा अज, अविनाशी और सर्वभूतों के परम गति तथा परम आश्रय हैं, वे केवल धर्म को स्थापन करने और संसार का उद्धार करने के लिए ही अपनी योगमाया से सगुणरूप होकर प्रकट होते हैं। इसलिए परमेश्वर के समान सुहृद्, प्रेमी और पतितपावन दूसरा कोई नहीं है, ऐसा समझकर जो पुरुष परमेश्वर का अनन्य प्रेम से निरन्तर चिन्तन करता हुआ आसक्तिरहित संसार में बर्तता है, वही उनको तत्व से जानता है।) जान लेता है, वह शरीर को त्याग कर फिर जन्म को प्राप्त नहीं होता, किन्तु मुझे ही प्राप्त होता है";
                }else if(i==9){
                    name="वीतरागभय क्रोधा मन्मया मामुपाश्रिताः ।\n" +
                            "बहवो ज्ञानतपसा पूता मद्भावमागताः ॥";
                    desc="भावार्थ : पहले भी, जिनके राग, भय और क्रोध सर्वथा नष्ट हो गए थे और जो मुझ में अनन्य प्रेमपूर्वक स्थित रहते थे, ऐसे मेरे आश्रित रहने वाले बहुत से भक्त उपर्युक्त ज्ञान रूप तप से पवित्र होकर मेरे स्वरूप को प्राप्त हो चुके हैं";
                }else if(i==10){
                    name="ये यथा माँ प्रपद्यन्ते तांस्तथैव भजाम्यहम्\u200C ।\n" +
                            "मम वर्त्मानुवर्तन्ते मनुष्याः पार्थ सर्वशः ॥";
                    desc="भावार्थ : हे अर्जुन! जो भक्त मुझे जिस प्रकार भजते हैं, मैं भी उनको उसी प्रकार भजता हूँ क्योंकि सभी मनुष्य सब प्रकार से मेरे ही मार्ग का अनुसरण करते हैं";
                }else if(i==11){
                    name="काङ्\u200Dक्षन्तः कर्मणां सिद्धिं यजन्त इह देवताः ।\n" +
                            "क्षिप्रं हि मानुषे लोके सिद्धिर्भवति कर्मजा ॥";
                    desc="भावार्थ : इस मनुष्य लोक में कर्मों के फल को चाहने वाले लोग देवताओं का पूजन किया करते हैं क्योंकि उनको कर्मों से उत्पन्न होने वाली सिद्धि शीघ्र मिल जाती है";
                }else if(i==12){
                    name="चातुर्वर्ण्यं मया सृष्टं गुणकर्मविभागशः ।\n" +
                            "तस्य कर्तारमपि मां विद्धयकर्तारमव्ययम्\u200C ॥";
                    desc="भावार्थ : ब्राह्मण, क्षत्रिय, वैश्य और शूद्र- इन चार वर्णों का समूह, गुण और कर्मों के विभागपूर्वक मेरे द्वारा रचा गया है। इस प्रकार उस सृष्टि-रचनादि कर्म का कर्ता होने पर भी मुझ अविनाशी परमेश्वर को तू वास्तव में अकर्ता ही जान";
                }else if(i==13){
                    name="न मां कर्माणि लिम्पन्ति न मे कर्मफले स्पृहा ।\n" +
                            "इति मां योऽभिजानाति कर्मभिर्न स बध्यते ॥";
                    desc="भावार्थ : कर्मों के फल में मेरी स्पृहा नहीं है, इसलिए मुझे कर्म लिप्त नहीं करते- इस प्रकार जो मुझे तत्व से जान लेता है, वह भी कर्मों से नहीं बँधता";
                }else if(i==14){
                    name="एवं ज्ञात्वा कृतं कर्म पूर्वैरपि मुमुक्षुभिः ।\n" +
                            "कुरु कर्मैव तस्मात्वं पूर्वैः पूर्वतरं कृतम्\u200C ॥";
                    desc="भावार्थ : पूर्वकाल में मुमुक्षुओं ने भी इस प्रकार जानकर ही कर्म किए हैं, इसलिए तू भी पूर्वजों द्वारा सदा से किए जाने वाले कर्मों को ही कर";
                }else if(i==15){
                    name="किं कर्म किमकर्मेति कवयोऽप्यत्र मोहिताः ।\n" +
                            "तत्ते कर्म प्रवक्ष्यामि यज्ज्ञात्वा मोक्ष्यसेऽशुभात्\u200C॥";
                    desc="भावार्थ : कर्म क्या है? और अकर्म क्या है? इस प्रकार इसका निर्णय करने में बुद्धिमान पुरुष भी मोहित हो जाते हैं। इसलिए वह कर्मतत्व मैं तुझे भलीभाँति समझाकर कहूँगा, जिसे जानकर तू अशुभ से अर्थात कर्मबंधन से मुक्त हो जाएगा";
                }else if(i==16){
                    name="कर्मणो ह्यपि बोद्धव्यं बोद्धव्यं च विकर्मणः ।\n" +
                            "अकर्मणश्च बोद्धव्यं गहना कर्मणो गतिः ॥";
                    desc="भावार्थ : कर्म का स्वरूप भी जानना चाहिए और अकर्मण का स्वरूप भी जानना चाहिए तथा विकर्म का स्वरूप भी जानना चाहिए क्योंकि कर्म की गति गहन है";
                }else if(i==17){
                    name="कर्मण्य कर्म यः पश्येदकर्मणि च कर्म यः ।\n" +
                            "स बुद्धिमान्मनुष्येषु स युक्तः कृत्स्नकर्मकृत्\u200C ॥";
                    desc="भावार्थ : जो मनुष्य कर्म में अकर्म देखता है और जो अकर्म में कर्म देखता है, वह मनुष्यों में बुद्धिमान है और वह योगी समस्त कर्मों को करने वाला है";
                }else if(i==18){
                    name="यस्य सर्वे समारम्भाः कामसंकल्पवर्जिताः ।\n" +
                            "ज्ञानाग्निदग्धकर्माणं तमाहुः पंडितं बुधाः ॥";
                    desc="भावार्थ : जिसके सम्पूर्ण शास्त्रसम्मत कर्म बिना कामना और संकल्प के होते हैं तथा जिसके समस्त कर्म ज्ञानरूप अग्नि द्वारा भस्म हो गए हैं, उस महापुरुष को ज्ञानीजन भी पंडित कहते हैं";
                }else if(i==19){
                    name="त्यक्त्वा कर्मफलासङ्गं नित्यतृप्तो निराश्रयः ।\n" +
                            "कर्मण्यभिप्रवृत्तोऽपि नैव किंचित्करोति सः ॥";
                    desc="भावार्थ : जो पुरुष समस्त कर्मों में और उनके फल में आसक्ति का सर्वथा त्याग करके संसार के आश्रय से रहित हो गया है और परमात्मा में नित्य तृप्त है, वह कर्मों में भलीभाँति बर्तता हुआ भी वास्तव में कुछ भी नहीं करता";
                }else if(i==20){
                    name="निराशीर्यतचित्तात्मा त्यक्तसर्वपरिग्रहः ।\n" +
                            "शारीरं केवलं कर्म कुर्वन्नाप्नोति किल्बिषम्\u200C ॥";
                    desc="भावार्थ : जिसका अंतःकरण और इन्द्रियों सहित शरीर जीता हुआ है और जिसने समस्त भोगों की सामग्री का परित्याग कर दिया है, ऐसा आशारहित पुरुष केवल शरीर-संबंधी कर्म करता हुआ भी पापों को नहीं प्राप्त होता";
                }else if(i==21){
                    name="यदृच्छालाभसंतुष्टो द्वंद्वातीतो विमत्सरः ।\n" +
                            "समः सिद्धावसिद्धौ च कृत्वापि न निबध्यते ॥";
                    desc="भावार्थ : जो बिना इच्छा के अपने-आप प्राप्त हुए पदार्थ में सदा संतुष्ट रहता है, जिसमें ईर्ष्या का सर्वथा अभाव हो गया हो, जो हर्ष-शोक आदि द्वंद्वों से सर्वथा अतीत हो गया है- ऐसा सिद्धि और असिद्धि में सम रहने वाला कर्मयोगी कर्म करता हुआ भी उनसे नहीं बँधता";
                }else if(i==22){
                    name="गतसङ्\u200Dगस्य मुक्तस्य ज्ञानावस्थितचेतसः ।\n" +
                            "यज्ञायाचरतः कर्म समग्रं प्रविलीयते ॥";
                    desc="भावार्थ : जिसकी आसक्ति सर्वथा नष्ट हो गई है, जो देहाभिमान और ममता से रहित हो गया है, जिसका चित्त निरन्तर परमात्मा के ज्ञान में स्थित रहता है- ऐसा केवल यज्ञसम्पादन के लिए कर्म करने वाले मनुष्य के सम्पूर्ण कर्म भलीभाँति विलीन हो जाते हैं";
                }else if(i==23){
                    name="ब्रह्मार्पणं ब्रह्म हविर्ब्रह्माग्रौ ब्रह्मणा हुतम्\u200C ।\n" +
                            "ब्रह्मैव तेन गन्तव्यं ब्रह्मकर्मसमाधिना ॥\n";
                    desc="भावार्थ : जिस यज्ञ में अर्पण अर्थात स्रुवा आदि भी ब्रह्म है और हवन किए जाने योग्य द्रव्य भी ब्रह्म है तथा ब्रह्मरूप कर्ता द्वारा ब्रह्मरूप अग्नि में आहुति देना रूप क्रिया भी ब्रह्म है- उस ब्रह्मकर्म में स्थित रहने वाले योगी द्वारा प्राप्त किए जाने योग्य फल भी ब्रह्म ही हैं";
                }else if(i==24){
                    name="दैवमेवापरे यज्ञं योगिनः पर्युपासते ।\n" +
                            "ब्रह्माग्नावपरे यज्ञं यज्ञेनैवोपजुह्वति ॥";
                    desc="भावार्थ : दूसरे योगीजन देवताओं के पूजनरूप यज्ञ का ही भलीभाँति अनुष्ठान किया करते हैं और अन्य योगीजन परब्रह्म परमात्मारूप अग्नि में अभेद दर्शनरूप यज्ञ द्वारा ही आत्मरूप यज्ञ का हवन किया करते हैं। (परब्रह्म परमात्मा में ज्ञान द्वारा एकीभाव से स्थित होना ही ब्रह्मरूप अग्नि में यज्ञ द्वारा यज्ञ को हवन करना है।)";
                }else if(i==25){
                    name="श्रोत्रादीनीन्द्रियाण्यन्ये संयमाग्निषु जुह्वति।\n" +
                            "शब्दादीन्विषयानन्य इन्द्रियाग्निषु जुह्वति ॥";
                    desc="भावार्थ : अन्य योगीजन श्रोत्र आदि समस्त इन्द्रियों को संयम रूप अग्नियों में हवन किया करते हैं और दूसरे योगी लोग शब्दादि समस्त विषयों को इन्द्रिय रूप अग्नियों में हवन किया करते हैं";
                }else if(i==26){
                    name="सर्वाणीन्द्रियकर्माणि प्राणकर्माणि चापरे ।\n" +
                            "आत्मसंयमयोगाग्नौ जुह्वति ज्ञानदीपिते ॥";
                    desc="भावार्थ : दूसरे योगीजन इन्द्रियों की सम्पूर्ण क्रियाओं और प्राणों की समस्त क्रियाओं को ज्ञान से प्रकाशित आत्म संयम योगरूप अग्नि में हवन किया करते हैं (सच्चिदानंदघन परमात्मा के सिवाय अन्य किसी का भी न चिन्तन करना ही उन सबका हवन करना है।)";
                }else if(i==27){
                    name="द्रव्ययज्ञास्तपोयज्ञा योगयज्ञास्तथापरे ।\n" +
                            "स्वाध्यायज्ञानयज्ञाश्च यतयः संशितव्रताः ॥";
                    desc="भावार्थ : कई पुरुष द्रव्य संबंधी यज्ञ करने वाले हैं, कितने ही तपस्या रूप यज्ञ करने वाले हैं तथा दूसरे कितने ही योगरूप यज्ञ करने वाले हैं, कितने ही अहिंसादि तीक्ष्णव्रतों से युक्त यत्नशील पुरुष स्वाध्यायरूप ज्ञानयज्ञ करने वाले हैं";
                }else if(i==28){
                    name="अपाने जुह्वति प्राणं प्राणेऽपानं तथापरे ।\n" +
                            "प्राणापानगती रुद्ध्वा प्राणायामपरायणाः ॥";
                    desc="";
                }else if(i==29){
                    name="अपरे नियताहाराः प्राणान्प्राणेषु जुह्वति ।\n" +
                            "सर्वेऽप्येते यज्ञविदो यज्ञक्षपितकल्मषाः ॥";
                    desc="भावार्थ : दूसरे कितने ही योगीजन अपान वायु में प्राणवायु को हवन करते हैं, वैसे ही अन्य योगीजन प्राणवायु में अपान वायु को हवन करते हैं तथा अन्य कितने ही नियमित आहार (गीता अध्याय 6 श्लोक 17 में देखना चाहिए।) करने वाले प्राणायाम परायण पुरुष प्राण और अपान की गति को रोककर प्राणों को प्राणों में ही हवन किया करते हैं। ये सभी साधक यज्ञों द्वारा पापों का नाश कर देने वाले और यज्ञों को जानने वाले हैं";
                }else if(i==30){
                    name="यज्ञशिष्टामृतभुजो यान्ति ब्रह्म सनातनम्\u200C ।\n" +
                            "नायं लोकोऽस्त्ययज्ञस्य कुतोऽन्यः कुरुसत्तम ॥";
                    desc="भावार्थ : हे कुरुश्रेष्ठ अर्जुन! यज्ञ से बचे हुए अमृत का अनुभव करने वाले योगीजन सनातन परब्रह्म परमात्मा को प्राप्त होते हैं। और यज्ञ न करने वाले पुरुष के लिए तो यह मनुष्यलोक भी सुखदायक नहीं है, फिर परलोक कैसे सुखदायक हो सकता है?";
                }else if(i==31){
                    name="एवं बहुविधा यज्ञा वितता ब्रह्मणो मुखे ।\n" +
                            "कर्मजान्विद्धि तान्सर्वानेवं ज्ञात्वा विमोक्ष्यसे ॥";
                    desc="भावार्थ : इसी प्रकार और भी बहुत तरह के यज्ञ वेद की वाणी में विस्तार से कहे गए हैं। उन सबको तू मन, इन्द्रिय और शरीर की क्रिया द्वारा सम्पन्न होने वाले जान, इस प्रकार तत्व से जानकर उनके अनुष्ठान द्वारा तू कर्म बंधन से सर्वथा मुक्त हो जाएगा";
                }else if(i==32){
                    name="श्रेयान्द्रव्यमयाद्यज्ञाज्ज्ञानयज्ञः परन्तप ।\n" +
                            "सर्वं कर्माखिलं पार्थ ज्ञाने परिसमाप्यते ॥";
                    desc="भावार्थ : हे परंतप अर्जुन! द्रव्यमय यज्ञ की अपेक्षा ज्ञान यज्ञ अत्यन्त श्रेष्ठ है तथा यावन्मात्र सम्पूर्ण कर्म ज्ञान में समाप्त हो जाते हैं";
                }else if(i==33){
                    name="तद्विद्धि प्रणिपातेन परिप्रश्नेन सेवया ।\n" +
                            "उपदेक्ष्यन्ति ते ज्ञानं ज्ञानिनस्तत्वदर्शिनः ॥";
                    desc="भावार्थ : उस ज्ञान को तू तत्वदर्शी ज्ञानियों के पास जाकर समझ, उनको भलीभाँति दण्डवत्\u200C प्रणाम करने से, उनकी सेवा करने से और कपट छोड़कर सरलतापूर्वक प्रश्न करने से वे परमात्म तत्व को भलीभाँति जानने वाले ज्ञानी महात्मा तुझे उस तत्वज्ञान का उपदेश करेंगे";
                }else if(i==34){
                    name="यज्ज्ञात्वा न पुनर्मोहमेवं यास्यसि पाण्डव ।\n" +
                            "येन भुतान्यशेषेण द्रक्ष्यस्यात्मन्यथो मयि ॥";
                    desc="भावार्थ : जिसको जानकर फिर तू इस प्रकार मोह को नहीं प्राप्त होगा तथा हे अर्जुन! जिस ज्ञान द्वारा तू सम्पूर्ण भूतों को निःशेषभाव से पहले अपने में (गीता अध्याय 6 श्लोक 29 में देखना चाहिए।) और पीछे मुझ सच्चिदानन्दघन परमात्मा में देखेगा। (गीता अध्याय 6 श्लोक 30 में देखना चाहिए।)";
                }else if(i==35){
                    name="अपि चेदसि पापेभ्यः सर्वेभ्यः पापकृत्तमः ।\n" +
                            "सर्वं ज्ञानप्लवेनैव वृजिनं सन्तरिष्यसि ॥";
                    desc="भावार्थ : यदि तू अन्य सब पापियों से भी अधिक पाप करने वाला है, तो भी तू ज्ञान रूप नौका द्वारा निःसंदेह सम्पूर्ण पाप-समुद्र से भलीभाँति तर जाएगा";
                }else if(i==36){
                    name="यथैधांसि समिद्धोऽग्निर्भस्मसात्कुरुतेऽर्जुन ।\n" +
                            "ज्ञानाग्निः सर्वकर्माणि भस्मसात्कुरुते तथा ॥";
                    desc="भावार्थ : क्योंकि हे अर्जुन! जैसे प्रज्वलित अग्नि ईंधनों को भस्ममय कर देता है, वैसे ही ज्ञानरूप अग्नि सम्पूर्ण कर्मों को भस्ममय कर देता है";
                }else if(i==37){
                    name="न हि ज्ञानेन सदृशं पवित्रमिह विद्यते ।\n" +
                            "तत्स्वयं योगसंसिद्धः कालेनात्मनि विन्दति ॥";
                    desc="भावार्थ : इस संसार में ज्ञान के समान पवित्र करने वाला निःसंदेह कुछ भी नहीं है। उस ज्ञान को कितने ही काल से कर्मयोग द्वारा शुद्धान्तःकरण हुआ मनुष्य अपने-आप ही आत्मा में पा लेता है";
                }else if(i==38){
                    name="श्रद्धावाँल्लभते ज्ञानं तत्परः संयतेन्द्रियः ।\n" +
                            "ज्ञानं लब्धवा परां शान्तिमचिरेणाधिगच्छति ॥";
                    desc="भावार्थ : जितेन्द्रिय, साधनपरायण और श्रद्धावान मनुष्य ज्ञान को प्राप्त होता है तथा ज्ञान को प्राप्त होकर वह बिना विलम्ब के- तत्काल ही भगवत्प्राप्तिरूप परम शान्ति को प्राप्त हो जाता है";
                }else if(i==39){
                    name="अज्ञश्चश्रद्दधानश्च संशयात्मा विनश्यति ।\n" +
                            "नायं लोकोऽस्ति न परो न सुखं संशयात्मनः ॥";
                    desc="भावार्थ : विवेकहीन और श्रद्धारहित संशययुक्त मनुष्य परमार्थ से अवश्य भ्रष्ट हो जाता है। ऐसे संशययुक्त मनुष्य के लिए न यह लोक है, न परलोक है और न सुख ही है";
                }else if(i==40){
                    name="योगसन्नयस्तकर्माणं ज्ञानसञ्न्निसंशयम्\u200C ।\n" +
                            "आत्मवन्तं न कर्माणि निबध्नन्ति धनञ्जय ॥";
                    desc="भावार्थ : हे धनंजय! जिसने कर्मयोग की विधि से समस्त कर्मों का परमात्मा में अर्पण कर दिया है और जिसने विवेक द्वारा समस्त संशयों का नाश कर दिया है, ऐसे वश में किए हुए अन्तःकरण वाले पुरुष को कर्म नहीं बाँधते";
                }else if(i==41){
                    name="तस्मादज्ञानसम्भूतं हृत्स्थं ज्ञानासिनात्मनः ।\n" +
                            "छित्वैनं संशयं योगमातिष्ठोत्तिष्ठ भारत ॥";
                    desc="भावार्थ : इसलिए हे भरतवंशी अर्जुन! तू हृदय में स्थित इस अज्ञानजनित अपने संशय का विवेकज्ञान रूप तलवार द्वारा छेदन करके समत्वरूप कर्मयोग में स्थित हो जा और युद्ध के लिए खड़ा हो जा";
                }
            }else if(n==4){
                if(i==0){
                    name="सन्न्यासं कर्मणां कृष्ण पुनर्योगं च शंससि ।\n" +
                            "यच्छ्रेय एतयोरेकं तन्मे ब्रूहि सुनिश्चितम्\u200C ॥";
                    desc="भावार्थ : अर्जुन बोले- हे कृष्ण! आप कर्मों के संन्यास की और फिर कर्मयोग की प्रशंसा करते हैं। इसलिए इन दोनों में से जो एक मेरे लिए भलीभाँति निश्चित कल्याणकारक साधन हो, उसको कहिए";
                }else if(i==1){
                    name="सन्न्यासः कर्मयोगश्च निःश्रेयसकरावुभौ ।\n" +
                            "तयोस्तु कर्मसन्न्यासात्कर्मयोगो विशिष्यते ॥";
                    desc="भावार्थ : श्री भगवान बोले- कर्म संन्यास और कर्मयोग- ये दोनों ही परम कल्याण के करने वाले हैं, परन्तु उन दोनों में भी कर्म संन्यास से कर्मयोग साधन में सुगम होने से श्रेष्ठ है";
                }else if(i==2){
                    name="ज्ञेयः स नित्यसन्न्यासी यो न द्वेष्टि न काङ्\u200Dक्षति ।\n" +
                            "निर्द्वन्द्वो हि महाबाहो सुखं बन्धात्प्रमुच्यते ॥";
                    desc="भावार्थ : हे अर्जुन! जो पुरुष न किसी से द्वेष करता है और न किसी की आकांक्षा करता है, वह कर्मयोगी सदा संन्यासी ही समझने योग्य है क्योंकि राग-द्वेषादि द्वंद्वों से रहित पुरुष सुखपूर्वक संसार बंधन से मुक्त हो जाता है";
                }else if(i==3){
                    name="साङ्\u200Dख्ययोगौ पृथग्बालाः प्रवदन्ति न पण्डिताः ।\n" +
                            "एकमप्यास्थितः सम्यगुभयोर्विन्दते फलम्\u200C ॥";
                    desc="भावार्थ : उपर्युक्त संन्यास और कर्मयोग को मूर्ख लोग पृथक्\u200C-पृथक् फल देने वाले कहते हैं न कि पण्डितजन, क्योंकि दोनों में से एक में भी सम्यक्\u200C प्रकार से स्थित पुरुष दोनों के फलरूप परमात्मा को प्राप्त होता है";
                }else if(i==4){
                    name="यत्साङ्\u200Dख्यैः प्राप्यते स्थानं तद्यौगैरपि गम्यते ।\n" +
                            "एकं साङ्\u200Dख्यं च योगं च यः पश्यति स पश्यति ॥";
                    desc="भावार्थ : ज्ञान योगियों द्वारा जो परमधाम प्राप्त किया जाता है, कर्मयोगियों द्वारा भी वही प्राप्त किया जाता है। इसलिए जो पुरुष ज्ञानयोग और कर्मयोग को फलरूप में एक देखता है, वही यथार्थ देखता है";
                }else if(i==5){
                    name="सन्न्यासस्तु महाबाहो दुःखमाप्तुमयोगतः ।\n" +
                            "योगयुक्तो मुनिर्ब्रह्म नचिरेणाधिगच्छति ॥";
                    desc="भावार्थ : परन्तु हे अर्जुन! कर्मयोग के बिना संन्यास अर्थात्\u200C मन, इन्द्रिय और शरीर द्वारा होने वाले सम्पूर्ण कर्मों में कर्तापन का त्याग प्राप्त होना कठिन है और भगवत्स्वरूप को मनन करने वाला कर्मयोगी परब्रह्म परमात्मा को शीघ्र ही प्राप्त हो जाता है";
                }else if(i==6){
                    name="योगयुक्तो विशुद्धात्मा विजितात्मा जितेन्द्रियः ।\n" +
                            "सर्वभूतात्मभूतात्मा कुर्वन्नपि न लिप्यते ॥";
                    desc="भावार्थ : जिसका मन अपने वश में है, जो जितेन्द्रिय एवं विशुद्ध अन्तःकरण वाला है और सम्पूर्ण प्राणियों का आत्मरूप परमात्मा ही जिसका आत्मा है, ऐसा कर्मयोगी कर्म करता हुआ भी लिप्त नहीं होता";
                }else if(i==7){
                    name="नैव किंचित्करोमीति युक्तो मन्येत तत्ववित्\u200C ।\n" +
                            "पश्यञ्श्रृण्वन्स्पृशञ्जिघ्रन्नश्नन्गच्छन्स्वपंश्वसन्\u200C ॥";
                    desc="";
                }else if(i==8){
                    name="प्रलपन्विसृजन्गृह्णन्नुन्मिषन्निमिषन्नपि ॥\n" +
                            "इन्द्रियाणीन्द्रियार्थेषु वर्तन्त इति धारयन्\u200C ॥";
                    desc="भावार्थ : तत्व को जानने वाला सांख्ययोगी तो देखता हुआ, सुनता हुआ, स्पर्श करता हुआ, सूँघता हुआ, भोजन करता हुआ, गमन करता हुआ, सोता हुआ, श्वास लेता हुआ, बोलता हुआ, त्यागता हुआ, ग्रहण करता हुआ तथा आँखों को खोलता और मूँदता हुआ भी, सब इन्द्रियाँ अपने-अपने अर्थों में बरत रही हैं- इस प्रकार समझकर निःसंदेह ऐसा मानें कि मैं कुछ भी नहीं करता हूँ";
                }else if(i==9){
                    name="ब्रह्मण्याधाय कर्माणि सङ्\u200Dगं त्यक्त्वा करोति यः ।\n" +
                            "लिप्यते न स पापेन पद्मपत्रमिवाम्भसा ॥";
                    desc="भावार्थ : जो पुरुष सब कर्मों को परमात्मा में अर्पण करके और आसक्ति को त्याग कर कर्म करता है, वह पुरुष जल से कमल के पत्ते की भाँति पाप से लिप्त नहीं होता";
                }else if(i==10){
                    name="भावार्थ : जो पुरुष सब कर्मों को परमात्मा में अर्पण करके और आसक्ति को त्याग कर कर्म करता है, वह पुरुष जल से कमल के पत्ते की भाँति पाप से लिप्त नहीं होता";
                    desc="भावार्थ : कर्मयोगी ममत्वबुद्धिरहित केवल इन्द्रिय, मन, बुद्धि और शरीर द्वारा भी आसक्ति को त्याग कर अन्तःकरण की शुद्धि के लिए कर्म करते हैं";
                }else if(i==11){
                    name="युक्तः कर्मफलं त्यक्त्वा शान्तिमाप्नोति नैष्ठिकीम्\u200C ।\n" +
                            "अयुक्तः कामकारेण फले सक्तो निबध्यते ॥";
                    desc="भावार्थ : कर्मयोगी कर्मों के फल का त्याग करके भगवत्प्राप्ति रूप शान्ति को प्राप्त होता है और सकामपुरुष कामना की प्रेरणा से फल में आसक्त होकर बँधता है";
                }else if(i==12){
                    name="सर्वकर्माणि मनसा संन्यस्यास्ते सुखं वशी ।\n" +
                            "नवद्वारे पुरे देही नैव कुर्वन्न कारयन्\u200C ॥";
                    desc="भावार्थ : अन्तःकरण जिसके वश में है, ऐसा सांख्य योग का आचरण करने वाला पुरुष न करता हुआ और न करवाता हुआ ही नवद्वारों वाले शरीर रूप घर में सब कर्मों को मन से त्यागकर आनंदपूर्वक सच्चिदानंदघन परमात्मा के स्वरूप में स्थित रहता है";
                }else if(i==13){
                    name="न कर्तृत्वं न कर्माणि लोकस्य सृजति प्रभुः ।\n" +
                            "न कर्मफलसंयोगं स्वभावस्तु प्रवर्तते ।";
                    desc="भावार्थ : परमेश्वर मनुष्यों के न तो कर्तापन की, न कर्मों की और न कर्मफल के संयोग की रचना करते हैं, किन्तु स्वभाव ही बर्त रहा है";
                }else if(i==14){
                    name="नादत्ते कस्यचित्पापं न चैव सुकृतं विभुः ।\n" +
                            "अज्ञानेनावृतं ज्ञानं तेन मुह्यन्ति जन्तवः ॥";
                    desc="भावार्थ : सर्वव्यापी परमेश्वर भी न किसी के पाप कर्म को और न किसी के शुभकर्म को ही ग्रहण करता है, किन्तु अज्ञान द्वारा ज्ञान ढँका हुआ है, उसी से सब अज्ञानी मनुष्य मोहित हो रहे हैं";
                }else if(i==15){
                    name="ज्ञानेन तु तदज्ञानं येषां नाशितमात्मनः ।\n" +
                            "तेषामादित्यवज्ज्ञानं प्रकाशयति तत्परम्\u200C ॥";
                    desc="भावार्थ : परन्तु जिनका वह अज्ञान परमात्मा के तत्व ज्ञान द्वारा नष्ट कर दिया गया है, उनका वह ज्ञान सूर्य के सदृश उस सच्चिदानन्दघन परमात्मा को प्रकाशित कर देता है";
                }else if(i==16){
                    name="तद्बुद्धयस्तदात्मानस्तन्निष्ठास्तत्परायणाः ।\n" +
                            "गच्छन्त्यपुनरावृत्तिं ज्ञाननिर्धूतकल्मषाः ॥";
                    desc="भावार्थ : जिनका मन तद्रूप हो रहा है, जिनकी बुद्धि तद्रूप हो रही है और सच्चिदानन्दघन परमात्मा में ही जिनकी निरंतर एकीभाव से स्थिति है, ऐसे तत्परायण पुरुष ज्ञान द्वारा पापरहित होकर अपुनरावृत्ति को अर्थात परमगति को प्राप्त होते हैं";
                }else if(i==17){
                    name="विद्याविनयसम्पन्ने ब्राह्मणे गवि हस्तिनि ।\n" +
                            "शुनि चैव श्वपाके च पण्डिताः समदर्शिनः ॥";
                    desc="भावार्थ : वे ज्ञानीजन विद्या और विनययुक्त ब्राह्मण में तथा गौ, हाथी, कुत्ते और चाण्डाल में भी समदर्शी (इसका विस्तार गीता अध्याय 6 श्लोक 32 की टिप्पणी में देखना चाहिए।) ही होते हैं";
                }else if(i==18){
                    name="इहैव तैर्जितः सर्गो येषां साम्ये स्थितं मनः ।\n" +
                            "निर्दोषं हि समं ब्रह्म तस्माद् ब्रह्मणि ते स्थिताः ॥";
                    desc="भावार्थ : जिनका मन समभाव में स्थित है, उनके द्वारा इस जीवित अवस्था में ही सम्पूर्ण संसार जीत लिया गया है क्योंकि सच्चिदानन्दघन परमात्मा निर्दोष और सम है, इससे वे सच्चिदानन्दघन परमात्मा में ही स्थित हैं";
                }else if(i==19){
                    name="न प्रहृष्येत्प्रियं प्राप्य नोद्विजेत्प्राप्य चाप्रियम्\u200C ।\n" +
                            "स्थिरबुद्धिरसम्मूढो ब्रह्मविद् ब्रह्मणि स्थितः ॥";
                    desc="भावार्थ : जो पुरुष प्रिय को प्राप्त होकर हर्षित नहीं हो और अप्रिय को प्राप्त होकर उद्विग्न न हो, वह स्थिरबुद्धि, संशयरहित, ब्रह्मवेत्ता पुरुष सच्चिदानन्दघन परब्रह्म परमात्मा में एकीभाव से नित्य स्थित है";
                }else if(i==20){
                    name="बाह्यस्पर्शेष्वसक्तात्मा विन्दत्यात्मनि यत्सुखम्\u200C ।\n" +
                            "स ब्रह्मयोगयुक्तात्मा सुखमक्षयमश्नुते ॥";
                    desc="भावार्थ : बाहर के विषयों में आसक्तिरहित अन्तःकरण वाला साधक आत्मा में स्थित जो ध्यानजनित सात्विक आनंद है, उसको प्राप्त होता है, तदनन्तर वह सच्चिदानन्दघन परब्रह्म परमात्मा के ध्यानरूप योग में अभिन्न भाव से स्थित पुरुष अक्षय आनन्द का अनुभव करता है";
                }else if(i==21){
                    name="ये हि संस्पर्शजा भोगा दुःखयोनय एव ते ।\n" +
                            "आद्यन्तवन्तः कौन्तेय न तेषु रमते बुधः ॥";
                    desc="भावार्थ : जो ये इन्द्रिय तथा विषयों के संयोग से उत्पन्न होने वाले सब भोग हैं, यद्यपि विषयी पुरुषों को सुखरूप भासते हैं, तो भी दुःख के ही हेतु हैं और आदि-अन्तवाले अर्थात अनित्य हैं। इसलिए हे अर्जुन! बुद्धिमान विवेकी पुरुष उनमें नहीं रमता";
                }else if(i==22){
                    name="शक्नोतीहैव यः सोढुं प्राक्शरीरविमोक्षणात्\u200C ।\n" +
                            "कामक्रोधोद्भवं वेगं स युक्तः स सुखी नरः ॥";
                    desc="भावार्थ : जो साधक इस मनुष्य शरीर में, शरीर का नाश होने से पहले-पहले ही काम-क्रोध से उत्पन्न होने वाले वेग को सहन करने में समर्थ हो जाता है, वही पुरुष योगी है और वही सुखी है";
                }else if(i==23){
                    name="योऽन्तःसुखोऽन्तरारामस्तथान्तर्ज्योतिरेव यः ।\n" +
                            "स योगी ब्रह्मनिर्वाणं ब्रह्मभूतोऽधिगच्छति ॥";
                    desc="भावार्थ : जो पुरुष अन्तरात्मा में ही सुखवाला है, आत्मा में ही रमण करने वाला है तथा जो आत्मा में ही ज्ञान वाला है, वह सच्चिदानन्दघन परब्रह्म परमात्मा के साथ एकीभाव को प्राप्त सांख्य योगी शांत ब्रह्म को प्राप्त होता है";
                }else if(i==24){
                    name="लभन्ते ब्रह्मनिर्वाणमृषयः क्षीणकल्मषाः ।\n" +
                            "छिन्नद्वैधा यतात्मानः सर्वभूतहिते रताः ॥";
                    desc="भावार्थ : जिनके सब पाप नष्ट हो गए हैं, जिनके सब संशय ज्ञान द्वारा निवृत्त हो गए हैं, जो सम्पूर्ण प्राणियों के हित में रत हैं और जिनका जीता हुआ मन निश्चलभाव से परमात्मा में स्थित है, वे ब्रह्मवेत्ता पुरुष शांत ब्रह्म को प्राप्त होते हैं";
                }else if(i==25){
                    name="कामक्रोधवियुक्तानां यतीनां यतचेतसाम्\u200C ।\n" +
                            "अभितो ब्रह्मनिर्वाणं वर्तते विदितात्मनाम्\u200C ॥";
                    desc="भावार्थ : काम-क्रोध से रहित, जीते हुए चित्तवाले, परब्रह्म परमात्मा का साक्षात्कार किए हुए ज्ञानी पुरुषों के लिए सब ओर से शांत परब्रह्म परमात्मा ही परिपूर्ण है";
                }else if(i==26){
                    name="स्पर्शान्कृत्वा बहिर्बाह्यांश्चक्षुश्चैवान्तरे भ्रुवोः ।\n" +
                            "प्राणापानौ समौ कृत्वा नासाभ्यन्तरचारिणौ ॥";
                    desc="";
                }else if(i==27){
                    name="यतेन्द्रियमनोबुद्धिर्मुनिर्मोक्षपरायणः ।\n" +
                            "विगतेच्छाभयक्रोधो यः सदा मुक्त एव सः ॥";
                    desc="भावार्थ : बाहर के विषय-भोगों को न चिन्तन करता हुआ बाहर ही निकालकर और नेत्रों की दृष्टि को भृकुटी के बीच में स्थित करके तथा नासिका में विचरने वाले प्राण और अपानवायु को सम करके, जिसकी इन्द्रियाँ मन और बुद्धि जीती हुई हैं, ऐसा जो मोक्षपरायण मुनि (परमेश्वर के स्वरूप का निरन्तर मनन करने वाला।) इच्छा, भय और क्रोध से रहित हो गया है, वह सदा मुक्त ही है";
                }else if(i==28){
                    name="भोक्तारं यज्ञतपसां सर्वलोकमहेश्वरम्\u200C ।\n" +
                            "सुहृदं सर्वभूतानां ज्ञात्वा मां शान्तिमृच्छति ॥";
                    desc="भावार्थ : मेरा भक्त मुझको सब यज्ञ और तपों का भोगने वाला, सम्पूर्ण लोकों के ईश्वरों का भी ईश्वर तथा सम्पूर्ण भूत-प्राणियों का सुहृद् अर्थात स्वार्थरहित दयालु और प्रेमी, ऐसा तत्व से जानकर शान्ति को प्राप्त होता है";
                }
            }else if(n==5){
                if(i==0){
                    name="अनाश्रितः कर्मफलं कार्यं कर्म करोति यः ।\n" +
                            "स सन्न्यासी च योगी च न निरग्निर्न चाक्रियः ॥";
                    desc="भावार्थ : श्री भगवान बोले- जो पुरुष कर्मफल का आश्रय न लेकर करने योग्य कर्म करता है, वह संन्यासी तथा योगी है और केवल अग्नि का त्याग करने वाला संन्यासी नहीं है तथा केवल क्रियाओं का त्याग करने वाला योगी नहीं है";
                }else if(i==1){
                    name="यं सन्न्यासमिति प्राहुर्योगं तं विद्धि पाण्डव ।\n" +
                            "न ह्यसन्न्यस्तसङ्\u200Dकल्पो योगी भवति कश्चन ॥";
                    desc="भावार्थ : हे अर्जुन! जिसको संन्यास (गीता अध्याय 3 श्लोक 3 की टिप्पणी में इसका खुलासा अर्थ लिखा है।) ऐसा कहते हैं, उसी को तू योग (गीता अध्याय 3 श्लोक 3 की टिप्पणी में इसका खुलासा अर्थ लिखा है।) जान क्योंकि संकल्पों का त्याग न करने वाला कोई भी पुरुष योगी नहीं होता";
                }else if(i==2){
                    name="आरुरुक्षोर्मुनेर्योगं कर्म कारणमुच्यते ।\n" +
                            "योगारूढस्य तस्यैव शमः कारणमुच्यते ॥";
                    desc="भावार्थ : योग में आरूढ़ होने की इच्छा वाले मननशील पुरुष के लिए योग की प्राप्ति में निष्काम भाव से कर्म करना ही हेतु कहा जाता है और योगारूढ़ हो जाने पर उस योगारूढ़ पुरुष का जो सर्वसंकल्पों का अभाव है, वही कल्याण में हेतु कहा जाता है";
                }else if(i==3){
                    name="यदा हि नेन्द्रियार्थेषु न कर्मस्वनुषज्जते ।\n" +
                            "सर्वसङ्\u200Dकल्पसन्न्यासी योगारूढ़स्तदोच्यते ॥";
                    desc="भावार्थ : जिस काल में न तो इन्द्रियों के भोगों में और न कर्मों में ही आसक्त होता है, उस काल में सर्वसंकल्पों का त्यागी पुरुष योगारूढ़ कहा जाता है";
                }else if(i==4){
                    name="उद्धरेदात्मनाऽत्मानं नात्मानमवसादयेत्\u200C ।\n" +
                            "आत्मैव ह्यात्मनो बन्धुरात्मैव रिपुरात्मनः ॥";
                    desc="भावार्थ : अपने द्वारा अपना संसार-समुद्र से उद्धार करे और अपने को अधोगति में न डाले क्योंकि यह मनुष्य आप ही तो अपना मित्र है और आप ही अपना शत्रु है";
                }else if(i==5){
                    name="बन्धुरात्मात्मनस्तस्य येनात्मैवात्मना जितः ।\n" +
                            "अनात्मनस्तु शत्रुत्वे वर्तेतात्मैव शत्रुवत्\u200C ॥";
                    desc="भावार्थ : जिस जीवात्मा द्वारा मन और इन्द्रियों सहित शरीर जीता हुआ है, उस जीवात्मा का तो वह आप ही मित्र है और जिसके द्वारा मन तथा इन्द्रियों सहित शरीर नहीं जीता गया है, उसके लिए वह आप ही शत्रु के सदृश शत्रुता में बर्तता है";
                }else if(i==6){
                    name="जितात्मनः प्रशान्तस्य परमात्मा समाहितः ।\n" +
                            "शीतोष्णसुखदुःखेषु तथा मानापमानयोः ॥";
                    desc="भावार्थ : सरदी-गरमी और सुख-दुःखादि में तथा मान और अपमान में जिसके अन्तःकरण की वृत्तियाँ भलीभाँति शांत हैं, ऐसे स्वाधीन आत्मावाले पुरुष के ज्ञान में सच्चिदानन्दघन परमात्मा सम्यक्\u200C प्रकार से स्थित है अर्थात उसके ज्ञान में परमात्मा के सिवा अन्य कुछ है ही नहीं";
                }else if(i==7){
                    name="ज्ञानविज्ञानतृप्तात्मा कूटस्थो विजितेन्द्रियः ।\n" +
                            "युक्त इत्युच्यते योगी समलोष्टाश्मकांचनः ॥";
                    desc="भावार्थ : जिसका अन्तःकरण ज्ञान-विज्ञान से तृप्त है, जिसकी स्थिति विकाररहित है, जिसकी इन्द्रियाँ भलीभाँति जीती हुई हैं और जिसके लिए मिट्टी, पत्थर और सुवर्ण समान हैं, वह योगी युक्त अर्थात भगवत्प्राप्त है, ऐसे कहा जाता है";
                }else if(i==8){
                    name="सुहृन्मित्रार्युदासीनमध्यस्थद्वेष्यबन्धुषु ।\n" +
                            "साधुष्वपि च पापेषु समबुद्धिर्विशिष्यते ॥";
                    desc="भावार्थ : सुहृद् (स्वार्थ रहित सबका हित करने वाला), मित्र, वैरी, उदासीन (पक्षपातरहित), मध्यस्थ (दोनों ओर की भलाई चाहने वाला), द्वेष्य और बन्धुगणों में, धर्मात्माओं में और पापियों में भी समान भाव रखने वाला अत्यन्त श्रेष्ठ है";
                }else if(i==9){
                    name="योगी युञ्जीत सततमात्मानं रहसि स्थितः ।\n" +
                            "एकाकी यतचित्तात्मा निराशीरपरिग्रहः ॥";
                    desc="भावार्थ : मन और इन्द्रियों सहित शरीर को वश में रखने वाला, आशारहित और संग्रहरहित योगी अकेला ही एकांत स्थान में स्थित होकर आत्मा को निरंतर परमात्मा में लगाए";
                }else if(i==10){
                    name="शुचौ देशे प्रतिष्ठाप्य स्थिरमासनमात्मनः ।\n" +
                            "नात्युच्छ्रितं नातिनीचं चैलाजिनकुशोत्तरम्\u200C ॥";
                    desc="भावार्थ : शुद्ध भूमि में, जिसके ऊपर क्रमशः कुशा, मृगछाला और वस्त्र बिछे हैं, जो न बहुत ऊँचा है और न बहुत नीचा, ऐसे अपने आसन को स्थिर स्थापन करके";
                }else if(i==11){
                    name="तत्रैकाग्रं मनः कृत्वा यतचित्तेन्द्रियक्रियः ।\n" +
                            "उपविश्यासने युञ्ज्याद्योगमात्मविशुद्धये ॥";
                    desc="भावार्थ : उस आसन पर बैठकर चित्त और इन्द्रियों की क्रियाओं को वश में रखते हुए मन को एकाग्र करके अन्तःकरण की शुद्धि के लिए योग का अभ्यास करे";
                }else if(i==12){
                    name="समं कायशिरोग्रीवं धारयन्नचलं स्थिरः ।\n" +
                            "सम्प्रेक्ष्य नासिकाग्रं स्वं दिशश्चानवलोकयन्\u200C ॥";
                    desc="भावार्थ : काया, सिर और गले को समान एवं अचल धारण करके और स्थिर होकर, अपनी नासिका के अग्रभाग पर दृष्टि जमाकर, अन्य दिशाओं को न देखता हुआ";
                }else if(i==13){
                    name="प्रशान्तात्मा विगतभीर्ब्रह्मचारिव्रते स्थितः ।\n" +
                            "मनः संयम्य मच्चित्तो युक्त आसीत मत्परः ॥";
                    desc="भावार्थ : ब्रह्मचारी के व्रत में स्थित, भयरहित तथा भलीभाँति शांत अन्तःकरण वाला सावधान योगी मन को रोककर मुझमें चित्तवाला और मेरे परायण होकर स्थित होए";
                }else if(i==14){
                    name="युञ्जन्नेवं सदात्मानं योगी नियतमानसः ।\n" +
                            "शान्तिं निर्वाणपरमां मत्संस्थामधिगच्छति ॥";
                    desc="भावार्थ : वश में किए हुए मनवाला योगी इस प्रकार आत्मा को निरंतर मुझ परमेश्वर के स्वरूप में लगाता हुआ मुझमें रहने वाली परमानन्द की पराकाष्ठारूप शान्ति को प्राप्त होता है";
                }else if(i==15){
                    name="नात्यश्नतस्तु योगोऽस्ति न चैकान्तमनश्नतः ।\n" +
                            "न चाति स्वप्नशीलस्य जाग्रतो नैव चार्जुन ॥";
                    desc="भावार्थ : हे अर्जुन! यह योग न तो बहुत खाने वाले का, न बिलकुल न खाने वाले का, न बहुत शयन करने के स्वभाव वाले का और न सदा जागने वाले का ही सिद्ध होता है";
                }else if(i==16){
                    name="युक्ताहारविहारस्य युक्तचेष्टस्य कर्मसु ।\n" +
                            "युक्तस्वप्नावबोधस्य योगो भवति दुःखहा ॥";
                    desc="भावार्थ : दुःखों का नाश करने वाला योग तो यथायोग्य आहार-विहार करने वाले का, कर्मों में यथायोग्य चेष्टा करने वाले का और यथायोग्य सोने तथा जागने वाले का ही सिद्ध होता है";
                }else if(i==17){
                    name="यदा विनियतं चित्तमात्मन्येवावतिष्ठते ।\n" +
                            "निःस्पृहः सर्वकामेभ्यो युक्त इत्युच्यते तदा ॥";
                    desc="भावार्थ : अत्यन्त वश में किया हुआ चित्त जिस काल में परमात्मा में ही भलीभाँति स्थित हो जाता है, उस काल में सम्पूर्ण भोगों से स्पृहारहित पुरुष योगयुक्त है, ऐसा कहा जाता है";
                }else if(i==18){
                    name="यथा दीपो निवातस्थो नेंगते सोपमा स्मृता ।\n" +
                            "योगिनो यतचित्तस्य युञ्जतो योगमात्मनः ॥\n";
                    desc="भावार्थ : जिस प्रकार वायुरहित स्थान में स्थित दीपक चलायमान नहीं होता, वैसी ही उपमा परमात्मा के ध्यान में लगे हुए योगी के जीते हुए चित्त की कही गई है";
                }else if(i==19){
                    name="यत्रोपरमते चित्तं निरुद्धं योगसेवया ।\n" +
                            "यत्र चैवात्मनात्मानं पश्यन्नात्मनि तुष्यति ॥";
                    desc="भावार्थ : योग के अभ्यास से निरुद्ध चित्त जिस अवस्था में उपराम हो जाता है और जिस अवस्था में परमात्मा के ध्यान से शुद्ध हुई सूक्ष्म बुद्धि द्वारा परमात्मा को साक्षात करता हुआ सच्चिदानन्दघन परमात्मा में ही सन्तुष्ट रहता है";
                }else if(i==20){
                    name="सुखमात्यन्तिकं यत्तद्\u200Dबुद्धिग्राह्यमतीन्द्रियम्\u200C ।\n" +
                            "वेत्ति यत्र न चैवायं स्थितश्चलति तत्त्वतः ॥";
                    desc="भावार्थ : इन्द्रियों से अतीत, केवल शुद्ध हुई सूक्ष्म बुद्धि द्वारा ग्रहण करने योग्य जो अनन्त आनन्द है, उसको जिस अवस्था में अनुभव करता है, और जिस अवस्था में स्थित यह योगी परमात्मा के स्वरूप से विचलित होता ही नहीं";
                }else if(i==21){
                    name="यं लब्ध्वा चापरं लाभं मन्यते नाधिकं ततः ।\n" +
                            "यस्मिन्स्थितो न दुःखेन गुरुणापि विचाल्यते ॥";
                    desc="भावार्थ : परमात्मा की प्राप्ति रूप जिस लाभ को प्राप्त होकर उसे अधिक दूसरा कुछ भी लाभ नहीं मानता और परमात्मा प्राप्ति रूप जिस अवस्था में स्थित योगी बड़े भारी दुःख से भी चलायमान नहीं होता";
                }else if(i==22){
                    name="तं विद्याद् दुःखसंयोगवियोगं योगसञ्ज्ञितम्।\n" +
                            "स निश्चयेन योक्तव्यो योगोऽनिर्विण्णचेतसा ॥";
                    desc="भावार्थ : जो दुःखरूप संसार के संयोग से रहित है तथा जिसका नाम योग है, उसको जानना चाहिए। वह योग न उकताए हुए अर्थात धैर्य और उत्साहयुक्त चित्त से निश्चयपूर्वक करना कर्तव्य है";
                }else if(i==23){
                    name="सङ्\u200Dकल्पप्रभवान्कामांस्त्यक्त्वा सर्वानशेषतः ।\n" +
                            "मनसैवेन्द्रियग्रामं विनियम्य समन्ततः ॥";
                    desc="भावार्थ : संकल्प से उत्पन्न होने वाली सम्पूर्ण कामनाओं को निःशेष रूप से त्यागकर और मन द्वारा इन्द्रियों के समुदाय को सभी ओर से भलीभाँति रोककर";
                }else if(i==24){
                    name="शनैः शनैरुपरमेद्\u200Dबुद्धया धृतिगृहीतया।\n" +
                            "आत्मसंस्थं मनः कृत्वा न किंचिदपि चिन्तयेत्\u200C ॥";
                    desc="भावार्थ : क्रम-क्रम से अभ्यास करता हुआ उपरति को प्राप्त हो तथा धैर्ययुक्त बुद्धि द्वारा मन को परमात्मा में स्थित करके परमात्मा के सिवा और कुछ भी चिन्तन न करे";
                }else if(i==25){
                    name="यतो यतो निश्चरति मनश्चञ्चलमस्थिरम्\u200C ।\n" +
                            "ततस्ततो नियम्यैतदात्मन्येव वशं नयेत्\u200C ॥";
                    desc="भावार्थ : यह स्थिर न रहने वाला और चंचल मन जिस-जिस शब्दादि विषय के निमित्त से संसार में विचरता है, उस-उस विषय से रोककर यानी हटाकर इसे बार-बार परमात्मा में ही निरुद्ध करे";
                }else if(i==26){
                    name="प्रशान्तमनसं ह्येनं योगिनं सुखमुत्तमम्\u200C ।\n" +
                            "उपैति शांतरजसं ब्रह्मभूतमकल्मषम्\u200C ॥";
                    desc="भावार्थ : क्योंकि जिसका मन भली प्रकार शांत है, जो पाप से रहित है और जिसका रजोगुण शांत हो गया है, ऐसे इस सच्चिदानन्दघन ब्रह्म के साथ एकीभाव हुए योगी को उत्तम आनंद प्राप्त होता है";
                }else if(i==27){
                    name="युञ्जन्नेवं सदात्मानं योगी विगतकल्मषः ।\n" +
                            "सुखेन ब्रह्मसंस्पर्शमत्यन्तं सुखमश्नुते ॥";
                    desc="भावार्थ : वह पापरहित योगी इस प्रकार निरंतर आत्मा को परमात्मा में लगाता हुआ सुखपूर्वक परब्रह्म परमात्मा की प्राप्ति रूप अनन्त आनंद का अनुभव करता है";
                }else if(i==28){
                    name="सर्वभूतस्थमात्मानं सर्वभूतानि चात्मनि ।\n" +
                            "ईक्षते योगयुक्तात्मा सर्वत्र समदर्शनः ॥";
                    desc="भावार्थ : सर्वव्यापी अनंत चेतन में एकीभाव से स्थिति रूप योग से युक्त आत्मा वाला तथा सब में समभाव से देखने वाला योगी आत्मा को सम्पूर्ण भूतों में स्थित और सम्पूर्ण भूतों को आत्मा में कल्पित देखता है";
                }else if(i==29){
                    name="यो मां पश्यति सर्वत्र सर्वं च मयि पश्यति ।\n" +
                            "तस्याहं न प्रणश्यामि स च मे न प्रणश्यति ॥";
                    desc="भावार्थ : जो पुरुष सम्पूर्ण भूतों में सबके आत्मरूप मुझ वासुदेव को ही व्यापक देखता है और सम्पूर्ण भूतों को मुझ वासुदेव के अन्तर्गत (गीता अध्याय 9 श्लोक 6 में देखना चाहिए।) देखता है, उसके लिए मैं अदृश्य नहीं होता और वह मेरे लिए अदृश्य नहीं होता";
                }else if(i==30){
                    name="सर्वभूतस्थितं यो मां भजत्येकत्वमास्थितः ।\n" +
                            "सर्वथा वर्तमानोऽपि स योगी मयि वर्तते ॥";
                    desc="भावार्थ : जो पुरुष एकीभाव में स्थित होकर सम्पूर्ण भूतों में आत्मरूप से स्थित मुझ सच्चिदानन्दघन वासुदेव को भजता है, वह योगी सब प्रकार से बरतता हुआ भी मुझमें ही बरतता है";
                }else if(i==31){
                    name="आत्मौपम्येन सर्वत्र समं पश्यति योऽर्जुन ।\n" +
                            "सुखं वा यदि वा दुःखं स योगी परमो मतः ॥";
                    desc="भावार्थ : हे अर्जुन! जो योगी अपनी भाँति (जैसे मनुष्य अपने मस्तक, हाथ, पैर और गुदादि के साथ ब्राह्मण, क्षत्रिय, शूद्र और म्लेच्छादिकों का-सा बर्ताव करता हुआ भी उनमें आत्मभाव अर्थात अपनापन समान होने से सुख और दुःख को समान ही देखता है, वैसे ही सब भूतों में देखना 'अपनी भाँति' सम देखना है।) सम्पूर्ण भूतों में सम देखता है और सुख अथवा दुःख को भी सबमें सम देखता है, वह योगी परम श्रेष्ठ माना गया है";
                }else if(i==32){
                    name="योऽयं योगस्त्वया प्रोक्तः साम्येन मधुसूदन ।\n" +
                            "एतस्याहं न पश्यामि चञ्चलत्वात्स्थितिं स्थिराम्\u200C ॥";
                    desc="भावार्थ : अर्जुन बोले- हे मधुसूदन! जो यह योग आपने समभाव से कहा है, मन के चंचल होने से मैं इसकी नित्य स्थिति को नहीं देखता हूँ";
                }else if(i==33){
                    name="चञ्चलं हि मनः कृष्ण प्रमाथि बलवद्दृढम्\u200C ।\n" +
                            "तस्याहं निग्रहं मन्ये वायोरिव सुदुष्करम्\u200C ॥";
                    desc="भावार्थ : क्योंकि हे श्रीकृष्ण! यह मन बड़ा चंचल, प्रमथन स्वभाव वाला, बड़ा दृढ़ और बलवान है। इसलिए उसको वश में करना मैं वायु को रोकने की भाँति अत्यन्त दुष्कर मानता हूँ";
                }else if(i==34){
                    name="असंशयं महाबाहो मनो दुर्निग्रहं चलम्\u200C ।\n" +
                            "अभ्यासेन तु कौन्तेय वैराग्येण च गृह्यते ॥";
                    desc="भावार्थ : श्री भगवान बोले- हे महाबाहो! निःसंदेह मन चंचल और कठिनता से वश में होने वाला है। परन्तु हे कुंतीपुत्र अर्जुन! यह अभ्यास (गीता अध्याय 12 श्लोक 9 की टिप्पणी में इसका विस्तार देखना चाहिए।) और वैराग्य से वश में होता है";
                }else if(i==35){
                    name="असंयतात्मना योगो दुष्प्राप इति मे मतिः ।\n" +
                            "वश्यात्मना तु यतता शक्योऽवाप्तुमुपायतः ॥";
                    desc="भावार्थ : जिसका मन वश में किया हुआ नहीं है, ऐसे पुरुष द्वारा योग दुष्प्राप्य है और वश में किए हुए मन वाले प्रयत्नशील पुरुष द्वारा साधन से उसका प्राप्त होना सहज है- यह मेरा मत है";
                }else if(i==36){
                    name="अयतिः श्रद्धयोपेतो योगाच्चलितमानसः ।\n" +
                            "अप्राप्य योगसंसिद्धिं कां गतिं कृष्ण गच्छति ॥";
                    desc="भावार्थ : अर्जुन बोले- हे श्रीकृष्ण! जो योग में श्रद्धा रखने वाला है, किन्तु संयमी नहीं है, इस कारण जिसका मन अन्तकाल में योग से विचलित हो गया है, ऐसा साधक योग की सिद्धि को अर्थात भगवत्साक्षात्कार को न प्राप्त होकर किस गति को प्राप्त होता है";
                }else if(i==37){
                    name="कच्चिन्नोभयविभ्रष्टश्छिन्नाभ्रमिव नश्यति ।\n" +
                            "अप्रतिष्ठो महाबाहो विमूढो ब्रह्मणः पथि ॥";
                    desc="भावार्थ : हे महाबाहो! क्या वह भगवत्प्राप्ति के मार्ग में मोहित और आश्रयरहित पुरुष छिन्न-भिन्न बादल की भाँति दोनों ओर से भ्रष्ट होकर नष्ट तो नहीं हो जाता?";
                }else if(i==38){
                    name="एतन्मे संशयं कृष्ण छेत्तुमर्हस्यशेषतः ।\n" +
                            "त्वदन्यः संशयस्यास्य छेत्ता न ह्युपपद्यते ॥";
                    desc="भावार्थ : हे श्रीकृष्ण! मेरे इस संशय को सम्पूर्ण रूप से छेदन करने के लिए आप ही योग्य हैं क्योंकि आपके सिवा दूसरा इस संशय का छेदन करने वाला मिलना संभव नहीं है";
                }else if(i==39){
                    name="पार्थ नैवेह नामुत्र विनाशस्तस्य विद्यते ।\n" +
                            "न हि कल्याणकृत्कश्चिद्दुर्गतिं तात गच्छति ॥";
                    desc="भावार्थ : श्री भगवान बोले- हे पार्थ! उस पुरुष का न तो इस लोक में नाश होता है और न परलोक में ही क्योंकि हे प्यारे! आत्मोद्धार के लिए अर्थात भगवत्प्राप्ति के लिए कर्म करने वाला कोई भी मनुष्य दुर्गति को प्राप्त नहीं होता";
                }else if(i==40){
                    name="प्राप्य पुण्यकृतां लोकानुषित्वा शाश्वतीः समाः ।\n" +
                            "शुचीनां श्रीमतां गेहे योगभ्रष्टोऽभिजायते ॥";
                    desc="भावार्थ : योगभ्रष्ट पुरुष पुण्यवानों के लोकों को अर्थात स्वर्गादि उत्तम लोकों को प्राप्त होकर उनमें बहुत वर्षों तक निवास करके फिर शुद्ध आचरण वाले श्रीमान पुरुषों के घर में जन्म लेता है";
                }else if(i==41){
                    name="अथवा योगिनामेव कुले भवति धीमताम्\u200C ।\n" +
                            "एतद्धि दुर्लभतरं लोके जन्म यदीदृशम्\u200C ॥";
                    desc="भावार्थ : अथवा वैराग्यवान पुरुष उन लोकों में न जाकर ज्ञानवान योगियों के ही कुल में जन्म लेता है, परन्तु इस प्रकार का जो यह जन्म है, सो संसार में निःसंदेह अत्यन्त दुर्लभ है";
                }else if(i==42){
                    name="तत्र तं बुद्धिसंयोगं लभते पौर्वदेहिकम्\u200C ।\n" +
                            "यतते च ततो भूयः संसिद्धौ कुरुनन्दन ॥";
                    desc="भावार्थ : वहाँ उस पहले शरीर में संग्रह किए हुए बुद्धि-संयोग को अर्थात समबुद्धिरूप योग के संस्कारों को अनायास ही प्राप्त हो जाता है और हे कुरुनन्दन! उसके प्रभाव से वह फिर परमात्मा की प्राप्तिरूप सिद्धि के लिए पहले से भी बढ़कर प्रयत्न करता है";
                }else if(i==43){
                    name="पूर्वाभ्यासेन तेनैव ह्रियते ह्यवशोऽपि सः ।\n" +
                            "जिज्ञासुरपि योगस्य शब्दब्रह्मातिवर्तते ॥";
                    desc="भावार्थ : वह (यहाँ 'वह' शब्द से श्रीमानों के घर में जन्म लेने वाला योगभ्रष्ट पुरुष समझना चाहिए।) श्रीमानों के घर में जन्म लेने वाला योगभ्रष्ट पराधीन हुआ भी उस पहले के अभ्यास से ही निःसंदेह भगवान की ओर आकर्षित किया जाता है तथा समबुद्धि रूप योग का जिज्ञासु भी वेद में कहे हुए सकाम कर्मों के फल को उल्लंघन कर जाता है";
                }else if(i==44){
                    name="प्रयत्नाद्यतमानस्तु योगी संशुद्धकिल्बिषः ।\n" +
                            "अनेकजन्मसंसिद्धस्ततो यात परां गतिम्\u200C ॥\n";
                    desc="भावार्थ : परन्तु प्रयत्नपूर्वक अभ्यास करने वाला योगी तो पिछले अनेक जन्मों के संस्कारबल से इसी जन्म में संसिद्ध होकर सम्पूर्ण पापों से रहित हो फिर तत्काल ही परमगति को प्राप्त हो जाता है";
                }else if(i==45){
                    name="तपस्विभ्योऽधिको योगी ज्ञानिभ्योऽपि मतोऽधिकः ।\n" +
                            "कर्मिभ्यश्चाधिको योगी तस्माद्योगी भवार्जुन ॥";
                    desc="भावार्थ : योगी तपस्वियों से श्रेष्ठ है, शास्त्रज्ञानियों से भी श्रेष्ठ माना गया है और सकाम कर्म करने वालों से भी योगी श्रेष्ठ है। इससे हे अर्जुन! तू योगी हो";
                }else if(i==46){
                    name="योगिनामपि सर्वेषां मद्गतेनान्तरात्मना ।\n" +
                            "श्रद्धावान्भजते यो मां स मे युक्ततमो मतः ॥";
                    desc="भावार्थ : सम्पूर्ण योगियों में भी जो श्रद्धावान योगी मुझमें लगे हुए अन्तरात्मा से मुझको निरन्तर भजता है, वह योगी मुझे परम श्रेष्ठ मान्य है";
                }
            }else if(n==6){
                if(i==0){
                    name="मय्यासक्तमनाः पार्थ योगं युञ्जन्मदाश्रयः ।\n" +
                            "असंशयं समग्रं मां यथा ज्ञास्यसि तच्छृणु ॥";
                    desc="भावार्थ : श्री भगवान बोले- हे पार्थ! अनन्य प्रेम से मुझमें आसक्त चित तथा अनन्य भाव से मेरे परायण होकर योग में लगा हुआ तू जिस प्रकार से सम्पूर्ण विभूति, बल, ऐश्वर्यादि गुणों से युक्त, सबके आत्मरूप मुझको संशयरहित जानेगा, उसको सुन";
                }else if(i==1){
                    name="ज्ञानं तेऽहं सविज्ञानमिदं वक्ष्याम्यशेषतः ।\n" +
                            "यज्ज्ञात्वा नेह भूयोऽन्यज्ज्ञातव्यमवशिष्यते ॥";
                    desc="भावार्थ : मैं तेरे लिए इस विज्ञान सहित तत्व ज्ञान को सम्पूर्णतया कहूँगा, जिसको जानकर संसार में फिर और कुछ भी जानने योग्य शेष नहीं रह जाता";
                }else if(i==2){
                    name="मनुष्याणां सहस्रेषु कश्चिद्यतति सिद्धये ।\n" +
                            "यततामपि सिद्धानां कश्चिन्मां वेत्ति तत्वतः ॥";
                    desc="भावार्थ : हजारों मनुष्यों में कोई एक मेरी प्राप्ति के लिए यत्न करता है और उन यत्न करने वाले योगियों में भी कोई एक मेरे परायण होकर मुझको तत्व से अर्थात यथार्थ रूप से जानता है";
                }else if(i==3){
                    name="भूमिरापोऽनलो वायुः खं मनो बुद्धिरेव च ।\n" +
                            "अहङ्\u200Dकार इतीयं मे भिन्ना प्रकृतिरष्टधा ॥";
                    desc="";
                }else if(i==4){
                    name="अपरेयमितस्त्वन्यां प्रकृतिं विद्धि मे पराम्\u200C ।\n" +
                            "जीवभूतां महाबाहो ययेदं धार्यते जगत्\u200C ॥";
                    desc="भावार्थ : पृथ्वी, जल, अग्नि, वायु, आकाश, मन, बुद्धि और अहंकार भी- इस प्रकार ये आठ प्रकार से विभाजित मेरी प्रकृति है। यह आठ प्रकार के भेदों वाली तो अपरा अर्थात मेरी जड़ प्रकृति है और हे महाबाहो! इससे दूसरी को, जिससे यह सम्पूर्ण जगत धारण किया जाता है, मेरी जीवरूपा परा अर्थात चेतन प्रकृति जान";
                }else if(i==5){
                    name="एतद्योनीनि भूतानि सर्वाणीत्युपधारय ।\n" +
                            "अहं कृत्स्नस्य जगतः प्रभवः प्रलयस्तथा ॥";
                    desc="भावार्थ : हे अर्जुन! तू ऐसा समझ कि सम्पूर्ण भूत इन दोनों प्रकृतियों से ही उत्पन्न होने वाले हैं और मैं सम्पूर्ण जगत का प्रभव तथा प्रलय हूँ अर्थात्\u200C सम्पूर्ण जगत का मूल कारण हूँ";
                }else if(i==6){
                    name="मत्तः परतरं नान्यत्किञ्चिदस्ति धनञ्जय ।\n" +
                            "मयि सर्वमिदं प्रोतं सूत्रे मणिगणा इव ॥";
                    desc="भावार्थ : हे धनंजय! मुझसे भिन्न दूसरा कोई भी परम कारण नहीं है। यह सम्पूर्ण जगत सूत्र में सूत्र के मणियों के सदृश मुझमें गुँथा हुआ है";
                }else if(i==7){
                    name="रसोऽहमप्सु कौन्तेय प्रभास्मि शशिसूर्ययोः ।\n" +
                            "प्रणवः सर्ववेदेषु शब्दः खे पौरुषं नृषु ॥";
                    desc="भावार्थ : हे अर्जुन! मैं जल में रस हूँ, चन्द्रमा और सूर्य में प्रकाश हूँ, सम्पूर्ण वेदों में ओंकार हूँ, आकाश में शब्द और पुरुषों में पुरुषत्व हूँ";
                }else if(i==8){
                    name="पुण्यो गन्धः पृथिव्यां च तेजश्चास्मि विभावसौ ।\n" +
                            "जीवनं सर्वभूतेषु तपश्चास्मि तपस्विषु ॥";
                    desc="भावार्थ : मैं पृथ्वी में पवित्र (शब्द, स्पर्श, रूप, रस, गंध से इस प्रसंग में इनके कारण रूप तन्मात्राओं का ग्रहण है, इस बात को स्पष्ट करने के लिए उनके साथ पवित्र शब्द जोड़ा गया है।) गंध और अग्नि में तेज हूँ तथा सम्पूर्ण भूतों में उनका जीवन हूँ और तपस्वियों में तप हूँ";
                }else if(i==9){
                    name="बीजं मां सर्वभूतानां विद्धि पार्थ सनातनम्\u200C ।\n" +
                            "बुद्धिर्बुद्धिमतामस्मि तेजस्तेजस्विनामहम्\u200C ॥";
                    desc="भावार्थ : हे अर्जुन! तू सम्पूर्ण भूतों का सनातन बीज मुझको ही जान। मैं बुद्धिमानों की बुद्धि और तेजस्वियों का तेज हूँ";
                }else if(i==10){
                    name="बलं बलवतां चाहं कामरागविवर्जितम्\u200C ।\n" +
                            "धर्माविरुद्धो भूतेषु कामोऽस्मि भरतर्षभ ॥";
                    desc="भावार्थ : हे भरतश्रेष्ठ! मैं बलवानों का आसक्ति और कामनाओं से रहित बल अर्थात सामर्थ्य हूँ और सब भूतों में धर्म के अनुकूल अर्थात शास्त्र के अनुकूल काम हूँ";
                }else if(i==11){
                    name="ये चैव सात्त्विका भावा राजसास्तामसाश्चये ।\n" +
                            "मत्त एवेति तान्विद्धि न त्वहं तेषु ते मयि ॥";
                    desc="भावार्थ : और भी जो सत्त्व गुण से उत्पन्न होने वाले भाव हैं और जो रजो गुण से होने वाले भाव हैं, उन सबको तू 'मुझसे ही होने वाले हैं' ऐसा जान, परन्तु वास्तव में (गीता अ. 9 श्लोक 4-5 में देखना चाहिए) उनमें मैं और वे मुझमें नहीं हैं";
                }else if(i==12){
                    name="त्रिभिर्गुणमयैर्भावैरेभिः सर्वमिदं जगत्\u200C ।\n" +
                            "मोहितं नाभिजानाति मामेभ्यः परमव्ययम्\u200C ॥";
                    desc="भावार्थ : गुणों के कार्य रूप सात्त्विक, राजस और तामस- इन तीनों प्रकार के भावों से यह सारा संसार- प्राणिसमुदाय मोहित हो रहा है, इसीलिए इन तीनों गुणों से परे मुझ अविनाशी को नहीं जानता";
                }else if(i==13){
                    name="दैवी ह्येषा गुणमयी मम माया दुरत्यया ।\n" +
                            "मामेव ये प्रपद्यन्ते मायामेतां तरन्ति ते ॥";
                    desc="भावार्थ : क्योंकि यह अलौकिक अर्थात अति अद्भुत त्रिगुणमयी मेरी माया बड़ी दुस्तर है, परन्तु जो पुरुष केवल मुझको ही निरंतर भजते हैं, वे इस माया को उल्लंघन कर जाते हैं अर्थात्\u200C संसार से तर जाते हैं";
                }else if(i==14){
                    name="न मां दुष्कृतिनो मूढाः प्रपद्यन्ते नराधमाः ।\n" +
                            "माययापहृतज्ञाना आसुरं भावमाश्रिताः ॥";
                    desc="भावार्थ : माया द्वारा जिनका ज्ञान हरा जा चुका है, ऐसे आसुर-स्वभाव को धारण किए हुए, मनुष्यों में नीच, दूषित कर्म करने वाले मूढ़ लोग मुझको नहीं भजते";
                }else if(i==15){
                    name="चतुर्विधा भजन्ते मां जनाः सुकृतिनोऽर्जुन ।\n" +
                            "आर्तो जिज्ञासुरर्थार्थी ज्ञानी च भरतर्षभ ॥";
                    desc="भावार्थ : हे भरतवंशियों में श्रेष्ठ अर्जुन! उत्तम कर्म करने वाले अर्थार्थी (सांसारिक पदार्थों के लिए भजने वाला), आर्त (संकटनिवारण के लिए भजने वाला) जिज्ञासु (मेरे को यथार्थ रूप से जानने की इच्छा से भजने वाला) और ज्ञानी- ऐसे चार प्रकार के भक्तजन मुझको भजते हैं";
                }else if(i==16){
                    name="तेषां ज्ञानी नित्ययुक्त एकभक्तिर्विशिष्यते ।\n" +
                            "प्रियो हि ज्ञानिनोऽत्यर्थमहं स च मम प्रियः ॥";
                    desc="भावार्थ : उनमें नित्य मुझमें एकीभाव से स्थित अनन्य प्रेमभक्ति वाला ज्ञानी भक्त अति उत्तम है क्योंकि मुझको तत्व से जानने वाले ज्ञानी को मैं अत्यन्त प्रिय हूँ और वह ज्ञानी मुझे अत्यन्त प्रिय है";
                }else if(i==17){
                    name="उदाराः सर्व एवैते ज्ञानी त्वात्मैव मे मतम्\u200C ।\n" +
                            "आस्थितः स हि युक्तात्मा मामेवानुत्तमां गतिम्\u200C ॥";
                    desc="भावार्थ : ये सभी उदार हैं, परन्तु ज्ञानी तो साक्षात्\u200C मेरा स्वरूप ही है- ऐसा मेरा मत है क्योंकि वह मद्गत मन-बुद्धिवाला ज्ञानी भक्त अति उत्तम गतिस्वरूप मुझमें ही अच्छी प्रकार स्थित है";
                }else if(i==18){
                    name="बहूनां जन्मनामन्ते ज्ञानवान्मां प्रपद्यते ।\n" +
                            "वासुदेवः सर्वमिति स महात्मा सुदुर्लभः ॥";
                    desc="भावार्थ : बहुत जन्मों के अंत के जन्म में तत्व ज्ञान को प्राप्त पुरुष, सब कुछ वासुदेव ही हैं- इस प्रकार मुझको भजता है, वह महात्मा अत्यन्त दुर्लभ है";
                }else if(i==19){
                    name="कामैस्तैस्तैर्हृतज्ञानाः प्रपद्यन्तेऽन्यदेवताः ।\n" +
                            "तं तं नियममास्थाय प्रकृत्या नियताः स्वया ॥";
                    desc="भावार्थ : उन-उन भोगों की कामना द्वारा जिनका ज्ञान हरा जा चुका है, वे लोग अपने स्वभाव से प्रेरित होकर उस-उस नियम को धारण करके अन्य देवताओं को भजते हैं अर्थात पूजते हैं";
                }else if(i==20){
                    name="यो यो यां यां तनुं भक्तः श्रद्धयार्चितुमिच्छति ।\n" +
                            "तस्य तस्याचलां श्रद्धां तामेव विदधाम्यहम्\u200C ॥";
                    desc="भावार्थ : जो-जो सकाम भक्त जिस-जिस देवता के स्वरूप को श्रद्धा से पूजना चाहता है, उस-उस भक्त की श्रद्धा को मैं उसी देवता के प्रति स्थिर करता हूँ";
                }else if(i==21){
                    name="स तया श्रद्धया युक्तस्तस्याराधनमीहते ।\n" +
                            "लभते च ततः कामान्मयैव विहितान्हि तान्\u200C ॥";
                    desc="भावार्थ : वह पुरुष उस श्रद्धा से युक्त होकर उस देवता का पूजन करता है और उस देवता से मेरे द्वारा ही विधान किए हुए उन इच्छित भोगों को निःसंदेह प्राप्त करता है";
                }else if(i==22){
                    name="अन्तवत्तु फलं तेषां तद्भवत्यल्पमेधसाम्\u200C ।\n" +
                            "देवान्देवयजो यान्ति मद्भक्ता यान्ति मामपि ॥";
                    desc="भावार्थ : परन्तु उन अल्प बुद्धिवालों का वह फल नाशवान है तथा वे देवताओं को पूजने वाले देवताओं को प्राप्त होते हैं और मेरे भक्त चाहे जैसे ही भजें, अन्त में वे मुझको ही प्राप्त होते हैं";
                }else if(i==23){
                    name="अव्यक्तं व्यक्तिमापन्नं मन्यन्ते मामबुद्धयः ।\n" +
                            "परं भावमजानन्तो ममाव्ययमनुत्तमम्\u200C ॥";
                    desc="भावार्थ : बुद्धिहीन पुरुष मेरे अनुत्तम अविनाशी परम भाव को न जानते हुए मन-इन्द्रियों से परे मुझ सच्चिदानन्दघन परमात्मा को मनुष्य की भाँति जन्मकर व्यक्ति भाव को प्राप्त हुआ मानते हैं";
                }else if(i==24){
                    name="नाहं प्रकाशः सर्वस्य योगमायासमावृतः ।\n" +
                            "मूढोऽयं नाभिजानाति लोको मामजमव्ययम्\u200C ॥";
                    desc="भावार्थ : अपनी योगमाया से छिपा हुआ मैं सबके प्रत्यक्ष नहीं होता, इसलिए यह अज्ञानी जनसमुदाय मुझ जन्मरहित अविनाशी परमेश्वर को नहीं जानता अर्थात मुझको जन्मने-मरने वाला समझता है";
                }else if(i==25){
                    name="वेदाहं समतीतानि वर्तमानानि चार्जुन ।\n" +
                            "भविष्याणि च भूतानि मां तु वेद न कश्चन ॥";
                    desc="भावार्थ : हे अर्जुन! पूर्व में व्यतीत हुए और वर्तमान में स्थित तथा आगे होने वाले सब भूतों को मैं जानता हूँ, परन्तु मुझको कोई भी श्रद्धा-भक्तिरहित पुरुष नहीं जानता";
                }else if(i==26){
                    name="इच्छाद्वेषसमुत्थेन द्वन्द्वमोहेन भारत ।\n" +
                            "सर्वभूतानि सम्मोहं सर्गे यान्ति परन्तप ॥";
                    desc="भावार्थ :  हे भरतवंशी अर्जुन! संसार में इच्छा और द्वेष से उत्पन्न सुख-दुःखादि द्वंद्वरूप मोह से सम्पूर्ण प्राणी अत्यन्त अज्ञता को प्राप्त हो रहे हैं";
                }else if(i==27){
                    name="येषां त्वन्तगतं पापं जनानां पुण्यकर्मणाम्\u200C ।\n" +
                            "ते द्वन्द्वमोहनिर्मुक्ता भजन्ते मां दृढव्रताः ॥";
                    desc="भावार्थ : परन्तु निष्काम भाव से श्रेष्ठ कर्मों का आचरण करने वाले जिन पुरुषों का पाप नष्ट हो गया है, वे राग-द्वेषजनित द्वन्द्व रूप मोह से मुक्त दृढ़निश्चयी भक्त मुझको सब प्रकार से भजते हैं";
                }else if(i==28){
                    name="जरामरणमोक्षाय मामाश्रित्य यतन्ति ये ।\n" +
                            "ते ब्रह्म तद्विदुः कृत्स्नमध्यात्मं कर्म चाखिलम्\u200C ॥";
                    desc="भावार्थ : जो मेरे शरण होकर जरा और मरण से छूटने के लिए यत्न करते हैं, वे पुरुष उस ब्रह्म को, सम्पूर्ण अध्यात्म को, सम्पूर्ण कर्म को जानते हैं";
                }else if(i==29){
                    name="साधिभूताधिदैवं मां साधियज्ञं च ये विदुः ।\n" +
                            "प्रयाणकालेऽपि च मां ते विदुर्युक्तचेतसः ॥";
                    desc="भावार्थ :  जो पुरुष अधिभूत और अधिदैव सहित तथा अधियज्ञ सहित (सबका आत्मरूप) मुझे अन्तकाल में भी जानते हैं, वे युक्तचित्तवाले पुरुष मुझे जानते हैं अर्थात प्राप्त हो जाते हैं";
                }
            }else if(n==7){
                if(i==0){
                    name="किं तद्ब्रह्म किमध्यात्मं किं पुरुषोत्तम ।\n" +
                            "अधिभूतं च किं प्रोक्तमधिदैवं किमुच्यते৷৷";
                    desc="भावार्थ : अर्जुन ने कहा- हे पुरुषोत्तम! वह ब्रह्म क्या है? अध्यात्म क्या है? कर्म क्या है? अधिभूत नाम से क्या कहा गया है और अधिदैव किसको कहते हैं";
                }else if(i==1){
                    name="अधियज्ञः कथं कोऽत्र देहेऽस्मिन्मधुसूदन ।\n" +
                            "प्रयाणकाले च कथं ज्ञेयोऽसि नियतात्मभिः ॥";
                    desc="भावार्थ : हे मधुसूदन! यहाँ अधियज्ञ कौन है? और वह इस शरीर में कैसे है? तथा युक्त चित्त वाले पुरुषों द्वारा अंत समय में आप किस प्रकार जानने में आते हैं";
                }else if(i==2){
                    name="अक्षरं ब्रह्म परमं स्वभावोऽध्यात्ममुच्यते ।\n" +
                            "भूतभावोद्भवकरो विसर्गः कर्मसंज्ञितः";
                    desc="भावार्थ : श्री भगवान ने कहा- परम अक्षर 'ब्रह्म' है, अपना स्वरूप अर्थात जीवात्मा 'अध्यात्म' नाम से कहा जाता है तथा भूतों के भाव को उत्पन्न करने वाला जो त्याग है, वह 'कर्म' नाम से कहा गया है";
                }else if(i==3){
                    name="अधिभूतं क्षरो भावः पुरुषश्चाधिदैवतम्\u200C ।\n" +
                            "अधियज्ञोऽहमेवात्र देहे देहभृतां वर ॥";
                    desc="भावार्थ : उत्पत्ति-विनाश धर्म वाले सब पदार्थ अधिभूत हैं, हिरण्यमय पुरुष (जिसको शास्त्रों में सूत्रात्मा, हिरण्यगर्भ, प्रजापति, ब्रह्मा इत्यादि नामों से कहा गया है) अधिदैव है और हे देहधारियों में श्रेष्ठ अर्जुन! इस शरीर में मैं वासुदेव ही अन्तर्यामी रूप से अधियज्ञ हूँ";
                }else if(i==4){
                    name="अंतकाले च मामेव स्मरन्मुक्त्वा कलेवरम्\u200C ।\n" +
                            "यः प्रयाति स मद्भावं याति नास्त्यत्र संशयः ৷৷";
                    desc="भावार्थ : जो पुरुष अंतकाल में भी मुझको ही स्मरण करता हुआ शरीर को त्याग कर जाता है, वह मेरे साक्षात स्वरूप को प्राप्त होता है- इसमें कुछ भी संशय नहीं है";
                }else if(i==5){
                    name="यं यं वापि स्मरन्भावं त्यजत्यन्ते कलेवरम्\u200C ।\n" +
                            "तं तमेवैति कौन्तेय सदा तद्भावभावितः ৷৷";
                    desc="भावार्थ : हे कुन्ती पुत्र अर्जुन! यह मनुष्य अंतकाल में जिस-जिस भी भाव को स्मरण करता हुआ शरीर त्याग करता है, उस-उसको ही प्राप्त होता है क्योंकि वह सदा उसी भाव से भावित रहा है";
                }else if(i==6){
                    name="तस्मात्सर्वेषु कालेषु मामनुस्मर युद्ध च ।\n" +
                            "मय्यर्पितमनोबुद्धिर्मामेवैष्यस्यसंशयम्\u200C ৷৷";
                    desc="भावार्थ : इसलिए हे अर्जुन! तू सब समय में निरंतर मेरा स्मरण कर और युद्ध भी कर। इस प्रकार मुझमें अर्पण किए हुए मन-बुद्धि से युक्त होकर तू निःसंदेह मुझको ही प्राप्त होगा";
                }else if(i==7){
                    name="अभ्यासयोगयुक्तेन चेतसा नान्यगामिना ।\n" +
                            "परमं पुरुषं दिव्यं याति पार्थानुचिन्तयन्\u200C ॥";
                    desc="भावार्थ : हे पार्थ! यह नियम है कि परमेश्वर के ध्यान के अभ्यास रूप योग से युक्त, दूसरी ओर न जाने वाले चित्त से निरंतर चिंतन करता हुआ मनुष्य परम प्रकाश रूप दिव्य पुरुष को अर्थात परमेश्वर को ही प्राप्त होता है";
                }else if(i==8){
                    name="कविं पुराणमनुशासितार-मणोरणीयांसमनुस्मरेद्यः ।\n" +
                            "सर्वस्य धातारमचिन्त्यरूप-मादित्यवर्णं तमसः परस्तात्\u200C ৷৷";
                    desc="भावार्थ : जो पुरुष सर्वज्ञ, अनादि, सबके नियंता (अंतर्यामी रूप से सब प्राणियों के शुभ और अशुभ कर्म के अनुसार शासन करने वाला) सूक्ष्म से भी अति सूक्ष्म, सबके धारण-पोषण करने वाले अचिन्त्य-स्वरूप, सूर्य के सदृश नित्य चेतन प्रकाश रूप और अविद्या से अति परे, शुद्ध सच्चिदानन्दघन परमेश्वर का स्मरण करता है";
                }else if(i==9){
                    name="प्रयाण काले मनसाचलेन भक्त्या युक्तो योगबलेन चैव ।\n" +
                            "भ्रुवोर्मध्ये प्राणमावेश्य सम्यक्\u200C- स तं परं पुरुषमुपैति दिव्यम्\u200C ৷৷";
                    desc="भावार्थ : वह भक्ति युक्त पुरुष अन्तकाल में भी योगबल से भृकुटी के मध्य में प्राण को अच्छी प्रकार स्थापित करके, फिर निश्चल मन से स्मरण करता हुआ उस दिव्य रूप परम पुरुष परमात्मा को ही प्राप्त होता है";
                }else if(i==10){
                    name="यदक्षरं वेदविदो वदन्ति विशन्ति यद्यतयो वीतरागाः ।\n" +
                            "यदिच्छन्तो ब्रह्मचर्यं चरन्ति तत्ते पदं संग्रहेण प्रवक्ष्ये ৷৷";
                    desc="भावार्थ : वेद के जानने वाले विद्वान जिस सच्चिदानन्दघनरूप परम पद को अविनाश कहते हैं, आसक्ति रहित यत्नशील संन्यासी महात्माजन, जिसमें प्रवेश करते हैं और जिस परम पद को चाहने वाले ब्रह्मचारी लोग ब्रह्मचर्य का आचरण करते हैं, उस परम पद को मैं तेरे लिए संक्षेप में कहूँगा";
                }else if(i==11){
                    name="सर्वद्वाराणि संयम्य मनो हृदि निरुध्य च ।\n" +
                            "मूर्ध्न्याधायात्मनः प्राणमास्थितो योगधारणाम्\u200C ॥";
                    desc="";
                }else if(i==12){
                    name="ओमित्येकाक्षरं ब्रह्म व्याहरन्मामनुस्मरन्\u200C ।\n" +
                            "यः प्रयाति त्यजन्देहं स याति परमां गतिम्\u200C ৷৷";
                    desc="भावार्थ : सब इंद्रियों के द्वारों को रोककर तथा मन को हृद्देश में स्थिर करके, फिर उस जीते हुए मन द्वारा प्राण को मस्तक में स्थापित करके, परमात्म संबंधी योगधारणा में स्थित होकर जो पुरुष 'ॐ' इस एक अक्षर रूप ब्रह्म को उच्चारण करता हुआ और उसके अर्थस्वरूप मुझ निर्गुण ब्रह्म का चिंतन करता हुआ शरीर को त्यागकर जाता है, वह पुरुष परम गति को प्राप्त होता है";
                }else if(i==13){
                    name="अनन्यचेताः सततं यो मां स्मरति नित्यशः ।\n" +
                            "तस्याहं सुलभः पार्थ नित्ययुक्तस्य योगिनीः ৷৷";
                    desc="भावार्थ : हे अर्जुन! जो पुरुष मुझमें अनन्य-चित्त होकर सदा ही निरंतर मुझ पुरुषोत्तम को स्मरण करता है, उस नित्य-निरंतर मुझमें युक्त हुए योगी के लिए मैं सुलभ हूँ, अर्थात उसे सहज ही प्राप्त हो जाता हूँ";
                }else if(i==14){
                    name="मामुपेत्य पुनर्जन्म दुःखालयमशाश्वतम्\u200C ।\n" +
                            "नाप्नुवन्ति महात्मानः संसिद्धिं परमां गताः ৷৷";
                    desc="भावार्थ : परम सिद्धि को प्राप्त महात्माजन मुझको प्राप्त होकर दुःखों के घर एवं क्षणभंगुर पुनर्जन्म को नहीं प्राप्त होते";
                }else if(i==15){
                    name="आब्रह्मभुवनाल्लोकाः पुनरावर्तिनोऽर्जुन ।\n" +
                            "मामुपेत्य तु कौन्तेय पुनर्जन्म न विद्यते ৷৷";
                    desc="भावार्थ : हे अर्जुन! ब्रह्मलोकपर्यंत सब लोक पुनरावर्ती हैं, परन्तु हे कुन्तीपुत्र! मुझको प्राप्त होकर पुनर्जन्म नहीं होता, क्योंकि मैं कालातीत हूँ और ये सब ब्रह्मादि के लोक काल द्वारा सीमित होने से अनित्य हैं";
                }else if(i==16){
                    name="सहस्रयुगपर्यन्तमहर्यद्ब्रह्मणो विदुः ।\n" +
                            "रात्रिं युगसहस्रान्तां तेऽहोरात्रविदो जनाः ৷৷";
                    desc="भावार्थ : ब्रह्मा का जो एक दिन है, उसको एक हजार चतुर्युगी तक की अवधि वाला और रात्रि को भी एक हजार चतुर्युगी तक की अवधि वाला जो पुरुष तत्व से जानते हैं, वे योगीजन काल के तत्व को जानने वाले हैं";
                }else if(i==17){
                    name="अव्यक्ताद्व्यक्तयः सर्वाः प्रभवन्त्यहरागमे ।\n" +
                            "रात्र्यागमे प्रलीयन्ते तत्रैवाव्यक्तसंज्ञके ৷৷";
                    desc="भावार्थ : संपूर्ण चराचर भूतगण ब्रह्मा के दिन के प्रवेश काल में अव्यक्त से अर्थात ब्रह्मा के सूक्ष्म शरीर से उत्पन्न होते हैं और ब्रह्मा की रात्रि के प्रवेशकाल में उस अव्यक्त नामक ब्रह्मा के सूक्ष्म शरीर में ही लीन हो जाते हैं";
                }else if(i==18){
                    name="भूतग्रामः स एवायं भूत्वा भूत्वा प्रलीयते ।\n" +
                            "रात्र्यागमेऽवशः पार्थ प्रभवत्यहरागमे ৷৷";
                    desc="भावार्थ : हे पार्थ! वही यह भूतसमुदाय उत्पन्न हो-होकर प्रकृति वश में हुआ रात्रि के प्रवेश काल में लीन होता है और दिन के प्रवेश काल में फिर उत्पन्न होता है";
                }else if(i==19){
                    name="परस्तस्मात्तु भावोऽन्योऽव्यक्तोऽव्यक्तात्सनातनः ।\n" +
                            "यः स सर्वेषु भूतेषु नश्यत्सु न विनश्यति ৷৷ ";
                    desc="भावार्थ : उस अव्यक्त से भी अति परे दूसरा अर्थात विलक्षण जो सनातन अव्यक्त भाव है, वह परम दिव्य पुरुष सब भूतों के नष्ट होने पर भी नष्ट नहीं होता";
                }else if(i==20){
                    name="अव्यक्तोऽक्षर इत्युक्तस्तमाहुः परमां गतिम्\u200C ।\n" +
                            "यं प्राप्य न निवर्तन्ते तद्धाम परमं मम ৷৷";
                    desc="भावार्थ : जो अव्यक्त 'अक्षर' इस नाम से कहा गया है, उसी अक्षर नामक अव्यक्त भाव को परमगति कहते हैं तथा जिस सनातन अव्यक्त भाव को प्राप्त होकर मनुष्य वापस नहीं आते, वह मेरा परम धाम है";
                }else if(i==21){
                    name="पुरुषः स परः पार्थ भक्त्या लभ्यस्त्वनन्यया ।\n" +
                            "यस्यान्तः स्थानि भूतानि येन सर्वमिदं ततम्\u200C ৷৷";
                    desc="भावार्थ : हे पार्थ! जिस परमात्मा के अंतर्गत सर्वभूत है और जिस सच्चिदानन्दघन परमात्मा से यह समस्त जगत परिपूर्ण है (गीता अध्याय 9 श्लोक 4 में देखना चाहिए), वह सनातन अव्यक्त परम पुरुष तो अनन्य (गीता अध्याय 11 श्लोक 55 में इसका विस्तार देखना चाहिए) भक्ति से ही प्राप्त होने योग्य है ";
                }else if(i==22){
                    name="यत्र काले त्वनावत्तिमावृत्तिं चैव योगिनः ।\n" +
                            "प्रयाता यान्ति तं कालं वक्ष्यामि भरतर्षभ ৷৷";
                    desc="भावार्थ : हे अर्जुन! जिस काल में (यहाँ काल शब्द से मार्ग समझना चाहिए, क्योंकि आगे के श्लोकों में भगवान ने इसका नाम 'सृति', 'गति' ऐसा कहा है।) शरीर त्याग कर गए हुए योगीजन तो वापस न लौटने वाली गति को और जिस काल में गए हुए वापस लौटने वाली गति को ही प्राप्त होते हैं, उस काल को अर्थात दोनों मार्गों को कहूँगा";
                }else if(i==23){
                    name="अग्निर्ज्योतिरहः शुक्लः षण्मासा उत्तरायणम्\u200C ।\n" +
                            "तत्र प्रयाता गच्छन्ति ब्रह्म ब्रह्मविदो जनाः ৷৷";
                    desc="भावार्थ : जिस मार्ग में ज्योतिर्मय अग्नि-अभिमानी देवता हैं, दिन का अभिमानी देवता है, शुक्ल पक्ष का अभिमानी देवता है और उत्तरायण के छः महीनों का अभिमानी देवता है, उस मार्ग में मरकर गए हुए ब्रह्मवेत्ता योगीजन उपयुक्त देवताओं द्वारा क्रम से ले जाए जाकर ब्रह्म को प्राप्त होते हैं।";
                }else if(i==24){
                    name="धूमो रात्रिस्तथा कृष्ण षण्मासा दक्षिणायनम्\u200C ।\n" +
                            "तत्र चान्द्रमसं ज्योतिर्योगी प्राप्य निवर्तते ৷৷";
                    desc="भावार्थ : जिस मार्ग में धूमाभिमानी देवता है, रात्रि अभिमानी देवता है तथा कृष्ण पक्ष का अभिमानी देवता है और दक्षिणायन के छः महीनों का अभिमानी देवता है, उस मार्ग में मरकर गया हुआ सकाम कर्म करने वाला योगी उपयुक्त देवताओं द्वारा क्रम से ले गया हुआ चंद्रमा की ज्योत को प्राप्त होकर स्वर्ग में अपने शुभ कर्मों का फल भोगकर वापस आता है";
                }else if(i==25){
                    name="शुक्ल कृष्णे गती ह्येते जगतः शाश्वते मते ।\n" +
                            "एकया यात्यनावृत्ति मन्ययावर्तते पुनः ৷৷";
                    desc="भावार्थ : क्योंकि जगत के ये दो प्रकार के- शुक्ल और कृष्ण अर्थात देवयान और पितृयान मार्ग सनातन माने गए हैं। इनमें एक द्वारा गया हुआ (अर्थात इसी अध्याय के श्लोक 24 के अनुसार अर्चिमार्ग से गया हुआ योगी।)-- जिससे वापस नहीं लौटना पड़ता, उस परमगति को प्राप्त होता है और दूसरे के द्वारा गया हुआ ( अर्थात इसी अध्याय के श्लोक 25 के अनुसार धूममार्ग से गया हुआ सकाम कर्मयोगी।) फिर वापस आता है अर्थात्\u200C जन्म-मृत्यु को प्राप्त होता है";
                }else if(i==26){
                    name="नैते सृती पार्थ जानन्योगी मुह्यति कश्चन ।\n" +
                            "तस्मात्सर्वेषु कालेषु योगयुक्तो भवार्जुन ৷৷";
                    desc="भावार्थ : हे पार्थ! इस प्रकार इन दोनों मार्गों को तत्त्व से जानकर कोई भी योगी मोहित नहीं होता। इस कारण हे अर्जुन! तू सब काल में समबुद्धि रूप से योग से युक्त हो अर्थात निरंतर मेरी प्राप्ति के लिए साधन करने वाला हो";
                }else if(i==27){
                    name="वेदेषु यज्ञेषु तपःसु चैव दानेषु यत्पुण्यफलं प्रदिष्टम्\u200C ।\n" +
                            "अत्येत तत्सर्वमिदं विदित्वा योगी परं स्थानमुपैति चाद्यम्\u200C ৷৷";
                    desc="भावार्थ : योगी पुरुष इस रहस्य को तत्त्व से जानकर वेदों के पढ़ने में तथा यज्ञ, तप और दानादि के करने में जो पुण्यफल कहा है, उन सबको निःसंदेह उल्लंघन कर जाता है और सनातन परम पद को प्राप्त होता है";
                }
            }else if(n==8){
                if(i==0){
                    name="इदं तु ते गुह्यतमं प्रवक्ष्याम्यनसूयवे ।\n" +
                            "ज्ञानं विज्ञानसहितं यज्ज्ञात्वा मोक्ष्यसेऽशुभात्\u200C॥";
                    desc="भावार्थ : श्री भगवान बोले- तुझ दोषदृष्टिरहित भक्त के लिए इस परम गोपनीय विज्ञान सहित ज्ञान को पुनः भली भाँति कहूँगा, जिसको जानकर तू दुःखरूप संसार से मुक्त हो जाएगा";
                }else if(i==1){
                    name="राजविद्या राजगुह्यं पवित्रमिदमुत्तमम्\u200C ।\n" +
                            "प्रत्यक्षावगमं धर्म्यं सुसुखं कर्तुमव्ययम्\u200C ॥";
                    desc="भावार्थ : यह विज्ञान सहित ज्ञान सब विद्याओं का राजा, सब गोपनीयों का राजा, अति पवित्र, अति उत्तम, प्रत्यक्ष फलवाला, धर्मयुक्त, साधन करने में बड़ा सुगम और अविनाशी है";
                }else if(i==2){
                    name="अश्रद्दधानाः पुरुषा धर्मस्यास्य परन्तप ।\n" +
                            "अप्राप्य मां निवर्तन्ते मृत्युसंसारवर्त्मनि ॥";
                    desc="भावार्थ : हे परंतप! इस उपयुक्त धर्म में श्रद्धारहित पुरुष मुझको न प्राप्त होकर मृत्युरूप संसार चक्र में भ्रमण करते रहते हैं";
                }else if(i==3){
                    name="मया ततमिदं सर्वं जगदव्यक्तमूर्तिना ।\n" +
                            "मत्स्थानि सर्वभूतानि न चाहं तेषवस्थितः ॥";
                    desc="भावार्थ : मुझ निराकार परमात्मा से यह सब जगत्\u200C जल से बर्फ के सदृश परिपूर्ण है और सब भूत मेरे अंतर्गत संकल्प के आधार स्थित हैं, किंतु वास्तव में मैं उनमें स्थित नहीं हूँ";
                }else if(i==4){
                    name="न च मत्स्थानि भूतानि पश्य मे योगमैश्वरम्\u200C ।\n" +
                            "भूतभृन्न च भूतस्थो ममात्मा भूतभावनः ॥";
                    desc="भावार्थ : वे सब भूत मुझमें स्थित नहीं हैं, किंतु मेरी ईश्वरीय योगशक्ति को देख कि भूतों का धारण-पोषण करने वाला और भूतों को उत्पन्न करने वाला भी मेरा आत्मा वास्तव में भूतों में स्थित नहीं है";
                }else if(i==5){
                    name="यथाकाशस्थितो नित्यं वायुः सर्वत्रगो महान्\u200C ।\n" +
                            "तथा सर्वाणि भूतानि मत्स्थानीत्युपधारय ॥";
                    desc="भावार्थ : जैसे आकाश से उत्पन्न सर्वत्र विचरने वाला महान्\u200C वायु सदा आकाश में ही स्थित है, वैसे ही मेरे संकल्प द्वारा उत्पन्न होने से संपूर्ण भूत मुझमें स्थित हैं, ऐसा जान";
                }else if(i==6){
                    name="सर्वभूतानि कौन्तेय प्रकृतिं यान्ति मामिकाम्\u200C ।\n" +
                            "कल्पक्षये पुनस्तानि कल्पादौ विसृजाम्यहम्\u200C ॥";
                    desc="भावार्थ : हे अर्जुन! कल्पों के अन्त में सब भूत मेरी प्रकृति को प्राप्त होते हैं अर्थात्\u200C प्रकृति में लीन होते हैं और कल्पों के आदि में उनको मैं फिर रचता हूँ";
                }else if(i==7){
                    name="प्रकृतिं स्वामवष्टभ्य विसृजामि पुनः पुनः ।\n" +
                            "भूतग्राममिमं कृत्स्नमवशं प्रकृतेर्वशात्\u200C ॥";
                    desc="भावार्थ : अपनी प्रकृति को अंगीकार करके स्वभाव के बल से परतंत्र हुए इस संपूर्ण भूतसमुदाय को बार-बार उनके कर्मों के अनुसार रचता हूँ";
                }else if(i==8){
                    name="न च मां तानि कर्माणि निबध्नन्ति धनञ्जय।\n" +
                            "उदासीनवदासीनमसक्तं तेषु कर्मसु ॥";
                    desc="भावार्थ : हे अर्जुन! उन कर्मों में आसक्तिरहित और उदासीन के सदृश (जिसके संपूर्ण कार्य कर्तृत्व भाव के बिना अपने आप सत्ता मात्र ही होते हैं उसका नाम 'उदासीन के सदृश' है।) स्थित मुझ परमात्मा को वे कर्म नहीं बाँधते";
                }else if(i==9){
                    name="मयाध्यक्षेण प्रकृतिः सूयते सचराचरं ।\n" +
                            "हेतुनानेन कौन्तेय जगद्विपरिवर्तते ॥";
                    desc="भावार्थ : हे अर्जुन! मुझ अधिष्ठाता के सकाश से प्रकृति चराचर सहित सर्वजगत को रचती है और इस हेतु से ही यह संसारचक्र घूम रहा है";
                }else if(i==10){
                    name="अवजानन्ति मां मूढा मानुषीं तनुमाश्रितम्\u200C।\n" +
                            "परं भावमजानन्तो मम भूतमहेश्वरम्\u200C ॥";
                    desc="भावार्थ : मेरे परमभाव को (गीता अध्याय 7 श्लोक 24 में देखना चाहिए) न जानने वाले मूढ़ लोग मनुष्य का शरीर धारण करने वाले मुझ संपूर्ण भूतों के महान्\u200C ईश्वर को तुच्छ समझते हैं अर्थात्\u200C अपनी योग माया से संसार के उद्धार के लिए मनुष्य रूप में विचरते हुए मुझ परमेश्वर को साधारण मनुष्य मानते हैं";
                }else if(i==11){
                    name="मोघाशा मोघकर्माणो मोघज्ञाना विचेतसः ।\n" +
                            "राक्षसीमासुरीं चैव प्रकृतिं मोहिनीं श्रिताः ॥";
                    desc="भावार्थ : वे व्यर्थ आशा, व्यर्थ कर्म और व्यर्थ ज्ञान वाले विक्षिप्तचित्त अज्ञानीजन राक्षसी, आसुरी और मोहिनी प्रकृति को (जिसको आसुरी संपदा के नाम से विस्तारपूर्वक भगवान ने गीता अध्याय 16 श्लोक 4 तथा श्लोक 7 से 21 तक में कहा है) ही धारण किए रहते हैं";
                }else if(i==12){
                    name="महात्मानस्तु मां पार्थ दैवीं प्रकृतिमाश्रिताः ।\n" +
                            "भजन्त्यनन्यमनसो ज्ञात्वा भूतादिमव्यम्\u200C ॥";
                    desc="भावार्थ : परंतु हे कुन्तीपुत्र! दैवी प्रकृति के (इसका विस्तारपूर्वक वर्णन गीता अध्याय 16 श्लोक 1 से 3 तक में देखना चाहिए) आश्रित महात्माजन मुझको सब भूतों का सनातन कारण और नाशरहित अक्षरस्वरूप जानकर अनन्य मन से युक्त होकर निरंतर भजते हैं";
                }else if(i==13){
                    name="सततं कीर्तयन्तो मां यतन्तश्च दृढ़व्रताः ।\n" +
                            "नमस्यन्तश्च मां भक्त्या नित्ययुक्ता उपासते ॥";
                    desc="भावार्थ : वे दृढ़ निश्चय वाले भक्तजन निरंतर मेरे नाम और गुणों का कीर्तन करते हुए तथा मेरी प्राप्ति के लिए यत्न करते हुए और मुझको बार-बार प्रणाम करते हुए सदा मेरे ध्यान में युक्त होकर अनन्य प्रेम से मेरी उपासना करते हैं";
                }else if(i==14){
                    name="ज्ञानयज्ञेन चाप्यन्ते यजन्तो मामुपासते।\n" +
                            "एकत्वेन पृथक्त्वेन बहुधा विश्वतोमुखम्॥";
                    desc="भावार्थ : दूसरे ज्ञानयोगी मुझ निर्गुण-निराकार ब्रह्म का ज्ञानयज्ञ द्वारा अभिन्नभाव से पूजन करते हुए भी मेरी उपासना करते हैं और दूसरे मनुष्य बहुत प्रकार से स्थित मुझ विराट स्वरूप परमेश्वर की पृथक भाव से उपासना करते हैं";
                }else if(i==15){
                    name="अहं क्रतुरहं यज्ञः स्वधाहमहमौषधम्\u200C ।\n" +
                            "मंत्रोऽहमहमेवाज्यमहमग्निरहं हुतम्\u200C ॥";
                    desc="भावार्थ : क्रतु मैं हूँ, यज्ञ मैं हूँ, स्वधा मैं हूँ, औषधि मैं हूँ, मंत्र मैं हूँ, घृत मैं हूँ, अग्नि मैं हूँ और हवनरूप क्रिया भी मैं ही हूँ";
                }else if(i==16){
                    name="पिताहमस्य जगतो माता धाता पितामहः ।\n" +
                            "वेद्यं पवित्रमोङ्कार ऋक्साम यजुरेव च ॥";
                    desc="भावार्थ : इस संपूर्ण जगत्\u200C का धाता अर्थात्\u200C धारण करने वाला एवं कर्मों के फल को देने वाला, पिता, माता, पितामह, जानने योग्य, (गीता अध्याय 13 श्लोक 12 से 17 तक में देखना चाहिए) पवित्र ओंकार तथा ऋग्वेद, सामवेद और यजुर्वेद भी मैं ही हूँ";
                }else if(i==17){
                    name="गतिर्भर्ता प्रभुः साक्षी निवासः शरणं सुहृत्\u200C ।\n" +
                            "प्रभवः प्रलयः स्थानं निधानं बीजमव्ययम्\u200C॥";
                    desc="भावार्थ : प्राप्त होने योग्य परम धाम, भरण-पोषण करने वाला, सबका स्वामी, शुभाशुभ का देखने वाला, सबका वासस्थान, शरण लेने योग्य, प्रत्युपकार न चाहकर हित करने वाला, सबकी उत्पत्ति-प्रलय का हेतु, स्थिति का आधार, निधान (प्रलयकाल में संपूर्ण भूत सूक्ष्म रूप से जिसमें लय होते हैं उसका नाम 'निधान' है) और अविनाशी कारण भी मैं ही हूँ";
                }else if(i==18){
                    name="तपाम्यहमहं वर्षं निगृह्\u200Cणाम्युत्सृजामि च ।\n" +
                            "अमृतं चैव मृत्युश्च सदसच्चाहमर्जुन ॥";
                    desc="भावार्थ : मैं ही सूर्यरूप से तपता हूँ, वर्षा का आकर्षण करता हूँ और उसे बरसाता हूँ। हे अर्जुन! मैं ही अमृत और मृत्यु हूँ और सत्\u200C-असत्\u200C भी मैं ही हूँ";
                }else if(i==19){
                    name="त्रैविद्या मां सोमपाः पूतपापायज्ञैरिष्ट्\u200Dवा स्वर्गतिं प्रार्थयन्ते।\n" +
                            "ते पुण्यमासाद्य सुरेन्द्रलोकमश्नन्ति दिव्यान्दिवि देवभोगान्\u200C ॥";
                    desc="भावार्थ : तीनों वेदों में विधान किए हुए सकाम कर्मों को करने वाले, सोम रस को पीने वाले, पापरहित पुरुष (यहाँ स्वर्ग प्राप्ति के प्रतिबंधक देव ऋणरूप पाप से पवित्र होना समझना चाहिए) मुझको यज्ञों के द्वारा पूजकर स्वर्ग की प्राप्ति चाहते हैं, वे पुरुष अपने पुण्यों के फलरूप स्वर्गलोक को प्राप्त होकर स्वर्ग में दिव्य देवताओं के भोगों को भोगते हैं";
                }else if(i==20){
                    name="ते तं भुक्त्वा स्वर्गलोकं विशालंक्षीणे पुण्य मर्त्यलोकं विशन्ति।\n" +
                            "एवं त्रयीधर्ममनुप्रपन्ना गतागतं कामकामा लभन्ते ॥";
                    desc="भावार्थ : वे उस विशाल स्वर्गलोक को भोगकर पुण्य क्षीण होने पर मृत्यु लोक को प्राप्त होते हैं। इस प्रकार स्वर्ग के साधनरूप तीनों वेदों में कहे हुए सकामकर्म का आश्रय लेने वाले और भोगों की कामना वाले पुरुष बार-बार आवागमन को प्राप्त होते हैं, अर्थात्\u200C पुण्य के प्रभाव से स्वर्ग में जाते हैं और पुण्य क्षीण होने पर मृत्युलोक में आते हैं";
                }else if(i==21){
                    name="अनन्याश्चिन्तयन्तो मां ये जनाः पर्युपासते ।\n" +
                            "तेषां नित्याभियुक्तानां योगक्षेमं वहाम्यहम्\u200C ॥";
                    desc="भावार्थ : जो अनन्यप्रेमी भक्तजन मुझ परमेश्वर को निरंतर चिंतन करते हुए निष्कामभाव से भजते हैं, उन नित्य-निरंतर मेरा चिंतन करने वाले पुरुषों का योगक्षेम (भगवत्\u200Cस्वरूप की प्राप्ति का नाम 'योग' है और भगवत्\u200Cप्राप्ति के निमित्त किए हुए साधन की रक्षा का नाम 'क्षेम' है) मैं स्वयं प्राप्त कर देता हूँ";
                }else if(i==22){
                    name="येऽप्यन्यदेवता भक्ता यजन्ते श्रद्धयान्विताः ।\n" +
                            "तेऽपि मामेव कौन्तेय यजन्त्यविधिपूर्वकम्\u200C ॥";
                    desc="भावार्थ : हे अर्जुन! यद्यपि श्रद्धा से युक्त जो सकाम भक्त दूसरे देवताओं को पूजते हैं, वे भी मुझको ही पूजते हैं, किंतु उनका वह पूजन अविधिपूर्वक अर्थात्\u200C अज्ञानपूर्वक है";
                }else if(i==23){
                    name="अहं हि सर्वयज्ञानां भोक्ता च प्रभुरेव च ।\n" +
                            "न तु मामभिजानन्ति तत्त्वेनातश्च्यवन्ति ते ॥";
                    desc="भावार्थ : क्योंकि संपूर्ण यज्ञों का भोक्ता और स्वामी भी मैं ही हूँ, परंतु वे मुझ परमेश्वर को तत्त्व से नहीं जानते, इसी से गिरते हैं अर्थात्\u200C पुनर्जन्म को प्राप्त होते हैं";
                }else if(i==24){
                    name="यान्ति देवव्रता देवान्पितृन्यान्ति पितृव्रताः ।\n" +
                            "भूतानि यान्ति भूतेज्या यान्ति मद्याजिनोऽपि माम्\u200C ॥";
                    desc="भावार्थ : देवताओं को पूजने वाले देवताओं को प्राप्त होते हैं, पितरों को पूजने वाले पितरों को प्राप्त होते हैं, भूतों को पूजने वाले भूतों को प्राप्त होते हैं और मेरा पूजन करने वाले भक्त मुझको ही प्राप्त होते हैं। इसीलिए मेरे भक्तों का पुनर्जन्म नहीं होता (गीता अध्याय 8 श्लोक 16 में देखना चाहिए)";
                }else if(i==25){
                    name="पत्रं पुष्पं फलं तोयं यो मे भक्त्या प्रयच्छति ।\n" +
                            "तदहं भक्त्युपहृतमश्नामि प्रयतात्मनः ॥";
                    desc="भावार्थ : जो कोई भक्त मेरे लिए प्रेम से पत्र, पुष्प, फल, जल आदि अर्पण करता है, उस शुद्धबुद्धि निष्काम प्रेमी भक्त का प्रेमपूर्वक अर्पण किया हुआ वह पत्र-पुष्पादि मैं सगुणरूप से प्रकट होकर प्रीतिसहित खाता हूँ";
                }else if(i==26){
                    name="यत्करोषि यदश्नासि यज्जुहोषि ददासि यत्\u200C ।\n" +
                            "यत्तपस्यसि कौन्तेय तत्कुरुष्व मदर्पणम्\u200C ॥";
                    desc="भावार्थ : हे अर्जुन! तू जो कर्म करता है, जो खाता है, जो हवन करता है, जो दान देता है और जो तप करता है, वह सब मेरे अर्पण कर";
                }else if(i==27){
                    name="शुभाशुभफलैरेवं मोक्ष्य से कर्मबंधनैः ।\n" +
                            "सन्न्यासयोगमुक्तात्मा विमुक्तो मामुपैष्यसि ॥";
                    desc="भावार्थ : इस प्रकार, जिसमें समस्त कर्म मुझ भगवान के अर्पण होते हैं- ऐसे संन्यासयोग से युक्त चित्तवाला तू शुभाशुभ फलरूप कर्मबंधन से मुक्त हो जाएगा और उनसे मुक्त होकर मुझको ही प्राप्त होगा।";
                }else if(i==28){
                    name="समोऽहं सर्वभूतेषु न मे द्वेष्योऽस्ति न प्रियः ।\n" +
                            "ये भजन्ति तु मां भक्त्या मयि ते तेषु चाप्यहम्\u200C ॥";
                    desc="भावार्थ : मैं सब भूतों में समभाव से व्यापक हूँ, न कोई मेरा अप्रिय है और न प्रिय है, परंतु जो भक्त मुझको प्रेम से भजते हैं, वे मुझमें हैं और मैं भी उनमें प्रत्यक्ष प्रकट (जैसे सूक्ष्म रूप से सब जगह व्यापक हुआ भी अग्नि साधनों द्वारा प्रकट करने से ही प्रत्यक्ष होता है, वैसे ही सब जगह स्थित हुआ भी परमेश्वर भक्ति से भजने वाले के ही अंतःकरण में प्रत्यक्ष रूप से प्रकट होता है) हूँ";
                }else if(i==29){
                    name="अपि चेत्सुदुराचारो भजते मामनन्यभाक्\u200C ।\n" +
                            "साधुरेव स मन्तव्यः सम्यग्व्यवसितो हि सः ॥";
                    desc="भावार्थ : यदि कोई अतिशय दुराचारी भी अनन्य भाव से मेरा भक्त होकर मुझको भजता है तो वह साधु ही मानने योग्य है, क्योंकि वह यथार्थ निश्चय वाला है। अर्थात्\u200C उसने भली भाँति निश्चय कर लिया है कि परमेश्वर के भजन के समान अन्य कुछ भी नहीं है";
                }else if(i==30){
                    name="क्षिप्रं भवति धर्मात्मा शश्वच्छान्तिं निगच्छति ।\n" +
                            "कौन्तेय प्रतिजानीहि न मे भक्तः प्रणश्यति ॥";
                    desc="भावार्थ : वह शीघ्र ही धर्मात्मा हो जाता है और सदा रहने वाली परम शान्ति को प्राप्त होता है। हे अर्जुन! तू निश्चयपूर्वक सत्य जान कि मेरा भक्त नष्ट नहीं होता";
                }else if(i==31){
                    name="मां हि पार्थ व्यपाश्रित्य येऽपि स्यु पापयोनयः ।\n" +
                            "स्त्रियो वैश्यास्तथा शूद्रास्तेऽपि यान्ति परां गतिम्\u200C ॥";
                    desc="भावार्थ : हे अर्जुन! स्त्री, वैश्य, शूद्र तथा पापयोनि चाण्डालादि जो कोई भी हों, वे भी मेरे शरण होकर परमगति को ही प्राप्त होते हैं";
                }else if(i==32){
                    name="किं पुनर्ब्राह्मणाः पुण्या भक्ता राजर्षयस्तथा ।\n" +
                            "अनित्यमसुखं लोकमिमं प्राप्य भजस्व माम्\u200C ॥";
                    desc="भावार्थ : फिर इसमें कहना ही क्या है, जो पुण्यशील ब्राह्मण था राजर्षि भक्तजन मेरी शरण होकर परम गति को प्राप्त होते हैं। इसलिए तू सुखरहित और क्षणभंगुर इस मनुष्य शरीर को प्राप्त होकर निरंतर मेरा ही भजन कर";
                }else if(i==33){
                    name="मन्मना भव मद्भक्तो मद्याजी मां नमस्कुरु ।\n" +
                            "मामेवैष्यसि युक्त्वैवमात्मानं मत्परायण: ॥";
                    desc="भावार्थ : मुझमें मन वाला हो, मेरा भक्त बन, मेरा पूजन करने वाला हो, मुझको प्रणाम कर। इस प्रकार आत्मा को मुझमें नियुक्त करके मेरे परायण होकर तू मुझको ही प्राप्त होगा";
                }
            }else if(n==9){
                if(i==0){
                    name="भूय एव महाबाहो श्रृणु मे परमं वचः ।\n" +
                            "यत्तेऽहं प्रीयमाणाय वक्ष्यामि हितकाम्यया ৷৷";
                    desc="भावार्थ : श्री भगवान्\u200C बोले- हे महाबाहो! फिर भी मेरे परम रहस्य और प्रभावयुक्त वचन को सुन, जिसे मैं तुझे अतिशय प्रेम रखने वाले के लिए हित की इच्छा से कहूँगा";
                }else if(i==1){
                    name="न मे विदुः सुरगणाः प्रभवं न महर्षयः ।\n" +
                            "अहमादिर्हि देवानां महर्षीणां च सर्वशः ॥";
                    desc="भावार्थ : मेरी उत्पत्ति को अर्थात्\u200C लीला से प्रकट होने को न देवता लोग जानते हैं और न महर्षिजन ही जानते हैं, क्योंकि मैं सब प्रकार से देवताओं का और महर्षियों का भी आदिकारण हूँ";
                }else if(i==2){
                    name="यो मामजमनादिं च वेत्ति लोकमहेश्वरम्\u200C ।\n" +
                            "असम्मूढः स मर्त्येषु सर्वपापैः प्रमुच्यते ॥";
                    desc="भावार्थ : जो मुझको अजन्मा अर्थात्\u200C वास्तव में जन्मरहित, अनादि (अनादि उसको कहते हैं जो आदि रहित हो एवं सबका कारण हो) और लोकों का महान्\u200C ईश्वर तत्त्व से जानता है, वह मनुष्यों में ज्ञानवान्\u200C पुरुष संपूर्ण पापों से मुक्त हो जाता है";
                }else if(i==3){
                    name="बुद्धिर्ज्ञानमसम्मोहः क्षमा सत्यं दमः शमः ।\n" +
                            "सुखं दुःखं भवोऽभावो भयं चाभयमेव च ॥";
                    desc="अहिंसा समता तुष्टिस्तपो दानं यशोऽयशः ।\n" +
                            "भवन्ति भावा भूतानां मत्त एव पृथग्विधाः ॥";
                }else if(i==4){
                    name="अहिंसा समता तुष्टिस्तपो दानं यशोऽयशः । \n" +
                            "भवन्ति भावा भूतानां मत्त एव पृथग्विधाः ॥";
                    desc="भावार्थ : निश्चय करने की शक्ति, यथार्थ ज्ञान, असम्मूढ़ता, क्षमा, सत्य, इंद्रियों का वश में करना, मन का निग्रह तथा सुख-दुःख, उत्पत्ति-प्रलय और भय-अभय तथा अहिंसा, समता, संतोष तप (स्वधर्म के आचरण से इंद्रियादि को तपाकर शुद्ध करने का नाम तप है), दान, कीर्ति और अपकीर्ति- ऐसे ये प्राणियों के नाना प्रकार के भाव मुझसे ही होते हैं";
                }else if(i==5){
                    name="महर्षयः सप्त पूर्वे चत्वारो मनवस्तथा ।\n" +
                            "मद्भावा मानसा जाता येषां लोक इमाः प्रजाः ॥";
                    desc="भावार्थ : सात महर्षिजन, चार उनसे भी पूर्व में होने वाले सनकादि तथा स्वायम्भुव आदि चौदह मनु- ये मुझमें भाव वाले सब-के-सब मेरे संकल्प से उत्पन्न हुए हैं, जिनकी संसार में यह संपूर्ण प्रजा है";
                }else if(i==6){
                    name="एतां विभूतिं योगं च मम यो वेत्ति तत्त्वतः ।\n" +
                            "सोऽविकम्पेन योगेन युज्यते नात्र संशयः ॥";
                    desc="भावार्थ : जो पुरुष मेरी इस परमैश्वर्यरूप विभूति को और योगशक्ति को तत्त्व से जानता है (जो कुछ दृश्यमात्र संसार है वह सब भगवान की माया है और एक वासुदेव भगवान ही सर्वत्र परिपूर्ण है, यह जानना ही तत्व से जानना है), वह निश्चल भक्तियोग से युक्त हो जाता है- इसमें कुछ भी संशय नहीं है";
                }else if(i==7){
                    name="अहं सर्वस्य प्रभवो मत्तः सर्वं प्रवर्तते ।\n" +
                            "इति मत्वा भजन्ते मां बुधा भावसमन्विताः ॥";
                    desc="भावार्थ : मैं वासुदेव ही संपूर्ण जगत्\u200C की उत्पत्ति का कारण हूँ और मुझसे ही सब जगत्\u200C चेष्टा करता है, इस प्रकार समझकर श्रद्धा और भक्ति से युक्त बुद्धिमान्\u200C भक्तजन मुझ परमेश्वर को ही निरंतर भजते हैं";
                }else if(i==8){
                    name="मच्चित्ता मद्गतप्राणा बोधयन्तः परस्परम्\u200C ।\n" +
                            "कथयन्तश्च मां नित्यं तुष्यन्ति च रमन्ति च ॥";
                    desc="भावार्थ : निरंतर मुझमें मन लगाने वाले और मुझमें ही प्राणों को अर्पण करने वाले (मुझ वासुदेव के लिए ही जिन्होंने अपना जीवन अर्पण कर दिया है उनका नाम मद्गतप्राणाः है।) भक्तजन मेरी भक्ति की चर्चा के द्वारा आपस में मेरे प्रभाव को जानते हुए तथा गुण और प्रभाव सहित मेरा कथन करते हुए ही निरंतर संतुष्ट होते हैं और मुझ वासुदेव में ही निरंतर रमण करते हैं";
                }else if(i==9){
                    name="तेषां सततयुक्तानां भजतां प्रीतिपूर्वकम्\u200C ।\n" +
                            "ददामि बद्धियोगं तं येन मामुपयान्ति ते ॥";
                    desc="भावार्थ : उन निरंतर मेरे ध्यान आदि में लगे हुए और प्रेमपूर्वक भजने वाले भक्तों को मैं वह तत्त्वज्ञानरूप योग देता हूँ, जिससे वे मुझको ही प्राप्त होते हैं";
                }else if(i==10){
                    name="तेषामेवानुकम्पार्थमहमज्ञानजं तमः।\n" +
                            "नाशयाम्यात्मभावस्थो ज्ञानदीपेन भास्वता ॥";
                    desc="भावार्थ : हे अर्जुन! उनके ऊपर अनुग्रह करने के लिए उनके अंतःकरण में स्थित हुआ मैं स्वयं ही उनके अज्ञानजनित अंधकार को प्रकाशमय तत्त्वज्ञानरूप दीपक के द्वारा नष्ट कर देता हूँ";
                }else if(i==11){
                    name="परं ब्रह्म परं धाम पवित्रं परमं भवान्\u200C ।\n" +
                            "पुरुषं शाश्वतं दिव्यमादिदेवमजं विभुम्\u200C ॥";
                    desc="";
                }else if(i==12){
                    name="आहुस्त्वामृषयः सर्वे देवर्षिर्नारदस्तथा ।\n" +
                            "असितो देवलो व्यासः स्वयं चैव ब्रवीषि मे ॥";
                    desc="भावार्थ : अर्जुन बोले- आप परम ब्रह्म, परम धाम और परम पवित्र हैं, क्योंकि आपको सब ऋषिगण सनातन, दिव्य पुरुष एवं देवों का भी आदिदेव, अजन्मा और सर्वव्यापी कहते हैं। वैसे ही देवर्षि नारद तथा असित और देवल ऋषि तथा महर्षि व्यास भी कहते हैं और आप भी मेरे प्रति कहते हैं";
                }else if(i==13){
                    name="सर्वमेतदृतं मन्ये यन्मां वदसि केशव ।\n" +
                            "न हि ते भगवन्व्यक्तिं विदुर्देवा न दानवाः ॥";
                    desc="भावार्थ : हे केशव! जो कुछ भी मेरे प्रति आप कहते हैं, इस सबको मैं सत्य मानता हूँ। हे भगवन्\u200C! आपके लीलामय (गीता अध्याय 4 श्लोक 6 में इसका विस्तार देखना चाहिए) स्वरूप को न तो दानव जानते हैं और न देवता ही";
                }else if(i==14){
                    name="स्वयमेवात्मनात्मानं वेत्थ त्वं पुरुषोत्तम ।\n" +
                            "भूतभावन भूतेश देवदेव जगत्पते ॥";
                    desc="भावार्थ : हे भूतों को उत्पन्न करने वाले! हे भूतों के ईश्वर! हे देवों के देव! हे जगत्\u200C के स्वामी! हे पुरुषोत्तम! आप स्वयं ही अपने से अपने को जानते हैं";
                }else if(i==15){
                    name="वक्तुमर्हस्यशेषेण दिव्या ह्यात्मविभूतयः ।\n" +
                            "याभिर्विभूतिभिर्लोकानिमांस्त्वं व्याप्य तिष्ठसि ॥";
                    desc="भावार्थ : इसलिए आप ही उन अपनी दिव्य विभूतियों को संपूर्णता से कहने में समर्थ हैं, जिन विभूतियों द्वारा आप इन सब लोकों को व्याप्त करके स्थित हैं";
                }else if(i==16){
                    name="कथं विद्यामहं योगिंस्त्वां सदा परिचिन्तयन्\u200C ।\n" +
                            "केषु केषु च भावेषु चिन्त्योऽसि भगवन्मया ॥";
                    desc="भावार्थ : हे योगेश्वर! मैं किस प्रकार निरंतर चिंतन करता हुआ आपको जानूँ और हे भगवन्\u200C! आप किन-किन भावों में मेरे द्वारा चिंतन करने योग्य हैं?";
                }else if(i==17){
                    name="विस्तरेणात्मनो योगं विभूतिं च जनार्दन ।\n" +
                            "भूयः कथय तृप्तिर्हि श्रृण्वतो नास्ति मेऽमृतम्\u200C ॥";
                    desc="भावार्थ : हे जनार्दन! अपनी योगशक्ति को और विभूति को फिर भी विस्तारपूर्वक कहिए, क्योंकि आपके अमृतमय वचनों को सुनते हुए मेरी तृप्ति नहीं होती अर्थात्\u200C सुनने की उत्कंठा बनी ही रहती है";
                }else if(i==18){
                    name="हन्त ते कथयिष्यामि दिव्या ह्यात्मविभूतयः ।\n" +
                            "प्राधान्यतः कुरुश्रेष्ठ नास्त्यन्तो विस्तरस्य मे ॥";
                    desc="भावार्थ : श्री भगवान बोले- हे कुरुश्रेष्ठ! अब मैं जो मेरी दिव्य विभूतियाँ हैं, उनको तेरे लिए प्रधानता से कहूँगा; क्योंकि मेरे विस्तार का अंत नहीं है";
                }else if(i==19){
                    name="अहमात्मा गुडाकेश सर्वभूताशयस्थितः ।\n" +
                            "अहमादिश्च मध्यं च भूतानामन्त एव च ॥";
                    desc="भावार्थ : हे अर्जुन! मैं सब भूतों के हृदय में स्थित सबका आत्मा हूँ तथा संपूर्ण भूतों का आदि, मध्य और अंत भी मैं ही हूँ";
                }else if(i==20){
                    name="आदित्यानामहं विष्णुर्ज्योतिषां रविरंशुमान्\u200C ।\n" +
                            "मरीचिर्मरुतामस्मि नक्षत्राणामहं शशी ॥";
                    desc="भावार्थ : मैं अदिति के बारह पुत्रों में विष्णु और ज्योतियों में किरणों वाला सूर्य हूँ तथा मैं उनचास वायुदेवताओं का तेज और नक्षत्रों का अधिपति चंद्रमा हूँ";
                }else if(i==21){
                    name="वेदानां सामवेदोऽस्मि देवानामस्मि वासवः ।\n" +
                            "इंद्रियाणां मनश्चास्मि भूतानामस्मि चेतना ॥";
                    desc="भावार्थ : मैं वेदों में सामवेद हूँ, देवों में इंद्र हूँ, इंद्रियों में मन हूँ और भूत प्राणियों की चेतना अर्थात्\u200C जीवन-शक्ति हूँ";
                }else if(i==22){
                    name="रुद्राणां शङ्\u200Dकरश्चास्मि वित्तेशो यक्षरक्षसाम्\u200C ।\n" +
                            "वसूनां पावकश्चास्मि मेरुः शिखरिणामहम्\u200C ॥";
                    desc="भावार्थ : मैं एकादश रुद्रों में शंकर हूँ और यक्ष तथा राक्षसों में धन का स्वामी कुबेर हूँ। मैं आठ वसुओं में अग्नि हूँ और शिखरवाले पर्वतों में सुमेरु पर्वत हूँ";
                }else if(i==23){
                    name="पुरोधसां च मुख्यं मां विद्धि पार्थ बृहस्पतिम्\u200C ।\n" +
                            "सेनानीनामहं स्कन्दः सरसामस्मि सागरः ॥";
                    desc="भावार्थ : पुरोहितों में मुखिया बृहस्पति मुझको जान। हे पार्थ! मैं सेनापतियों में स्कंद और जलाशयों में समुद्र हूँ";
                }else if(i==24){
                    name="महर्षीणां भृगुरहं गिरामस्म्येकमक्षरम्\u200C ।\n" +
                            "यज्ञानां जपयज्ञोऽस्मि स्थावराणां हिमालयः ॥";
                    desc="भावार्थ : मैं महर्षियों में भृगु और शब्दों में एक अक्षर अर्थात्\u200C\u200C ओंकार हूँ। सब प्रकार के यज्ञों में जपयज्ञ और स्थिर रहने वालों में हिमालय पहाड़ हूँ";
                }else if(i==25){
                    name="अश्वत्थः सर्ववृक्षाणां देवर्षीणां च नारदः ।\n" +
                            "गन्धर्वाणां चित्ररथः सिद्धानां कपिलो मुनिः ॥";
                    desc="भावार्थ : मैं सब वृक्षों में पीपल का वृक्ष, देवर्षियों में नारद मुनि, गन्धर्वों में चित्ररथ और सिद्धों में कपिल मुनि हूँ";
                }else if(i==26){
                    name="उच्चैःश्रवसमश्वानां विद्धि माममृतोद्धवम्\u200C ।\n" +
                            "एरावतं गजेन्द्राणां नराणां च नराधिपम्\u200C ॥";
                    desc="भावार्थ : घोड़ों में अमृत के साथ उत्पन्न होने वाला उच्चैःश्रवा नामक घोड़ा, श्रेष्ठ हाथियों में ऐरावत नामक हाथी और मनुष्यों में राजा मुझको जान";
                }else if(i==27){
                    name="आयुधानामहं वज्रं धेनूनामस्मि कामधुक्\u200C ।\n" +
                            "प्रजनश्चास्मि कन्दर्पः सर्पाणामस्मि वासुकिः ॥";
                    desc="भावार्थ : मैं शस्त्रों में वज्र और गौओं में कामधेनु हूँ। शास्त्रोक्त रीति से सन्तान की उत्पत्ति का हेतु कामदेव हूँ और सर्पों में सर्पराज वासुकि हूँ";
                }else if(i==28){
                    name="अनन्तश्चास्मि नागानां वरुणो यादसामहम्\u200C ।\n" +
                            "पितॄणामर्यमा चास्मि यमः संयमतामहम्\u200C ॥";
                    desc="भावार्थ : मैं नागों में (नाग और सर्प ये दो प्रकार की सर्पों की ही जाति है।) शेषनाग और जलचरों का अधिपति वरुण देवता हूँ और पितरों में अर्यमा नामक पितर तथा शासन करने वालों में यमराज मैं हूँ";
                }else if(i==29){
                    name="प्रह्लादश्चास्मि दैत्यानां कालः कलयतामहम्\u200C ।\n" +
                            "मृगाणां च मृगेन्द्रोऽहं वैनतेयश्च पक्षिणाम्\u200C ॥";
                    desc="भावार्थ : मैं दैत्यों में प्रह्लाद और गणना करने वालों का समय (क्षण, घड़ी, दिन, पक्ष, मास आदि में जो समय है वह मैं हूँ) हूँ तथा पशुओं में मृगराज सिंह और पक्षियों में गरुड़ हूँ";
                }else if(i==30){
                    name="पवनः पवतामस्मि रामः शस्त्रभृतामहम्\u200C ।\n" +
                            "झषाणां मकरश्चास्मि स्रोतसामस्मि जाह्नवी ॥";
                    desc="भावार्थ : मैं पवित्र करने वालों में वायु और शस्त्रधारियों में श्रीराम हूँ तथा मछलियों में मगर हूँ और नदियों में श्री भागीरथी गंगाजी हूँ";
                }else if(i==31){
                    name="सर्गाणामादिरन्तश्च मध्यं चैवाहमर्जुन ।\n" +
                            "अध्यात्मविद्या विद्यानां वादः प्रवदतामहम्\u200C ॥";
                    desc="भावार्थ : हे अर्जुन! सृष्टियों का आदि और अंत तथा मध्य भी मैं ही हूँ। मैं विद्याओं में अध्यात्मविद्या अर्थात्\u200C ब्रह्मविद्या और परस्पर विवाद करने वालों का तत्व-निर्णय के लिए किया जाने वाला वाद हूँ";
                }else if(i==32){
                    name="अक्षराणामकारोऽस्मि द्वंद्वः सामासिकस्य च ।\n" +
                            "अहमेवाक्षयः कालो धाताहं विश्वतोमुखः ॥";
                    desc="भावार्थ : मैं अक्षरों में अकार हूँ और समासों में द्वंद्व नामक समास हूँ। अक्षयकाल अर्थात्\u200C काल का भी महाकाल तथा सब ओर मुखवाला, विराट्स्वरूप, सबका धारण-पोषण करने वाला भी मैं ही हूँ";
                }else if(i==33){
                    name="मृत्युः सर्वहरश्चाहमुद्भवश्च भविष्यताम्\u200C ।\n" +
                            "कीर्तिः श्रीर्वाक्च नारीणां स्मृतिर्मेधा धृतिः क्षमा ॥";
                    desc="भावार्थ : मैं सबका नाश करने वाला मृत्यु और उत्पन्न होने वालों का उत्पत्ति हेतु हूँ तथा स्त्रियों में कीर्ति (कीर्ति आदि ये सात देवताओं की स्त्रियाँ और स्त्रीवाचक नाम वाले गुण भी प्रसिद्ध हैं, इसलिए दोनों प्रकार से ही भगवान की विभूतियाँ हैं), श्री, वाक्\u200C, स्मृति, मेधा, धृति और क्षमा हूँ";
                }else if(i==34){
                    name="बृहत्साम तथा साम्नां गायत्री छन्दसामहम्\u200C ।\n" +
                            "मासानां मार्गशीर्षोऽहमृतूनां कुसुमाकरः॥";
                    desc="भावार्थ : तथा गायन करने योग्य श्रुतियों में मैं बृहत्साम और छंदों में गायत्री छंद हूँ तथा महीनों में मार्गशीर्ष और ऋतुओं में वसंत मैं हूँ";
                }else if(i==35){
                    name="द्यूतं छलयतामस्मि तेजस्तेजस्विनामहम्\u200C ।\n" +
                            "जयोऽस्मि व्यवसायोऽस्मि सत्त्वं सत्त्ववतामहम्\u200C ॥";
                    desc="भावार्थ : मैं छल करने वालों में जूआ और प्रभावशाली पुरुषों का प्रभाव हूँ। मैं जीतने वालों का विजय हूँ, निश्चय करने वालों का निश्चय और सात्त्विक पुरुषों का सात्त्विक भाव हूँ";
                }else if(i==36){
                    name="वृष्णीनां वासुदेवोऽस्मि पाण्डवानां धनञ्जयः ।\n" +
                            "मुनीनामप्यहं व्यासः कवीनामुशना कविः ॥";
                    desc="भावार्थ : वृष्णिवंशियों में (यादवों के अंतर्गत एक वृष्णि वंश भी था) वासुदेव अर्थात्\u200C मैं स्वयं तेरा सखा, पाण्डवों में धनञ्जय अर्थात्\u200C तू, मुनियों में वेदव्यास और कवियों में शुक्राचार्य कवि भी मैं ही हूँ";
                }else if(i==37){
                    name="दण्डो दमयतामस्मि नीतिरस्मि जिगीषताम्\u200C ।\n" +
                            "मौनं चैवास्मि गुह्यानां ज्ञानं ज्ञानवतामहम्\u200C ॥";
                    desc="भावार्थ : मैं दमन करने वालों का दंड अर्थात्\u200C दमन करने की शक्ति हूँ, जीतने की इच्छावालों की नीति हूँ, गुप्त रखने योग्य भावों का रक्षक मौन हूँ और ज्ञानवानों का तत्त्वज्ञान मैं ही हूँ";
                }else if(i==38){
                    name="यच्चापि सर्वभूतानां बीजं तदहमर्जुन ।\n" +
                            "न तदस्ति विना यत्स्यान्मया भूतं चराचरम्\u200C ॥";
                    desc="भावार्थ : और हे अर्जुन! जो सब भूतों की उत्पत्ति का कारण है, वह भी मैं ही हूँ, क्योंकि ऐसा चर और अचर कोई भी भूत नहीं है, जो मुझसे रहित हो";
                }else if(i==39){
                    name="नान्तोऽस्ति मम दिव्यानां विभूतीनां परन्तप ।\n" +
                            "एष तूद्देशतः प्रोक्तो विभूतेर्विस्तरो मया ॥";
                    desc="भावार्थ : हे परंतप! मेरी दिव्य विभूतियों का अंत नहीं है, मैंने अपनी विभूतियों का यह विस्तार तो तेरे लिए एकदेश से अर्थात्\u200C संक्षेप से कहा है";
                }else if(i==40){
                    name="यद्यद्विभूतिमत्सत्त्वं श्रीमदूर्जितमेव वा ।\n" +
                            "तत्तदेवावगच्छ त्वं मम तेजोंऽशसम्भवम्\u200C ॥";
                    desc="भावार्थ : जो-जो भी विभूतियुक्त अर्थात्\u200C ऐश्वर्ययुक्त, कांतियुक्त और शक्तियुक्त वस्तु है, उस-उस को तू मेरे तेज के अंश की ही अभिव्यक्ति जान";
                }else if(i==41){
                    name="अथवा बहुनैतेन किं ज्ञातेन तवार्जुन ।\n" +
                            "विष्टभ्याहमिदं कृत्स्नमेकांशेन स्थितो जगत्\u200C ॥";
                    desc="भावार्थ : अथवा हे अर्जुन! इस बहुत जानने से तेरा क्या प्रायोजन है। मैं इस संपूर्ण जगत्\u200C को अपनी योगशक्ति के एक अंश मात्र से धारण करके स्थित हूँ";
                }
            }else if(n==10){
                if(i==0){
                    name="मदनुग्रहाय परमं गुह्यमध्यात्मसञ्ज्ञितम्\u200C ।\n" +
                            "यत्त्वयोक्तं वचस्तेन मोहोऽयं विगतो मम ॥";
                    desc="भावार्थ : अर्जुन बोले- मुझ पर अनुग्रह करने के लिए आपने जो परम गोपनीय अध्यात्म विषयक वचन अर्थात उपदेश कहा, उससे मेरा यह अज्ञान नष्ट हो गया है";
                }else if(i==1){
                    name="भवाप्ययौ हि भूतानां श्रुतौ विस्तरशो मया ।\n" +
                            "त्वतः कमलपत्राक्ष माहात्म्यमपि चाव्ययम्\u200C ॥";
                    desc="भावार्थ : क्योंकि हे कमलनेत्र! मैंने आपसे भूतों की उत्पत्ति और प्रलय विस्तारपूर्वक सुने हैं तथा आपकी अविनाशी महिमा भी सुनी है";
                }else if(i==2){
                    name="एवमेतद्यथात्थ त्वमात्मानं परमेश्वर ।\n" +
                            "द्रष्टुमिच्छामि ते रूपमैश्वरं पुरुषोत्तम ॥";
                    desc="भावार्थ : हे परमेश्वर! आप अपने को जैसा कहते हैं, यह ठीक ऐसा ही है, परन्तु हे पुरुषोत्तम! आपके ज्ञान, ऐश्वर्य, शक्ति, बल, वीर्य और तेज से युक्त ऐश्वर्य-रूप को मैं प्रत्यक्ष देखना चाहता हूँ";
                }else if(i==3){
                    name="मन्यसे यदि तच्छक्यं मया द्रष्टुमिति प्रभो ।\n" +
                            "योगेश्वर ततो मे त्वं दर्शयात्मानमव्ययम्\u200C ॥";
                    desc="भावार्थ : हे प्रभो! (उत्पत्ति, स्थिति और प्रलय तथा अन्तर्यामी रूप से शासन करने वाला होने से भगवान का नाम 'प्रभु' है) यदि मेरे द्वारा आपका वह रूप देखा जाना शक्य है- ऐसा आप मानते हैं, तो हे योगेश्वर! उस अविनाशी स्वरूप का मुझे दर्शन कराइए";
                }else if(i==4){
                    name="पश्य मे पार्थ रूपाणि शतशोऽथ सहस्रशः ।\n" +
                            "नानाविधानि दिव्यानि नानावर्णाकृतीनि च ॥";
                    desc="भावार्थ : श्री भगवान बोले- हे पार्थ! अब तू मेरे सैकड़ों-हजारों नाना प्रकार के और नाना वर्ण तथा नाना आकृतिवाले अलौकिक रूपों को देख";
                }else if(i==5){
                    name="पश्यादित्यान्वसून्रुद्रानश्विनौ मरुतस्तथा ।\n" +
                            "बहून्यदृष्टपूर्वाणि पश्याश्चर्याणि भारत ॥\n";
                    desc="भावार्थ : हे भरतवंशी अर्जुन! तू मुझमें आदित्यों को अर्थात अदिति के द्वादश पुत्रों को, आठ वसुओं को, एकादश रुद्रों को, दोनों अश्विनीकुमारों को और उनचास मरुद्गणों को देख तथा और भी बहुत से पहले न देखे हुए आश्चर्यमय रूपों को देख";
                }else if(i==6){
                    name="इहैकस्थं जगत्कृत्स्नं पश्याद्य सचराचरम्\u200C ।\n" +
                            "मम देहे गुडाकेश यच्चान्यद्द्रष्टमिच्छसि ॥";
                    desc="भावार्थ : हे अर्जुन! अब इस मेरे शरीर में एक जगह स्थित चराचर सहित सम्पूर्ण जगत को देख तथा और भी जो कुछ देखना चाहता हो सो देख";
                }else if(i==7){
                    name="न तु मां शक्यसे द्रष्टमनेनैव स्वचक्षुषा ।\n" +
                            "दिव्यं ददामि ते चक्षुः पश्य मे योगमैश्वरम्\u200C ॥";
                    desc="भावार्थ : परन्तु मुझको तू इन अपने प्राकृत नेत्रों द्वारा देखने में निःसंदेह समर्थ नहीं है, इसी से मैं तुझे दिव्य अर्थात अलौकिक चक्षु देता हूँ, इससे तू मेरी ईश्वरीय योग शक्ति को देख";
                }else if(i==8){
                    name="एवमुक्त्वा ततो राजन्महायोगेश्वरो हरिः ।\n" +
                            "दर्शयामास पार्थाय परमं रूपमैश्वरम्\u200C ॥";
                    desc="भावार्थ : संजय बोले- हे राजन्\u200C! महायोगेश्वर और सब पापों के नाश करने वाले भगवान ने इस प्रकार कहकर उसके पश्चात अर्जुन को परम ऐश्वर्ययुक्त दिव्यस्वरूप दिखलाया";
                }else if(i==9){
                    name="अनेकवक्त्रनयनमनेकाद्भुतदर्शनम्\u200C ।\n" +
                            "अनेकदिव्याभरणं दिव्यानेकोद्यतायुधम्\u200C ॥";
                    desc="";
                }else if(i==10){
                    name="दिव्यमाल्याम्बरधरं दिव्यगन्धानुलेपनम्\u200C ।\n" +
                            "सर्वाश्चर्यमयं देवमनन्तं विश्वतोमुखम्\u200C ॥";
                    desc="भावार्थ : अनेक मुख और नेत्रों से युक्त, अनेक अद्भुत दर्शनों वाले, बहुत से दिव्य भूषणों से युक्त और बहुत से दिव्य शस्त्रों को धारण किए हुए और दिव्य गंध का सारे शरीर में लेप किए हुए, सब प्रकार के आश्चर्यों से युक्त, सीमारहित और सब ओर मुख किए हुए विराट्स्वरूप परमदेव परमेश्वर को अर्जुन ने देखा";
                }else if(i==11){
                    name="दिवि सूर्यसहस्रस्य भवेद्युगपदुत्थिता ।\n" +
                            "यदि भाः सदृशी सा स्याद्भासस्तस्य महात्मनः ॥";
                    desc="भावार्थ : आकाश में हजार सूर्यों के एक साथ उदय होने से उत्पन्न जो प्रकाश हो, वह भी उस विश्व रूप परमात्मा के प्रकाश के सदृश कदाचित्\u200C ही हो";
                }else if(i==12){
                    name="तत्रैकस्थं जगत्कृत्स्नं प्रविभक्तमनेकधा ।\n" +
                            "अपश्यद्देवदेवस्य शरीरे पाण्डवस्तदा ॥";
                    desc="भावार्थ : पाण्डुपुत्र अर्जुन ने उस समय अनेक प्रकार से विभक्त अर्थात पृथक-पृथक सम्पूर्ण जगत को देवों के देव श्रीकृष्ण भगवान के उस शरीर में एक जगह स्थित देखा";
                }else if(i==13){
                    name="ततः स विस्मयाविष्टो हृष्टरोमा धनञ्जयः ।\n" +
                            "प्रणम्य शिरसा देवं कृताञ्जलिरभाषत ॥";
                    desc="भावार्थ : उसके अनंतर आश्चर्य से चकित और पुलकित शरीर अर्जुन प्रकाशमय विश्वरूप परमात्मा को श्रद्धा-भक्ति सहित सिर से प्रणाम करके हाथ जोड़कर बोले";
                }else if(i==14){
                    name="पश्यामि देवांस्तव देव देहे सर्वांस्तथा भूतविशेषसङ्\u200Dघान्\u200C ।\n" +
                            "ब्रह्माणमीशं कमलासनस्थमृषींश्च सर्वानुरगांश्च दिव्यान्\u200C ॥";
                    desc="भावार्थ : अर्जुन बोले- हे देव! मैं आपके शरीर में सम्पूर्ण देवों को तथा अनेक भूतों के समुदायों को, कमल के आसन पर विराजित ब्रह्मा को, महादेव को और सम्पूर्ण ऋषियों को तथा दिव्य सर्पों को देखता हूँ";
                }else if(i==15){
                    name="अनेकबाहूदरवक्त्रनेत्रंपश्यामि त्वां सर्वतोऽनन्तरूपम्\u200C ।\n" +
                            "नान्तं न मध्यं न पुनस्तवादिंपश्यामि विश्वेश्वर विश्वरूप ॥";
                    desc="भावार्थ : हे सम्पूर्ण विश्व के स्वामिन्! आपको अनेक भुजा, पेट, मुख और नेत्रों से युक्त तथा सब ओर से अनन्त रूपों वाला देखता हूँ। हे विश्वरूप! मैं आपके न अन्त को देखता हूँ, न मध्य को और न आदि को ही";
                }else if(i==16){
                    name="किरीटिनं गदिनं चक्रिणं च तेजोराशिं सर्वतो दीप्तिमन्तम्\u200C ।\n" +
                            "पश्यामि त्वां दुर्निरीक्ष्यं समन्ताद्दीप्तानलार्कद्युतिमप्रमेयम्\u200C ॥";
                    desc="भावार्थ : आपको मैं मुकुटयुक्त, गदायुक्त और चक्रयुक्त तथा सब ओर से प्रकाशमान तेज के पुंज, प्रज्वलित अग्नि और सूर्य के सदृश ज्योतियुक्त, कठिनता से देखे जाने योग्य और सब ओर से अप्रमेयस्वरूप देखता हूँ";
                }else if(i==17){
                    name="त्वमक्षरं परमं वेदितव्यंत्वमस्य विश्वस्य परं निधानम्\u200C ।\n" +
                            "त्वमव्ययः शाश्वतधर्मगोप्ता सनातनस्त्वं पुरुषो मतो मे ॥";
                    desc="भावार्थ : आप ही जानने योग्य परम अक्षर अर्थात परब्रह्म परमात्मा हैं। आप ही इस जगत के परम आश्रय हैं, आप ही अनादि धर्म के रक्षक हैं और आप ही अविनाशी सनातन पुरुष हैं। ऐसा मेरा मत है";
                }else if(i==18){
                    name="अनादिमध्यान्तमनन्तवीर्यमनन्तबाहुं शशिसूर्यनेत्रम्\u200C ।\n" +
                            "पश्यामि त्वां दीप्तहुताशवक्त्रंस्वतेजसा विश्वमिदं तपन्तम्\u200C ॥";
                    desc="भावार्थ : आपको आदि, अंत और मध्य से रहित, अनन्त सामर्थ्य से युक्त, अनन्त भुजावाले, चन्द्र-सूर्य रूप नेत्रों वाले, प्रज्वलित अग्निरूप मुखवाले और अपने तेज से इस जगत को संतृप्त करते हुए देखता हूँ";
                }else if(i==19){
                    name="द्यावापृथिव्योरिदमन्तरं हि व्याप्तं त्वयैकेन दिशश्च सर्वाः ।\n" +
                            "दृष्ट्वाद्भुतं रूपमुग्रं तवेदंलोकत्रयं प्रव्यथितं महात्मन्\u200C ॥";
                    desc="भावार्थ : हे महात्मन्\u200C! यह स्वर्ग और पृथ्वी के बीच का सम्पूर्ण आकाश तथा सब दिशाएँ एक आपसे ही परिपूर्ण हैं तथा आपके इस अलौकिक और भयंकर रूप को देखकर तीनों लोक अतिव्यथा को प्राप्त हो रहे हैं";
                }else if(i==20){
                    name="अमी हि त्वां सुरसङ्\u200Dघा विशन्ति केचिद्भीताः प्राञ्जलयो गृणन्ति।\n" +
                            "स्वस्तीत्युक्त्वा महर्षिसिद्धसङ्\u200Dघा: स्तुवन्ति त्वां स्तुतिभिः पुष्कलाभिः ॥";
                    desc="भावार्थ : वे ही देवताओं के समूह आप में प्रवेश करते हैं और कुछ भयभीत होकर हाथ जोड़े आपके नाम और गुणों का उच्चारण करते हैं तथा महर्षि और सिद्धों के समुदाय 'कल्याण हो' ऐसा कहकर उत्तम-उत्तम स्तोत्रों द्वारा आपकी स्तुति करते हैं";
                }else if(i==21){
                    name="रुद्रादित्या वसवो ये च साध्याविश्वेऽश्विनौ मरुतश्चोष्मपाश्च ।\n" +
                            "गंधर्वयक्षासुरसिद्धसङ्\u200Dघावीक्षन्ते त्वां विस्मिताश्चैव सर्वे ॥";
                    desc="भावार्थ : जो ग्यारह रुद्र और बारह आदित्य तथा आठ वसु, साध्यगण, विश्वेदेव, अश्विनीकुमार तथा मरुद्गण और पितरों का समुदाय तथा गंधर्व, यक्ष, राक्षस और सिद्धों के समुदाय हैं- वे सब ही विस्मित होकर आपको देखते हैं";
                }else if(i==22){
                    name="रूपं महत्ते बहुवक्त्रनेत्रंमहाबाहो बहुबाहूरूपादम्\u200C ।\n" +
                            "बहूदरं बहुदंष्ट्राकरालंदृष्टवा लोकाः प्रव्यथितास्तथाहम्\u200C ॥";
                    desc="भावार्थ : हे महाबाहो! आपके बहुत मुख और नेत्रों वाले, बहुत हाथ, जंघा और पैरों वाले, बहुत उदरों वाले और बहुत-सी दाढ़ों के कारण अत्यन्त विकराल महान रूप को देखकर सब लोग व्याकुल हो रहे हैं तथा मैं भी व्याकुल हो रहा हूँ";
                }else if(i==23){
                    name="नभःस्पृशं दीप्तमनेकवर्णंव्यात्ताननं दीप्तविशालनेत्रम्\u200C ।\n" +
                            "दृष्टवा हि त्वां प्रव्यथितान्तरात्मा धृतिं न विन्दामि शमं च विष्णो ॥";
                    desc="भावार्थ : क्योंकि हे विष्णो! आकाश को स्पर्श करने वाले, दैदीप्यमान, अनेक वर्णों से युक्त तथा फैलाए हुए मुख और प्रकाशमान विशाल नेत्रों से युक्त आपको देखकर भयभीत अन्तःकरण वाला मैं धीरज और शान्ति नहीं पाता हूँ";
                }else if(i==24){
                    name="दंष्ट्राकरालानि च ते मुखानिदृष्टैव कालानलसन्निभानि ।\n" +
                            "दिशो न जाने न लभे च शर्म प्रसीद देवेश जगन्निवास ॥";
                    desc="भावार्थ : दाढ़ों के कारण विकराल और प्रलयकाल की अग्नि के समान प्रज्वलित आपके मुखों को देखकर मैं दिशाओं को नहीं जानता हूँ और सुख भी नहीं पाता हूँ। इसलिए हे देवेश! हे जगन्निवास! आप प्रसन्न हों";
                }else if(i==25){
                    name="अमी च त्वां धृतराष्ट्रस्य पुत्राः सर्वे सहैवावनिपालसंघैः ।\n" +
                            "भीष्मो द्रोणः सूतपुत्रस्तथासौ सहास्मदीयैरपि योधमुख्यैः ॥";
                    desc="";
                }else if(i==26){
                    name="वक्त्राणि ते त्वरमाणा विशन्ति दंष्ट्राकरालानि भयानकानि ।\n" +
                            "केचिद्विलग्ना दशनान्तरेषु सन्दृश्यन्ते चूर्णितैरुत्तमाङ्\u200Dगै ॥";
                    desc="भावार्थ : वे सभी धृतराष्ट्र के पुत्र राजाओं के समुदाय सहित आप में प्रवेश कर रहे हैं और भीष्म पितामह, द्रोणाचार्य तथा वह कर्ण और हमारे पक्ष के भी प्रधान योद्धाओं के सहित सबके सब आपके दाढ़ों के कारण विकराल भयानक मुखों में बड़े वेग से दौड़ते हुए प्रवेश कर रहे हैं और कई एक चूर्ण हुए सिरों सहित आपके दाँतों के बीच में लगे हुए दिख रहे हैं";
                }else if(i==27){
                    name="यथा नदीनां बहवोऽम्बुवेगाः समुद्रमेवाभिमुखा द्रवन्ति ।\n" +
                            "तथा तवामी नरलोकवीराविशन्ति वक्त्राण्यभिविज्वलन्ति ॥";
                    desc="भावार्थ : जैसे नदियों के बहुत-से जल के प्रवाह स्वाभाविक ही समुद्र के ही सम्मुख दौड़ते हैं अर्थात समुद्र में प्रवेश करते हैं, वैसे ही वे नरलोक के वीर भी आपके प्रज्वलित मुखों में प्रवेश कर रहे हैं";
                }else if(i==28){
                    name="यथा प्रदीप्तं ज्वलनं पतंगाविशन्ति नाशाय समृद्धवेगाः ।\n" +
                            "तथैव नाशाय विशन्ति लोकास्तवापि वक्त्राणि समृद्धवेगाः ॥";
                    desc="भावार्थ : जैसे पतंग मोहवश नष्ट होने के लिए प्रज्वलित अग्नि में अतिवेग से दौड़ते हुए प्रवेश करते हैं, वैसे ही ये सब लोग भी अपने नाश के लिए आपके मुखों में अतिवेग से दौड़ते हुए प्रवेश कर रहे हैं";
                }else if(i==29){
                    name="लेलिह्यसे ग्रसमानः समन्ताल्लोकान्समग्रान्वदनैर्ज्वलद्भिः ।\n" +
                            "तेजोभिरापूर्य जगत्समग्रंभासस्तवोग्राः प्रतपन्ति विष्णो ॥";
                    desc="भावार्थ : आप उन सम्पूर्ण लोकों को प्रज्वलित मुखों द्वारा ग्रास करते हुए सब ओर से बार-बार चाट रहे हैं। हे विष्णो! आपका उग्र प्रकाश सम्पूर्ण जगत को तेज द्वारा परिपूर्ण करके तपा रहा है";
                }else if(i==30){
                    name="आख्याहि मे को भवानुग्ररूपोनमोऽस्तु ते देववर प्रसीद ।\n" +
                            "विज्ञातुमिच्छामि भवन्तमाद्यंन हि प्रजानामि तव प्रवृत्तिम्\u200C ॥";
                    desc="भावार्थ : मुझे बतलाइए कि आप उग्ररूप वाले कौन हैं? हे देवों में श्रेष्ठ! आपको नमस्कार हो। आप प्रसन्न होइए। आदि पुरुष आपको मैं विशेष रूप से जानना चाहता हूँ क्योंकि मैं आपकी प्रवृत्ति को नहीं जानता";
                }else if(i==31){
                    name="कालोऽस्मि लोकक्षयकृत्प्रवृद्धोलोकान्समाहर्तुमिह प्रवृत्तः ।\n" +
                            "ऋतेऽपि त्वां न भविष्यन्ति सर्वे येऽवस्थिताः प्रत्यनीकेषु योधाः ॥";
                    desc="भावार्थ : श्री भगवान बोले- मैं लोकों का नाश करने वाला बढ़ा हुआ महाकाल हूँ। इस समय इन लोकों को नष्ट करने के लिए प्रवृत्त हुआ हूँ। इसलिए जो प्रतिपक्षियों की सेना में स्थित योद्धा लोग हैं, वे सब तेरे बिना भी नहीं रहेंगे अर्थात तेरे युद्ध न करने पर भी इन सबका नाश हो जाएगा";
                }else if(i==32){
                    name="तस्मात्त्वमुक्तिष्ठ यशो लभस्व जित्वा शत्रून्भुङ्\u200Dक्ष्व राज्यं समृद्धम्\u200C ।\n" +
                            "मयैवैते निहताः पूर्वमेव निमित्तमात्रं भव सव्यसाचिन्\u200C ॥";
                    desc="भावार्थ : अतएव तू उठ! यश प्राप्त कर और शत्रुओं को जीतकर धन-धान्य से सम्पन्न राज्य को भोग। ये सब शूरवीर पहले ही से मेरे ही द्वारा मारे हुए हैं। हे सव्यसाचिन! (बाएँ हाथ से भी बाण चलाने का अभ्यास होने से अर्जुन का नाम 'सव्यसाची' हुआ था) तू तो केवल निमित्तमात्र बन जा";
                }else if(i==33){
                    name="द्रोणं च भीष्मं च जयद्रथं च कर्णं तथान्यानपि योधवीरान्\u200C ।\n" +
                            "मया हतांस्त्वं जहि मा व्यथिष्ठायुध्यस्व जेतासि रणे सपत्नान्\u200C ॥";
                    desc="भावार्थ : द्रोणाचार्य और भीष्म पितामह तथा जयद्रथ और कर्ण तथा और भी बहुत से मेरे द्वारा मारे हुए शूरवीर योद्धाओं को तू मार। भय मत कर। निःसंदेह तू युद्ध में वैरियों को जीतेगा। इसलिए युद्ध कर";
                }else if(i==34){
                    name="एतच्छ्रुत्वा वचनं केशवस्य कृतांजलिर्वेपमानः किरीटी ।\n" +
                            "नमस्कृत्वा भूय एवाह कृष्णंसगद्गदं भीतभीतः प्रणम्य ॥";
                    desc="भावार्थ : संजय बोले- केशव भगवान के इस वचन को सुनकर मुकुटधारी अर्जुन हाथ जोड़कर काँपते हुए नमस्कार करके, फिर भी अत्यन्त भयभीत होकर प्रणाम करके भगवान श्रीकृष्ण के प्रति गद्\u200Dगद्\u200D वाणी से बोले";
                }else if(i==35){
                    name="स्थाने हृषीकेश तव प्रकीर्त्या जगत्प्रहृष्यत्यनुरज्यते च ।\n" +
                            "रक्षांसि भीतानि दिशो द्रवन्ति सर्वे नमस्यन्ति च सिद्धसङ्\u200Dघा: ॥";
                    desc="भावार्थ : अर्जुन बोले- हे अन्तर्यामिन्! यह योग्य ही है कि आपके नाम, गुण और प्रभाव के कीर्तन से जगत अति हर्षित हो रहा है और अनुराग को भी प्राप्त हो रहा है तथा भयभीत राक्षस लोग दिशाओं में भाग रहे हैं और सब सिद्धगणों के समुदाय नमस्कार कर रहे हैं";
                }else if(i==36){
                    name="कस्माच्च ते न नमेरन्महात्मन्\u200C गरीयसे ब्रह्मणोऽप्यादिकर्त्रे।\n" +
                            "अनन्त देवेश जगन्निवास त्वमक्षरं सदसत्तत्परं यत्\u200C ॥";
                    desc="भावार्थ : हे महात्मन्\u200C! ब्रह्मा के भी आदिकर्ता और सबसे बड़े आपके लिए वे कैसे नमस्कार न करें क्योंकि हे अनन्त! हे देवेश! हे जगन्निवास! जो सत्\u200C, असत्\u200C और उनसे परे अक्षर अर्थात सच्चिदानन्दघन ब्रह्म है, वह आप ही हैं॥";
                }else if(i==37){
                    name="त्वमादिदेवः पुरुषः पुराणस्त्वमस्य विश्वस्य परं निधानम्\u200C ।\n" +
                            "वेत्तासि वेद्यं च परं च धाम त्वया ततं विश्वमनन्तरूप । ।";
                    desc="भावार्थ : आप आदिदेव और सनातन पुरुष हैं, आप इन जगत के परम आश्रय और जानने वाले तथा जानने योग्य और परम धाम हैं। हे अनन्तरूप! आपसे यह सब जगत व्याप्त अर्थात परिपूर्ण हैं";
                }else if(i==38){
                    name="वायुर्यमोऽग्निर्वरुणः शशाङ्\u200Dक: प्रजापतिस्त्वं प्रपितामहश्च।\n" +
                            "नमो नमस्तेऽस्तु सहस्रकृत्वः पुनश्च भूयोऽपि नमो नमस्ते ॥";
                    desc="भावार्थ : आप वायु, यमराज, अग्नि, वरुण, चन्द्रमा, प्रजा के स्वामी ब्रह्मा और ब्रह्मा के भी पिता हैं। आपके लिए हजारों बार नमस्कार! नमस्कार हो!! आपके लिए फिर भी बार-बार नमस्कार! नमस्कार!!";
                }else if(i==39){
                    name="नमः पुरस्तादथ पृष्ठतस्ते नमोऽस्तु ते सर्वत एव सर्व। \n" +
                            "अनन्तवीर्यामितविक्रमस्त्वंसर्वं समाप्नोषि ततोऽसि सर्वः ॥";
                    desc="भावार्थ : हे अनन्त सामर्थ्यवाले! आपके लिए आगे से और पीछे से भी नमस्कार! हे सर्वात्मन्\u200C! आपके लिए सब ओर से ही नमस्कार हो, क्योंकि अनन्त पराक्रमशाली आप समस्त संसार को व्याप्त किए हुए हैं, इससे आप ही सर्वरूप हैं";
                }else if(i==40){
                    name="सखेति मत्वा प्रसभं यदुक्तं हे कृष्ण हे यादव हे सखेति।\n" +
                            "अजानता महिमानं तवेदंमया प्रमादात्प्रणयेन वापि ॥";
                    desc="";
                }else if(i==41){
                    name="यच्चावहासार्थमसत्कृतोऽसि विहारशय्यासनभोजनेषु ।\n" +
                            "एकोऽथवाप्यच्युत तत्समक्षंतत्क्षामये त्वामहमप्रमेयम्\u200C ॥";
                    desc="भावार्थ : आपके इस प्रभाव को न जानते हुए, आप मेरे सखा हैं ऐसा मानकर प्रेम से अथवा प्रमाद से भी मैंने 'हे कृष्ण!', 'हे यादव !' 'हे सखे!' इस प्रकार जो कुछ बिना सोचे-समझे हठात्\u200C कहा है और हे अच्युत! आप जो मेरे द्वारा विनोद के लिए विहार, शय्या, आसन और भोजनादि में अकेले अथवा उन सखाओं के सामने भी अपमानित किए गए हैं- वह सब अपराध अप्रमेयस्वरूप अर्थात अचिन्त्य प्रभाव वाले आपसे मैं क्षमा करवाता हूँ";
                }else if(i==42){
                    name="पितासि लोकस्य चराचरस्य त्वमस्य पूज्यश्च गुरुर्गरीयान्\u200C।\n" +
                            "न त्वत्समोऽस्त्यभ्यधिकः कुतोऽन्योलोकत्रयेऽप्यप्रतिमप्रभाव ॥";
                    desc="भावार्थ : आप इस चराचर जगत के पिता और सबसे बड़े गुरु एवं अति पूजनीय हैं। हे अनुपम प्रभाववाले! तीनों लोकों में आपके समान भी दूसरा कोई नहीं हैं, फिर अधिक तो कैसे हो सकता है";
                }else if(i==43){
                    name="तस्मात्प्रणम्य प्रणिधाय कायंप्रसादये त्वामहमीशमीड्यम्\u200C।\n" +
                            "पितेव पुत्रस्य सखेव सख्युः प्रियः प्रियायार्हसि देव सोढुम्\u200C॥";
                    desc="भावार्थ : अतएव हे प्रभो! मैं शरीर को भलीभाँति चरणों में निवेदित कर, प्रणाम करके, स्तुति करने योग्य आप ईश्वर को प्रसन्न होने के लिए प्रार्थना करता हूँ। हे देव! पिता जैसे पुत्र के, सखा जैसे सखा के और पति जैसे प्रियतमा पत्नी के अपराध सहन करते हैं- वैसे ही आप भी मेरे अपराध को सहन करने योग्य हैं";
                }else if(i==44){
                    name="अदृष्टपूर्वं हृषितोऽस्मि दृष्ट्वा भयेन च प्रव्यथितं मनो मे।\n" +
                            "तदेव मे दर्शय देवरूपंप्रसीद देवेश जगन्निवास ॥";
                    desc="भावार्थ : मैं पहले न देखे हुए आपके इस आश्चर्यमय रूप को देखकर हर्षित हो रहा हूँ और मेरा मन भय से अति व्याकुल भी हो रहा है, इसलिए आप उस अपने चतुर्भुज विष्णु रूप को ही मुझे दिखलाइए। हे देवेश! हे जगन्निवास! प्रसन्न होइए";
                }else if(i==45){
                    name="किरीटिनं गदिनं चक्रहस्तमिच्छामि त्वां द्रष्टुमहं तथैव।\n" +
                            "तेनैव रूपेण चतुर्भुजेनसहस्रबाहो भव विश्वमूर्ते॥";
                    desc="भावार्थ : मैं वैसे ही आपको मुकुट धारण किए हुए तथा गदा और चक्र हाथ में लिए हुए देखना चाहता हूँ। इसलिए हे विश्वस्वरूप! हे सहस्रबाहो! आप उसी चतुर्भुज रूप से प्रकट होइए";
                }else if(i==46){
                    name="मया प्रसन्नेन तवार्जुनेदंरूपं परं दर्शितमात्मयोगात्\u200C ।\n" +
                            "तेजोमयं विश्वमनन्तमाद्यंयन्मे त्वदन्येन न दृष्टपूर्वम्\u200C ॥";
                    desc="भावार्थ : श्री भगवान बोले- हे अर्जुन! अनुग्रहपूर्वक मैंने अपनी योगशक्ति के प्रभाव से यह मेरे परम तेजोमय, सबका आदि और सीमारहित विराट् रूप तुझको दिखाया है, जिसे तेरे अतिरिक्त दूसरे किसी ने पहले नहीं देखा था";
                }else if(i==47){
                    name="न वेदयज्ञाध्ययनैर्न दानैर्न च क्रियाभिर्न तपोभिरुग्रैः।\n" +
                            "एवं रूपः शक्य अहं नृलोके द्रष्टुं त्वदन्येन कुरुप्रवीर ॥";
                    desc="भावार्थ : हे अर्जुन! मनुष्य लोक में इस प्रकार विश्व रूप वाला मैं न वेद और यज्ञों के अध्ययन से, न दान से, न क्रियाओं से और न उग्र तपों से ही तेरे अतिरिक्त दूसरे द्वारा देखा जा सकता हूँ";
                }else if(i==48){
                    name="मा ते व्यथा मा च विमूढभावोदृष्ट्वा रूपं घोरमीदृङ्\u200Dममेदम्\u200C।\n" +
                            "व्यतेपभीः प्रीतमनाः पुनस्त्वंतदेव मे रूपमिदं प्रपश्य ॥";
                    desc="भावार्थ : मेरे इस प्रकार के इस विकराल रूप को देखकर तुझको व्याकुलता नहीं होनी चाहिए और मूढ़भाव भी नहीं होना चाहिए। तू भयरहित और प्रीतियुक्त मनवाला होकर उसी मेरे इस शंख-चक्र-गदा-पद्मयुक्त चतुर्भुज रूप को फिर देख";
                }else if(i==49){
                    name="इत्यर्जुनं वासुदेवस्तथोक्त्वा स्वकं रूपं दर्शयामास भूयः ।\n" +
                            "आश्वासयामास च भीतमेनंभूत्वा पुनः सौम्यवपुर्महात्मा ॥";
                    desc="भावार्थ : संजय बोले- वासुदेव भगवान ने अर्जुन के प्रति इस प्रकार कहकर फिर वैसे ही अपने चतुर्भुज रूप को दिखाया और फिर महात्मा श्रीकृष्ण ने सौम्यमूर्ति होकर इस भयभीत अर्जुन को धीरज दिया";
                }else if(i==50){
                    name="दृष्ट्वेदं मानुषं रूपं तव सौम्यं जनार्दन।\n" +
                            "इदानीमस्मि संवृत्तः सचेताः प्रकृतिं गतः॥";
                    desc="भावार्थ : अर्जुन बोले- हे जनार्दन! आपके इस अतिशांत मनुष्य रूप को देखकर अब मैं स्थिरचित्त हो गया हूँ और अपनी स्वाभाविक स्थिति को प्राप्त हो गया हूँ";
                }else if(i==51){
                    name="सुदुर्दर्शमिदं रूपं दृष्टवानसि यन्मम।\n" +
                            "देवा अप्यस्य रूपस्य नित्यं दर्शनकाङ्\u200Dक्षिणः॥";
                    desc="भावार्थ : श्री भगवान बोले- मेरा जो चतुर्भज रूप तुमने देखा है, वह सुदुर्दर्श है अर्थात्\u200C इसके दर्शन बड़े ही दुर्लभ हैं। देवता भी सदा इस रूप के दर्शन की आकांक्षा करते रहते हैं";
                }else if(i==52){
                    name="नाहं वेदैर्न तपसा न दानेन न चेज्यया।\n" +
                            "शक्य एवं विधो द्रष्टुं दृष्ट्वानसि मां यथा ॥";
                    desc="भावार्थ : जिस प्रकार तुमने मुझको देखा है- इस प्रकार चतुर्भुज रूप वाला मैं न वेदों से, न तप से, न दान से और न यज्ञ से ही देखा जा सकता हूँ";
                }else if(i==53){
                    name="भक्त्या त्वनन्यया शक्य अहमेवंविधोऽर्जुन ।\n" +
                            "ज्ञातुं द्रष्टुं च तत्वेन प्रवेष्टुं च परन्तप ॥";
                    desc="भावार्थ : परन्तु हे परंतप अर्जुन! अनन्य भक्ति (अनन्यभक्ति का भाव अगले श्लोक में विस्तारपूर्वक कहा है।) के द्वारा इस प्रकार चतुर्भुज रूपवाला मैं प्रत्यक्ष देखने के लिए, तत्व से जानने के लिए तथा प्रवेश करने के लिए अर्थात एकीभाव से प्राप्त होने के लिए भी शक्य हूँ";
                }else if(i==54){
                    name="मत्कर्मकृन्मत्परमो मद्भक्तः सङ्\u200Dगवर्जितः ।\n" +
                            "निर्वैरः सर्वभूतेषु यः स मामेति पाण्डव ॥";
                    desc="भावार्थ : हे अर्जुन! जो पुरुष केवल मेरे ही लिए सम्पूर्ण कर्तव्य कर्मों को करने वाला है, मेरे परायण है, मेरा भक्त है, आसक्तिरहित है और सम्पूर्ण भूतप्राणियों में वैरभाव से रहित है (सर्वत्र भगवद्बुद्धि हो जाने से उस पुरुष का अति अपराध करने वाले में भी वैरभाव नहीं होता है, फिर औरों में तो कहना ही क्या है), वह अनन्यभक्तियुक्त पुरुष मुझको ही प्राप्त होता है";
                }
            }else if(n==11){
                if(i==0){
                    name="एवं सततयुक्ता ये भक्तास्त्वां पर्युपासते ।\n" +
                            "ये चाप्यक्षरमव्यक्तं तेषां के योगवित्तमाः ॥";
                    desc="भावार्थ : अर्जुन बोले- जो अनन्य प्रेमी भक्तजन पूर्वोक्त प्रकार से निरन्तर आपके भजन-ध्यान में लगे रहकर आप सगुण रूप परमेश्वर को और दूसरे जो केवल अविनाशी सच्चिदानन्दघन निराकार ब्रह्म को ही अतिश्रेष्ठ भाव से भजते हैं- उन दोनों प्रकार के उपासकों में अति उत्तम योगवेत्ता कौन हैं?";
                }else if(i==1){
                    name="मय्यावेश्य मनो ये मां नित्ययुक्ता उपासते ।\n" +
                            "श्रद्धया परयोपेतास्ते मे युक्ततमा मताः ॥";
                    desc="भावार्थ : श्री भगवान बोले- मुझमें मन को एकाग्र करके निरंतर मेरे भजन-ध्यान में लगे हुए (अर्थात गीता अध्याय 11 श्लोक 55 में लिखे हुए प्रकार से निरन्तर मेरे में लगे हुए) जो भक्तजन अतिशय श्रेष्ठ श्रद्धा से युक्त होकर मुझ सगुणरूप परमेश्वर को भजते हैं, वे मुझको योगियों में अति उत्तम योगी मान्य हैं";
                }else if(i==2){
                    name="ये त्वक्षरमनिर्देश्यमव्यक्तं पर्युपासते।\n" +
                            "सर्वत्रगमचिन्त्यं च कूटस्थमचलं ध्रुवम्\u200C ॥";
                    desc="";
                }else if(i==3){
                    name="सन्नियम्येन्द्रियग्रामं सर्वत्र समबुद्धयः ।\n" +
                            "ते प्राप्नुवन्ति मामेव सर्वभूतहिते रताः ॥";
                    desc="भावार्थ : परन्तु जो पुरुष इन्द्रियों के समुदाय को भली प्रकार वश में करके मन-बुद्धि से परे, सर्वव्यापी, अकथनीय स्वरूप और सदा एकरस रहने वाले, नित्य, अचल, निराकार, अविनाशी, सच्चिदानन्दघन ब्रह्म को निरन्तर एकीभाव से ध्यान करते हुए भजते हैं, वे सम्पूर्ण भूतों के हित में रत और सबमें समान भाववाले योगी मुझको ही प्राप्त होते हैं";
                }else if(i==4){
                    name="क्लेशोऽधिकतरस्तेषामव्यक्तासक्तचेतसाम्\u200C ।\n" +
                            "अव्यक्ता हि गतिर्दुःखं देहवद्भिरवाप्यते ॥";
                    desc="भावार्थ : उन सच्चिदानन्दघन निराकार ब्रह्म में आसक्त चित्तवाले पुरुषों के साधन में परिश्रम विशेष है क्योंकि देहाभिमानियों द्वारा अव्यक्तविषयक गति दुःखपूर्वक प्राप्त की जाती है";
                }else if(i==5){
                    name="ये तु सर्वाणि कर्माणि मयि सन्नयस्य मत्पराः ।\n" +
                            "अनन्येनैव योगेन मां ध्यायन्त उपासते ॥";
                    desc="भावार्थ : परन्तु जो मेरे परायण रहने वाले भक्तजन सम्पूर्ण कर्मों को मुझमें अर्पण करके मुझ सगुणरूप परमेश्वर को ही अनन्य भक्तियोग से निरन्तर चिन्तन करते हुए भजते हैं। (इस श्लोक का विशेष भाव जानने के लिए गीता अध्याय 11 श्लोक 55 देखना चाहिए)";
                }else if(i==6){
                    name="तेषामहं समुद्धर्ता मृत्युसंसारसागरात्\u200C ।\n" +
                            "भवामि नचिरात्पार्थ मय्यावेशितचेतसाम्\u200C ॥";
                    desc="भावार्थ : हे अर्जुन! उन मुझमें चित्त लगाने वाले प्रेमी भक्तों का मैं शीघ्र ही मृत्यु रूप संसार-समुद्र से उद्धार करने वाला होता हूँ";
                }else if(i==7){
                    name="मय्येव मन आधत्स्व मयि बुद्धिं निवेशय ।\n" +
                            "निवसिष्यसि मय्येव अत ऊर्ध्वं न संशयः ॥";
                    desc="भावार्थ : मुझमें मन को लगा और मुझमें ही बुद्धि को लगा, इसके उपरान्त तू मुझमें ही निवास करेगा, इसमें कुछ भी संशय नहीं है";
                }else if(i==8){
                    name="अथ चित्तं समाधातुं न शक्रोषि मयि स्थिरम्\u200C ।\n" +
                            "अभ्यासयोगेन ततो मामिच्छाप्तुं धनञ्जय ॥";
                    desc="भावार्थ : यदि तू मन को मुझमें अचल स्थापन करने के लिए समर्थ नहीं है, तो हे अर्जुन! अभ्यासरूप (भगवान के नाम और गुणों का श्रवण, कीर्तन, मनन तथा श्वास द्वारा जप और भगवत्प्राप्तिविषयक शास्त्रों का पठन-पाठन इत्यादि चेष्टाएँ भगवत्प्राप्ति के लिए बारंबार करने का नाम 'अभ्यास' है) योग द्वारा मुझको प्राप्त होने के लिए इच्छा कर";
                }else if(i==9){
                    name="अभ्यासेऽप्यसमर्थोऽसि मत्कर्मपरमो भव ।\n" +
                            "मदर्थमपि कर्माणि कुर्वन्सिद्धिमवाप्स्यसि ॥";
                    desc="भावार्थ : यदि तू उपर्युक्त अभ्यास में भी असमर्थ है, तो केवल मेरे लिए कर्म करने के ही परायण (स्वार्थ को त्यागकर तथा परमेश्वर को ही परम आश्रय और परम गति समझकर, निष्काम प्रेमभाव से सती-शिरोमणि, पतिव्रता स्त्री की भाँति मन, वाणी और शरीर द्वारा परमेश्वर के ही लिए यज्ञ, दान और तपादि सम्पूर्ण कर्तव्यकर्मों के करने का नाम 'भगवदर्थ कर्म करने के परायण होना' है) हो जा। इस प्रकार मेरे निमित्त कर्मों को करता हुआ भी मेरी प्राप्ति रूप सिद्धि को ही प्राप्त होगा";
                }else if(i==10){
                    name="अथैतदप्यशक्तोऽसि कर्तुं मद्योगमाश्रितः ।\n" +
                            "सर्वकर्मफलत्यागं ततः कुरु यतात्मवान्\u200C ॥";
                    desc="भावार्थ : यदि मेरी प्राप्ति रूप योग के आश्रित होकर उपर्युक्त साधन को करने में भी तू असमर्थ है, तो मन-बुद्धि आदि पर विजय प्राप्त करने वाला होकर सब कर्मों के फल का त्याग (गीता अध्याय 9 श्लोक 27 में विस्तार देखना चाहिए) कर";
                }else if(i==11){
                    name="श्रेयो हि ज्ञानमभ्यासाज्ज्ञानाद्धयानं विशिष्यते ।\n" +
                            "ध्यानात्कर्मफलत्यागस्त्यागाच्छान्तिरनन्तरम्\u200C ॥";
                    desc="भावार्थ : मर्म को न जानकर किए हुए अभ्यास से ज्ञान श्रेष्ठ है, ज्ञान से मुझ परमेश्वर के स्वरूप का ध्यान श्रेष्ठ है और ध्यान से सब कर्मों के फल का त्याग (केवल भगवदर्थ कर्म करने वाले पुरुष का भगवान में प्रेम और श्रद्धा तथा भगवान का चिन्तन भी बना रहता है, इसलिए ध्यान से 'कर्मफल का त्याग' श्रेष्ठ कहा है) श्रेष्ठ है, क्योंकि त्याग से तत्काल ही परम शान्ति होती है";
                }else if(i==12){
                    name="अद्वेष्टा सर्वभूतानां मैत्रः करुण एव च ।\n" +
                            "निर्ममो निरहङ्\u200Dकारः समदुःखसुखः क्षमी ॥";
                    desc="";
                }else if(i==13){
                    name="संतुष्टः सततं योगी यतात्मा दृढ़निश्चयः।\n" +
                            "मय्यर्पितमनोबुद्धिर्यो मद्भक्तः स मे प्रियः॥";
                    desc="भावार्थ : जो पुरुष सब भूतों में द्वेष भाव से रहित, स्वार्थ रहित सबका प्रेमी और हेतु रहित दयालु है तथा ममता से रहित, अहंकार से रहित, सुख-दुःखों की प्राप्ति में सम और क्षमावान है अर्थात अपराध करने वाले को भी अभय देने वाला है तथा जो योगी निरन्तर संतुष्ट है, मन-इन्द्रियों सहित शरीर को वश में किए हुए है और मुझमें दृढ़ निश्चय वाला है- वह मुझमें अर्पण किए हुए मन-बुद्धिवाला मेरा भक्त मुझको प्रिय है";
                }else if(i==14){
                    name="यस्मान्नोद्विजते लोको लोकान्नोद्विजते च यः।\n" +
                            "हर्षामर्षभयोद्वेगैर्मुक्तो यः स च मे प्रियः॥";
                    desc="भावार्थ : जिससे कोई भी जीव उद्वेग को प्राप्त नहीं होता और जो स्वयं भी किसी जीव से उद्वेग को प्राप्त नहीं होता तथा जो हर्ष, अमर्ष (दूसरे की उन्नति को देखकर संताप होने का नाम 'अमर्ष' है), भय और उद्वेगादि से रहित है वह भक्त मुझको प्रिय है";
                }else if(i==15){
                    name="अनपेक्षः शुचिर्दक्ष उदासीनो गतव्यथः।\n" +
                            "सर्वारम्भपरित्यागी यो मद्भक्तः स मे प्रियः॥";
                    desc="भावार्थ : जो पुरुष आकांक्षा से रहित, बाहर-भीतर से शुद्ध (गीता अध्याय 13 श्लोक 7 की टिप्पणी में इसका विस्तार देखना चाहिए) चतुर, पक्षपात से रहित और दुःखों से छूटा हुआ है- वह सब आरम्भों का त्यागी मेरा भक्त मुझको प्रिय है";
                }else if(i==16){
                    name="यो न हृष्यति न द्वेष्टि न शोचति न काङ्\u200Dक्षति।\n" +
                            "शुभाशुभपरित्यागी भक्तिमान्यः स मे प्रियः॥";
                    desc="भावार्थ : जो न कभी हर्षित होता है, न द्वेष करता है, न शोक करता है, न कामना करता है तथा जो शुभ और अशुभ सम्पूर्ण कर्मों का त्यागी है- वह भक्तियुक्त पुरुष मुझको प्रिय है";
                }else if(i==17){
                    name="समः शत्रौ च मित्रे च तथा मानापमानयोः।\n" +
                            "शीतोष्णसुखदुःखेषु समः सङ्\u200Dगविवर्जितः॥";
                    desc="भावार्थ : जो शत्रु-मित्र में और मान-अपमान में सम है तथा सर्दी, गर्मी और सुख-दुःखादि द्वंद्वों में सम है और आसक्ति से रहित है";
                }else if(i==18){
                    name="तुल्यनिन्दास्तुतिर्मौनी सन्तुष्टो येन केनचित्\u200C।\n" +
                            "अनिकेतः स्थिरमतिर्भक्तिमान्मे प्रियो नरः॥";
                    desc="भावार्थ : जो निंदा-स्तुति को समान समझने वाला, मननशील और जिस किसी प्रकार से भी शरीर का निर्वाह होने में सदा ही संतुष्ट है और रहने के स्थान में ममता और आसक्ति से रहित है- वह स्थिरबुद्धि भक्तिमान पुरुष मुझको प्रिय है";
                }else if(i==19){
                    name="ये तु धर्म्यामृतमिदं यथोक्तं पर्युपासते।\n" +
                            "श्रद्धाना मत्परमा भक्तास्तेऽतीव मे प्रियाः॥";
                    desc="भावार्थ : परन्तु जो श्रद्धायुक्त (वेद, शास्त्र, महात्मा और गुरुजनों के तथा परमेश्वर के वचनों में प्रत्यक्ष के सदृश विश्वास का नाम 'श्रद्धा' है) पुरुष मेरे परायण होकर इस ऊपर कहे हुए धर्ममय अमृत को निष्काम प्रेमभाव से सेवन करते हैं, वे भक्त मुझको अतिशय प्रिय हैं";
                }
            }else if(n==12){
                if(i==0){
                    name="प्रकृतिं पुरुषं चैव क्षेत्रं क्षेत्रज्ञमेव च ।\n" +
                            "एतद्वेदितुमिच्छामि ज्ञानं ज्ञेयं च केशव ৷৷";
                    desc="भावार्थ : अर्जुन ने पूछा - हे केशव! मैं आपसे प्रकृति एवं पुरुष, क्षेत्र एवं क्षेत्रज्ञ और ज्ञान एवं ज्ञान के लक्ष्य के विषय में जानना चाहता हूँ";
                }else if(i==1){
                    name="इदं शरीरं कौन्तेय क्षेत्रमित्यभिधीयते।\n" +
                            "एतद्यो वेत्ति तं प्राहुः क्षेत्रज्ञ इति तद्विदः॥";
                    desc="भावार्थ : श्री भगवान बोले- हे अर्जुन! यह शरीर 'क्षेत्र' (जैसे खेत में बोए हुए बीजों का उनके अनुरूप फल समय पर प्रकट होता है, वैसे ही इसमें बोए हुए कर्मों के संस्कार रूप बीजों का फल समय पर प्रकट होता है, इसलिए इसका नाम 'क्षेत्र' ऐसा कहा है) इस नाम से कहा जाता है और इसको जो जानता है, उसको 'क्षेत्रज्ञ' इस नाम से उनके तत्व को जानने वाले ज्ञानीजन कहते हैं";
                }else if(i==2){
                    name="क्षेत्रज्ञं चापि मां विद्धि सर्वक्षेत्रेषु भारत।\n" +
                            "क्षेत्रक्षेत्रज्ञयोर्ज्ञानं यत्तज्ज्ञानं मतं मम॥";
                    desc="भावार्थ : हे अर्जुन! तू सब क्षेत्रों में क्षेत्रज्ञ अर्थात जीवात्मा भी मुझे ही जान (गीता अध्याय 15 श्लोक 7 और उसकी टिप्पणी देखनी चाहिए) और क्षेत्र-क्षेत्रज्ञ को अर्थात विकार सहित प्रकृति और पुरुष का जो तत्व से जानना है (गीता अध्याय 13 श्लोक 23 और उसकी टिप्पणी देखनी चाहिए) वह ज्ञान है- ऐसा मेरा मत है";
                }else if(i==3){
                    name="तत्क्षेत्रं यच्च यादृक्च यद्विकारि यतश्च यत्\u200C।\n" +
                            "स च यो यत्प्रभावश्च तत्समासेन मे श्रृणु॥\n";
                    desc="भावार्थ : वह क्षेत्र जो और जैसा है तथा जिन विकारों वाला है और जिस कारण से जो हुआ है तथा वह क्षेत्रज्ञ भी जो और जिस प्रभाववाला है- वह सब संक्षेप में मुझसे सुन";
                }else if(i==4){
                    name="ऋषिभिर्बहुधा गीतं छन्दोभिर्विविधैः पृथक्\u200C ।\n" +
                            "ब्रह्मसूत्रपदैश्चैव हेतुमद्भिर्विनिश्चितैः ॥";
                    desc="भावार्थ : यह क्षेत्र और क्षेत्रज्ञ का तत्व ऋषियों द्वारा बहुत प्रकार से कहा गया है और विविध वेदमन्त्रों द्वारा भी विभागपूर्वक कहा गया है तथा भलीभाँति निश्चय किए हुए युक्तियुक्त ब्रह्मसूत्र के पदों द्वारा भी कहा गया है";
                }else if(i==5){
                    name="महाभूतान्यहङ्\u200Dकारो बुद्धिरव्यक्तमेव च ।\n" +
                            "इन्द्रियाणि दशैकं च पञ्च चेन्द्रियगोचराः ॥\n";
                    desc="भावार्थ : पाँच महाभूत, अहंकार, बुद्धि और मूल प्रकृति भी तथा दस इन्द्रियाँ, एक मन और पाँच इन्द्रियों के विषय अर्थात शब्द, स्पर्श, रूप, रस और गंध";
                }else if(i==6){
                    name="इच्छा द्वेषः सुखं दुःखं सङ्\u200Dघातश्चेतना धृतिः ।\n" +
                            "एतत्क्षेत्रं समासेन सविकारमुदाहृतम्\u200C ॥";
                    desc="भावार्थ : तथा इच्छा, द्वेष, सुख, दुःख, स्थूल देहका पिण्ड, चेतना (शरीर और अन्तःकरण की एक प्रकार की चेतन-शक्ति।) और धृति (गीता अध्याय 18 श्लोक 34 व 35 तक देखना चाहिए।)-- इस प्रकार विकारों (पाँचवें श्लोक में कहा हुआ तो क्षेत्र का स्वरूप समझना चाहिए और इस श्लोक में कहे हुए इच्छादि क्षेत्र के विकार समझने चाहिए।) के सहित यह क्षेत्र संक्षेप में कहा गया";
                }else if(i==7){
                    name="अमानित्वमदम्भित्वमहिंसा क्षान्तिरार्जवम्\u200C ।\n" +
                            "आचार्योपासनं शौचं स्थैर्यमात्मविनिग्रहः ॥";
                    desc="भावार्थ : श्रेष्ठता के अभिमान का अभाव, दम्भाचरण का अभाव, किसी भी प्राणी को किसी प्रकार भी न सताना, क्षमाभाव, मन-वाणी आदि की सरलता, श्रद्धा-भक्ति सहित गुरु की सेवा, बाहर-भीतर की शुद्धि (सत्यतापूर्वक शुद्ध व्यवहार से द्रव्य की और उसके अन्न से आहार की तथा यथायोग्य बर्ताव से आचरणों की और जल-मृत्तिकादि से शरीर की शुद्धि को बाहर की शुद्धि कहते हैं तथा राग, द्वेष और कपट आदि विकारों का नाश होकर अन्तःकरण का स्वच्छ हो जाना भीतर की शुद्धि कही जाती है।) अन्तःकरण की स्थिरता और मन-इन्द्रियों सहित शरीर का निग्रह";
                }else if(i==8){
                    name="इन्द्रियार्थेषु वैराग्यमनहङ्\u200Dकार एव च ।\n" +
                            "जन्ममृत्युजराव्याधिदुःखदोषानुदर्शनम्\u200C ॥";
                    desc="भावार्थ : इस लोक और परलोक के सम्पूर्ण भोगों में आसक्ति का अभाव और अहंकार का भी अभाव, जन्म, मृत्यु, जरा और रोग आदि में दुःख और दोषों का बार-बार विचार करना";
                }else if(i==9){
                    name="असक्तिरनभिष्वङ्\u200Dग: पुत्रदारगृहादिषु ।\n" +
                            "नित्यं च समचित्तत्वमिष्टानिष्टोपपत्तिषु ॥";
                    desc="भावार्थ : पुत्र, स्त्री, घर और धन आदि में आसक्ति का अभाव, ममता का न होना तथा प्रिय और अप्रिय की प्राप्ति में सदा ही चित्त का सम रहना";
                }else if(i==10){
                    name="मयि चानन्ययोगेन भक्तिरव्यभिचारिणी ।\n" +
                            "विविक्तदेशसेवित्वमरतिर्जनसंसदि ॥";
                    desc="भावार्थ : मुझ परमेश्वर में अनन्य योग द्वारा अव्यभिचारिणी भक्ति (केवल एक सर्वशक्तिमान परमेश्वर को ही अपना स्वामी मानते हुए स्वार्थ और अभिमान का त्याग करके, श्रद्धा और भाव सहित परमप्रेम से भगवान का निरन्तर चिन्तन करना 'अव्यभिचारिणी' भक्ति है) तथा एकान्त और शुद्ध देश में रहने का स्वभाव और विषयासक्त मनुष्यों के समुदाय में प्रेम का न होना";
                }else if(i==11){
                    name="अध्यात्मज्ञाननित्यत्वं तत्वज्ञानार्थदर्शनम्\u200C ।\n" +
                            "एतज्ज्ञानमिति प्रोक्तमज्ञानं यदतोऽन्यथा ॥\n";
                    desc="भावार्थ : अध्यात्म ज्ञान में (जिस ज्ञान द्वारा आत्मवस्तु और अनात्मवस्तु जानी जाए, उस ज्ञान का नाम 'अध्यात्म ज्ञान' है) नित्य स्थिति और तत्वज्ञान के अर्थरूप परमात्मा को ही देखना- यह सब ज्ञान (इस अध्याय के श्लोक 7 से लेकर यहाँ तक जो साधन कहे हैं, वे सब तत्वज्ञान की प्राप्ति में हेतु होने से 'ज्ञान' नाम से कहे गए हैं) है और जो इसके विपरीत है वह अज्ञान (ऊपर कहे हुए ज्ञान के साधनों से विपरीत तो मान, दम्भ, हिंसा आदि हैं, वे अज्ञान की वृद्धि में हेतु होने से 'अज्ञान' नाम से कहे गए हैं) है- ऐसा कहा है";
                }else if(i==12){
                    name="ज्ञेयं यत्तत्वप्रवक्ष्यामि यज्ज्ञात्वामृतमश्नुते ।\n" +
                            "अनादिमत्परं ब्रह्म न सत्तन्नासदुच्यते ॥\n";
                    desc="भावार्थ : जो जानने योग्य है तथा जिसको जानकर मनुष्य परमानन्द को प्राप्त होता है, उसको भलीभाँति कहूँगा। वह अनादिवाला परमब्रह्म न सत्\u200C ही कहा जाता है, न असत्\u200C ही";
                }else if(i==13){
                    name="सर्वतः पाणिपादं तत्सर्वतोऽक्षिशिरोमुखम्\u200C ।\n" +
                            "सर्वतः श्रुतिमल्लोके सर्वमावृत्य तिष्ठति ॥";
                    desc="भावार्थ : वह सब ओर हाथ-पैर वाला, सब ओर नेत्र, सिर और मुख वाला तथा सब ओर कान वाला है, क्योंकि वह संसार में सबको व्याप्त करके स्थित है। (आकाश जिस प्रकार वायु, अग्नि, जल और पृथ्वी का कारण रूप होने से उनको व्याप्त करके स्थित है, वैसे ही परमात्मा भी सबका कारण रूप होने से सम्पूर्ण चराचर जगत को व्याप्त करके स्थित है) ";
                }else if(i==14){
                    name="सर्वेन्द्रियगुणाभासं सर्वेन्द्रियविवर्जितम्\u200C ।\n" +
                            "असक्तं सर्वभृच्चैव निर्गुणं गुणभोक्तृ च ॥";
                    desc="भावार्थ : वह सम्पूर्ण इन्द्रियों के विषयों को जानने वाला है, परन्तु वास्तव में सब इन्द्रियों से रहित है तथा आसक्ति रहित होने पर भी सबका धारण-पोषण करने वाला और निर्गुण होने पर भी गुणों को भोगने वाला है";
                }else if(i==15){
                    name="बहिरन्तश्च भूतानामचरं चरमेव च ।\n" +
                            "सूक्ष्मत्वात्तदविज्ञयं दूरस्थं चान्तिके च तत्\u200C ॥";
                    desc="भावार्थ : वह चराचर सब भूतों के बाहर-भीतर परिपूर्ण है और चर-अचर भी वही है। और वह सूक्ष्म होने से अविज्ञेय (जैसे सूर्य की किरणों में स्थित हुआ जल सूक्ष्म होने से साधारण मनुष्यों के जानने में नहीं आता है, वैसे ही सर्वव्यापी परमात्मा भी सूक्ष्म होने से साधारण मनुष्यों के जानने में नहीं आता है) है तथा अति समीप में (वह परमात्मा सर्वत्र परिपूर्ण और सबका आत्मा होने से अत्यन्त समीप है) और दूर में (श्रद्धारहित, अज्ञानी पुरुषों के लिए न जानने के कारण बहुत दूर है) भी स्थित वही है";
                }else if(i==16){
                    name="अविभक्तं च भूतेषु विभक्तमिव च स्थितम्\u200C ।\n" +
                            "भूतभर्तृ च तज्ज्ञेयं ग्रसिष्णु प्रभविष्णु च ॥\n";
                    desc="भावार्थ : वह परमात्मा विभागरहित एक रूप से आकाश के सदृश परिपूर्ण होने पर भी चराचर सम्पूर्ण भूतों में विभक्त-सा स्थित प्रतीत होता है (जैसे महाकाश विभागरहित स्थित हुआ भी घड़ों में पृथक-पृथक के सदृश प्रतीत होता है, वैसे ही परमात्मा सब भूतों में एक रूप से स्थित हुआ भी पृथक-पृथक की भाँति प्रतीत होता है) तथा वह जानने योग्य परमात्मा विष्णुरूप से भूतों को धारण-पोषण करने वाला और रुद्ररूप से संहार करने वाला तथा ब्रह्मारूप से सबको उत्पन्न करने वाला है";
                }else if(i==17){
                    name="ज्योतिषामपि तज्ज्योतिस्तमसः परमुच्यते ।\n" +
                            "ज्ञानं ज्ञेयं ज्ञानगम्यं हृदि सर्वस्य विष्ठितम्\u200C ॥";
                    desc="भावार्थ : वह परब्रह्म ज्योतियों का भी ज्योति (गीता अध्याय 15 श्लोक 12 में देखना चाहिए) एवं माया से अत्यन्त परे कहा जाता है। वह परमात्मा बोधस्वरूप, जानने के योग्य एवं तत्वज्ञान से प्राप्त करने योग्य है और सबके हृदय में विशेष रूप से स्थित है";
                }else if(i==18){
                    name="इति क्षेत्रं तथा ज्ञानं ज्ञेयं चोक्तं समासतः ।\n" +
                            "मद्भक्त एतद्विज्ञाय मद्भावायोपपद्यते ॥\n";
                    desc="भावार्थ : इस प्रकार क्षेत्र (श्लोक 5-6 में विकार सहित क्षेत्र का स्वरूप कहा है) तथा ज्ञान (श्लोक 7 से 11 तक ज्ञान अर्थात ज्ञान का साधन कहा है।) और जानने योग्य परमात्मा का स्वरूप (श्लोक 12 से 17 तक ज्ञेय का स्वरूप कहा है) संक्षेप में कहा गया। मेरा भक्त इसको तत्व से जानकर मेरे स्वरूप को प्राप्त होता है";
                }else if(i==19){
                    name="प्रकृतिं पुरुषं चैव विद्ध्\u200Cयनादी उभावपि ।\n" +
                            "विकारांश्च गुणांश्चैव विद्धि प्रकृतिसम्भवान्\u200C ॥";
                    desc="भावार्थ : प्रकृति और पुरुष- इन दोनों को ही तू अनादि जान और राग-द्वेषादि विकारों को तथा त्रिगुणात्मक सम्पूर्ण पदार्थों को भी प्रकृति से ही उत्पन्न जान";
                }else if(i==20){
                    name="कार्यकरणकर्तृत्वे हेतुः प्रकृतिरुच्यते ।\n" +
                            "पुरुषः सुखदुःखानां भोक्तृत्वे हेतुरुच्यते ॥";
                    desc="भावार्थ : कार्य (आकाश, वायु, अग्नि, जल और पृथ्वी तथा शब्द, स्पर्श, रूप, रस, गंध -इनका नाम 'कार्य' है) और करण (बुद्धि, अहंकार और मन तथा श्रोत्र, त्वचा, रसना, नेत्र और घ्राण एवं वाक्\u200C, हस्त, पाद, उपस्थ और गुदा- इन 13 का नाम 'करण' है) को उत्पन्न करने में हेतु प्रकृति कही जाती है और जीवात्मा सुख-दुःखों के भोक्तपन में अर्थात भोगने में हेतु कहा जाता है";
                }else if(i==21){
                    name="पुरुषः प्रकृतिस्थो हि भुङ्\u200Dक्ते प्रकृतिजान्गुणान्\u200C ।\n" +
                            "कारणं गुणसंगोऽस्य सदसद्योनिजन्मसु ॥";
                    desc="भावार्थ : प्रकृति में (प्रकृति शब्द का अर्थ गीता अध्याय 7 श्लोक 14 में कही हुई भगवान की त्रिगुणमयी माया समझना चाहिए) स्थित ही पुरुष प्रकृति से उत्पन्न त्रिगुणात्मक पदार्थों को भोगता है और इन गुणों का संग ही इस जीवात्मा के अच्छी-बुरी योनियों में जन्म लेने का कारण है। (सत्त्वगुण के संग से देवयोनि में एवं रजोगुण के संग से मनुष्य योनि में और तमो गुण के संग से पशु आदि नीच योनियों में जन्म होता है।)";
                }else if(i==22){
                    name="उपद्रष्टानुमन्ता च भर्ता भोक्ता महेश्वरः ।\n" +
                            "परमात्मेति चाप्युक्तो देहेऽस्मिन्पुरुषः परः ॥";
                    desc="भावार्थ : इस देह में स्थित यह आत्मा वास्तव में परमात्मा ही है। वह साक्षी होने से उपद्रष्टा और यथार्थ सम्मति देने वाला होने से अनुमन्ता, सबका धारण-पोषण करने वाला होने से भर्ता, जीवरूप से भोक्ता, ब्रह्मा आदि का भी स्वामी होने से महेश्वर और शुद्ध सच्चिदानन्दघन होने से परमात्मा- ऐसा कहा गया है";
                }else if(i==23){
                    name="य एवं वेत्ति पुरुषं प्रकृतिं च गुणैः सह ।\n" +
                            "सर्वथा वर्तमानोऽपि न स भूयोऽभिजायते ॥";
                    desc="भावार्थ : इस प्रकार पुरुष को और गुणों के सहित प्रकृति को जो मनुष्य तत्व से जानता है (दृश्यमात्र सम्पूर्ण जगत माया का कार्य होने से क्षणभंगुर, नाशवान, जड़ और अनित्य है तथा जीवात्मा नित्य, चेतन, निर्विकार और अविनाशी एवं शुद्ध, बोधस्वरूप, सच्चिदानन्दघन परमात्मा का ही सनातन अंश है, इस प्रकार समझकर सम्पूर्ण मायिक पदार्थों के संग का सर्वथा त्याग करके परम पुरुष परमात्मा में ही एकीभाव से नित्य स्थित रहने का नाम उनको 'तत्व से जानना' है) वह सब प्रकार से कर्तव्य कर्म करता हुआ भी फिर नहीं जन्मता";
                }else if(i==24){
                    name="ध्यानेनात्मनि पश्यन्ति केचिदात्मानमात्मना ।\n" +
                            "अन्ये साङ्\u200Dख्येन योगेन कर्मयोगेन चापरे ॥\n";
                    desc="भावार्थ : उस परमात्मा को कितने ही मनुष्य तो शुद्ध हुई सूक्ष्म बुद्धि से ध्यान (जिसका वर्णन गीता अध्याय 6 में श्लोक 11 से 32 तक विस्तारपूर्वक किया है) द्वारा हृदय में देखते हैं, अन्य कितने ही ज्ञानयोग (जिसका वर्णन गीता अध्याय 2 में श्लोक 11 से 30 तक विस्तारपूर्वक किया है) द्वारा और दूसरे कितने ही कर्मयोग (जिसका वर्णन गीता अध्याय 2 में श्लोक 40 से अध्याय समाप्तिपर्यन्त विस्तारपूर्वक किया है) द्वारा देखते हैं अर्थात प्राप्त करते हैं";
                }else if(i==25){
                    name="अन्ये त्वेवमजानन्तः श्रुत्वान्येभ्य उपासते ।\n" +
                            "तेऽपि चातितरन्त्येव मृत्युं श्रुतिपरायणाः ॥";
                    desc="भावार्थ : परन्तु इनसे दूसरे अर्थात जो मंदबुद्धिवाले पुरुष हैं, वे इस प्रकार न जानते हुए दूसरों से अर्थात तत्व के जानने वाले पुरुषों से सुनकर ही तदनुसार उपासना करते हैं और वे श्रवणपरायण पुरुष भी मृत्युरूप संसार-सागर को निःसंदेह तर जाते हैं";
                }else if(i==26){
                    name="यावत्सञ्जायते किञ्चित्सत्त्वं स्थावरजङ्\u200Dगमम्\u200C ।\n" +
                            "क्षेत्रक्षेत्रज्ञसंयोगात्तद्विद्धि भरतर्षभ ॥\n";
                    desc="भावार्थ : हे अर्जुन! यावन्मात्र जितने भी स्थावर-जंगम प्राणी उत्पन्न होते हैं, उन सबको तू क्षेत्र और क्षेत्रज्ञ के संयोग से ही उत्पन्न जान";
                }else if(i==27){
                    name="समं सर्वेषु भूतेषु तिष्ठन्तं परमेश्वरम्\u200C ।\n" +
                            "विनश्यत्स्वविनश्यन्तं यः पश्यति स पश्यति ॥";
                    desc="भावार्थ : जो पुरुष नष्ट होते हुए सब चराचर भूतों में परमेश्वर को नाशरहित और समभाव से स्थित देखता है वही यथार्थ देखता है";
                }else if(i==28){
                    name="समं पश्यन्हि सर्वत्र समवस्थितमीश्वरम्\u200C ।\n" +
                            "न हिनस्त्यात्मनात्मानं ततो याति परां गतिम्\u200C ॥";
                    desc="भावार्थ : क्योंकि जो पुरुष सबमें समभाव से स्थित परमेश्वर को समान देखता हुआ अपने द्वारा अपने को नष्ट नहीं करता, इससे वह परम गति को प्राप्त होता है";
                }else if(i==29){
                    name="प्रकृत्यैव च कर्माणि क्रियमाणानि सर्वशः ।\n" +
                            "यः पश्यति तथात्मानमकर्तारं स पश्यति ॥";
                    desc="भावार्थ : और जो पुरुष सम्पूर्ण कर्मों को सब प्रकार से प्रकृति द्वारा ही किए जाते हुए देखता है और आत्मा को अकर्ता देखता है, वही यथार्थ देखता है";
                }else if(i==30){
                    name="यदा भूतपृथग्भावमेकस्थमनुपश्यति ।\n" +
                            "तत एव च विस्तारं ब्रह्म सम्पद्यते तदा ॥";
                    desc="भावार्थ : जिस क्षण यह पुरुष भूतों के पृथक-पृथक भाव को एक परमात्मा में ही स्थित तथा उस परमात्मा से ही सम्पूर्ण भूतों का विस्तार देखता है, उसी क्षण वह सच्चिदानन्दघन ब्रह्म को प्राप्त हो जाता है";
                }else if(i==31){
                    name="अनादित्वान्निर्गुणत्वात्परमात्मायमव्ययः ।\n" +
                            "शरीरस्थोऽपि कौन्तेय न करोति न लिप्यते ॥";
                    desc="भावार्थ : हे अर्जुन! अनादि होने से और निर्गुण होने से यह अविनाशी परमात्मा शरीर में स्थित होने पर भी वास्तव में न तो कुछ करता है और न लिप्त ही होता है";
                }else if(i==32){
                    name="यथा सर्वगतं सौक्ष्म्यादाकाशं नोपलिप्यते ।\n" +
                            "सर्वत्रावस्थितो देहे तथात्मा नोपलिप्यते ॥\n";
                    desc="भावार्थ : जिस प्रकार सर्वत्र व्याप्त आकाश सूक्ष्म होने के कारण लिप्त नहीं होता, वैसे ही देह में सर्वत्र स्थित आत्मा निर्गुण होने के कारण देह के गुणों से लिप्त नहीं होता";
                }else if(i==33){
                    name="यथा प्रकाशयत्येकः कृत्स्नं लोकमिमं रविः ।\n" +
                            "क्षेत्रं क्षेत्री तथा कृत्स्नं प्रकाशयति भारत ॥";
                    desc="भावार्थ : हे अर्जुन! जिस प्रकार एक ही सूर्य इस सम्पूर्ण ब्रह्माण्ड को प्रकाशित करता है, उसी प्रकार एक ही आत्मा सम्पूर्ण क्षेत्र को प्रकाशित करता है";
                }else if(i==34){
                    name="क्षेत्रक्षेत्रज्ञयोरेवमन्तरं ज्ञानचक्षुषा ।\n" +
                            "भूतप्रकृतिमोक्षं च ये विदुर्यान्ति ते परम्\u200C ॥";
                    desc="भावार्थ : इस प्रकार क्षेत्र और क्षेत्रज्ञ के भेद को (क्षेत्र को जड़, विकारी, क्षणिक और नाशवान तथा क्षेत्रज्ञ को नित्य, चेतन, अविकारी और अविनाशी जानना ही 'उनके भेद को जानना' है) तथा कार्य सहित प्रकृति से मुक्त होने को जो पुरुष ज्ञान नेत्रों द्वारा तत्व से जानते हैं, वे महात्माजन परम ब्रह्म परमात्मा को प्राप्त होते हैं";
                }
            }else if(n==13){
                if(i==0){
                    name="परं भूयः प्रवक्ष्यामि ज्ञानानं मानमुत्तमम्\u200C ।\n" +
                            "यज्ज्ञात्वा मुनयः सर्वे परां सिद्धिमितो गताः ॥";
                    desc="भावार्थ : श्री भगवान ने कहा - हे अर्जुन! समस्त ज्ञानों में भी सर्वश्रेष्ठ इस परम-ज्ञान को मैं तेरे लिये फिर से कहता हूँ, जिसे जानकर सभी संत-मुनियों ने इस संसार से मुक्त होकर परम-सिद्धि को प्राप्त किया हैं";
                }else if(i==1){
                    name="इदं ज्ञानमुपाश्रित्य मम साधर्म्यमागताः ।\n" +
                            "सर्गेऽपि नोपजायन्ते प्रलये न व्यथन्ति च ॥ ";
                    desc="भावार्थ : इस ज्ञान में स्थिर होकर वह मनुष्य मेरे जैसे स्वभाव को ही प्राप्त होता है, वह जीव न तो सृष्टि के प्रारम्भ में फिर से उत्पन्न ही होता हैं और न ही प्रलय के समय कभी व्याकुल होता हैं";
                }else if(i==2){
                    name="मम योनिर्महद्ब्रह्म तस्मिन्गर्भं दधाम्यहम्\u200C ।\n" +
                            "सम्भवः सर्वभूतानां ततो भवति भारत ॥";
                    desc="भावार्थ : हे भरतवंशी! मेरी यह आठ तत्वों वाली जड़ प्रकृति (जल, अग्नि, वायु, पृथ्वी, आकाश, मन, बुद्धि और अहंकार) ही समस्त वस्तुओं को उत्पन्न करने वाली योनि (माता) है और मैं ही ब्रह्म (आत्मा) रूप में चेतन-रूपी बीज को स्थापित करता हूँ, इस जड़-चेतन के संयोग से ही सभी चर-अचर प्राणीयों का जन्म सम्भव होता है";
                }else if(i==3){
                    name="सर्वयोनिषु कौन्तेय मूर्तयः सम्भवन्ति याः ।\n" +
                            "तासां ब्रह्म महद्योनिरहं बीजप्रदः पिता ॥";
                    desc="भावार्थ : हे कुन्तीपुत्र! समस्त योनियों जो भी शरीर धारण करने वाले प्राणी उत्पन्न होते हैं, उन सभी को धारण करने वाली ही जड़ प्रकृति ही माता है और मैं ही ब्रह्म (आत्मा) रूपी बीज को स्थापित करने वाला पिता हूँ";
                }else if(i==4){
                    name="सत्त्वं रजस्तम इति गुणाः प्रकृतिसम्भवाः ।\n" +
                            "निबध्नन्ति महाबाहो देहे देहिनमव्ययम्\u200C ॥ ";
                    desc="भावार्थ : हे महाबाहु अर्जुन! सात्विक गुण, राजसिक गुण और तामसिक गुण यह तीनों गुण भौतिक प्रकृति से ही उत्पन्न होते हैं, प्रकृति से उत्पन्न तीनों गुणों के कारण ही अविनाशी जीवात्मा शरीर में बँध जाती हैं";
                }else if(i==5){
                    name="तत्र सत्त्वं निर्मलत्वात्प्रकाशकमनामयम्\u200C ।\n" +
                            "सुखसङ्\u200Dगेन बध्नाति ज्ञानसङ्\u200Dगेन चानघ ॥";
                    desc="भावार्थ : हे निष्पाप अर्जुन! सतोगुण अन्य गुणों की अपेक्षा अधिक शुद्ध होने के कारण पाप-कर्मों से जीव को मुक्त करके आत्मा को प्रकाशित करने वाला होता है, जिससे जीव सुख और ज्ञान के अहंकार में बँध जाता है";
                }else if(i==6){
                    name="रजो रागात्मकं विद्धि तृष्णासङ्\u200Dगसमुद्भवम्\u200C ।\n" +
                            "तन्निबध्नाति कौन्तेय कर्मसङ्\u200Dगेन देहिनम्\u200C ॥";
                    desc="भावार्थ : हे कुन्तीपुत्र! रजोगुण को कामनाओं और लोभ के कारण उत्पन्न हुआ समझ, जिसके कारण शरीरधारी जीव सकाम-कर्मों (फल की आसक्ति) में बँध जाता है।";
                }else if(i==7){
                    name="तमस्त्वज्ञानजं विद्धि मोहनं सर्वदेहिनाम्\u200C ।\n" +
                            "प्रमादालस्यनिद्राभिस्तन्निबध्नाति भारत ॥";
                    desc="भावार्थ : हे भरतवंशी! तमोगुण को शरीर के प्रति मोह के कारण अज्ञान से उत्पन्न हुआ समझ, जिसके कारण जीव प्रमाद (पागलपन में व्यर्थ के कार्य करने की प्रवृत्ति), आलस्य (आज के कार्य को कल पर टालने की प्रवृत्ति) और निद्रा (अचेत अवस्था में न करने योग्य कार्य करने की प्रवृत्ति) द्वारा बँध जाता है";
                }else if(i==8){
                    name="सत्त्वं सुखे सञ्जयति रजः कर्मणि भारत ।\n" +
                            "ज्ञानमावृत्य तु तमः प्रमादे सञ्जयत्युत ॥";
                    desc="भावार्थ : हे अर्जुन! सतोगुण मनुष्य को सुख में बाँधता है, रजोगुण मनुष्य को सकाम कर्म में बाँधता है और तमोगुण मनुष्य के ज्ञान को ढँक कर प्रमाद में बाँधता है";
                }else if(i==9){
                    name="रजस्तमश्चाभिभूय सत्त्वं भवति भारत ।\n" +
                            "रजः सत्त्वं तमश्चैव तमः सत्त्वं रजस्तथा ॥ ";
                    desc="भावार्थ : हे भरतवंशी अर्जुन! रजोगुण और तमोगुण के घटने पर सतोगुण बढ़ता है, सतोगुण और रजोगुण के घटने पर तमोगुण बढ़ता है, इसी प्रकार तमोगुण और सतोगुण के घटने पर तमोगुण बढ़ता है";
                }else if(i==10){
                    name="सर्वद्वारेषु देहेऽस्मिन्प्रकाश उपजायते ।\n" +
                            "ज्ञानं यदा तदा विद्याद्विवृद्धं सत्त्वमित्युत ॥";
                    desc="भावार्थ : जिस समय इस के शरीर सभी नौ द्वारों (दो आँखे, दो कान, दो नथुने, मुख, गुदा और उपस्थ) में ज्ञान का प्रकाश उत्पन्न होता है, उस समय सतोगुण विशेष बृद्धि को प्राप्त होता है";
                }else if(i==11){
                    name="लोभः प्रवृत्तिरारम्भः कर्मणामशमः स्पृहा ।\n" +
                            "रजस्येतानि जायन्ते विवृद्धे भरतर्षभ ॥ ";
                    desc="भावार्थ : हे भरतवंशीयों में श्रेष्ठ! जब रजोगुण विशेष बृद्धि को प्राप्त होता है तब लोभ के उत्पन्न होने कारण फल की इच्छा से कार्यों को करने की प्रवृत्ति और मन की चंचलता के कारण विषय-भोगों को भोगने की अनियन्त्रित इच्छा बढ़ने लगती है";
                }else if(i==12){
                    name="अप्रकाशोऽप्रवृत्तिश्च प्रमादो मोह एव च ।\n" +
                            "तमस्येतानि जायन्ते विवृद्धे कुरुनन्दन ॥";
                    desc="भावार्थ : हे कुरुवंशी अर्जुन! जब तमोगुण विशेष बृद्धि को प्राप्त होता है तब अज्ञान रूपी अन्धकार, कर्तव्य-कर्मों को न करने की प्रवृत्ति, पागलपन की अवस्था और मोह के कारण न करने योग्य कार्य करने की प्रवृत्ति बढने लगती हैं";
                }else if(i==13){
                    name="यदा सत्त्वे प्रवृद्धे तु प्रलयं याति देहभृत्\u200C ।\n" +
                            "तदोत्तमविदां लोकानमलान्प्रतिपद्यते ॥";
                    desc="भावार्थ : जब कोई मनुष्य सतोगुण की वृद्धि होने पर मृत्यु को प्राप्त होता है, तब वह उत्तम कर्म करने वालों के निर्मल स्वर्ग लोकों को प्राप्त होता है";
                }else if(i==14){
                    name="रजसि प्रलयं गत्वा कर्मसङ्\u200Dगिषु जायते ।\n" +
                            "तथा प्रलीनस्तमसि मूढयोनिषु जायते ॥";
                    desc="भावार्थ : जब कोई मनुष्य रजोगुण की बृद्धि होने पर मृत्यु को प्राप्त होता है तब वह सकाम कर्म करने वाले मनुष्यों में जन्म लेता है और उसी प्रकार तमोगुण की बृद्धि होने पर मृत्यु को प्राप्त मनुष्य पशु-पक्षियों आदि निम्न योनियों में जन्म लेता है";
                }else if(i==15){
                    name="कर्मणः सुकृतस्याहुः सात्त्विकं निर्मलं फलम्\u200C ।\n" +
                            "रजसस्तु फलं दुःखमज्ञानं तमसः फलम्\u200C ॥ ";
                    desc="भावार्थ : सतोगुण में किये गये कर्म का फल सुख और ज्ञान युक्त निर्मल फल कहा गया है, रजोगुण में किये गये कर्म का फल दुःख कहा गया है और तमोगुण में किये गये कर्म का फल अज्ञान कहा गया है";
                }else if(i==16){
                    name="सत्त्वात्सञ्जायते ज्ञानं रजसो लोभ एव च ।\n" +
                            "प्रमादमोहौ तमसो भवतोऽज्ञानमेव च ॥ ";
                    desc="भावार्थ : सतोगुण से वास्तविक ज्ञान उत्पन्न होता है, रजोगुण से निश्चित रूप से लोभ ही उत्पन्न होता है और तमोगुण से निश्चित रूप से प्रमाद, मोह, अज्ञान ही उत्पन्न होता हैं";
                }else if(i==17){
                    name="ऊर्ध्वं गच्छन्ति सत्त्वस्था मध्ये तिष्ठन्ति राजसाः ।\n" +
                            "जघन्यगुणवृत्तिस्था अधो गच्छन्ति तामसाः ॥";
                    desc="भावार्थ : सतोगुण में स्थित जीव स्वर्ग के उच्च लोकों को जाता हैं, रजोगुण में स्थित जीव मध्य में पृथ्वी-लोक में ही रह जाते हैं और तमोगुण में स्थित जीव पशु आदि नीच योनियों में नरक को जाते हैं";
                }else if(i==18){
                    name="नान्यं गुणेभ्यः कर्तारं यदा द्रष्टानुपश्यति ।\n" +
                            "गुणेभ्यश्च परं वेत्ति मद्भावं सोऽधिगच्छति ॥";
                    desc="भावार्थ : जब कोई मनुष्य प्रकृति के तीनों गुणों के अतिरिक्त अन्य किसी को कर्ता नहीं देखता है और स्वयं को दृष्टा रूप से देखता है तब वह प्रकृति के तीनों गुणों से परे स्थित होकर मुझ परमात्मा को जानकर मेरे दिव्य स्वभाव को ही प्राप्त होता है";
                }else if(i==19){
                    name="गुणानेतानतीत्य त्रीन्देही देहसमुद्भवान्\u200C ।\n" +
                            "जन्ममृत्युजरादुःखैर्विमुक्तोऽमृतमश्नुते ॥";
                    desc="भावार्थ : जब शरीरधारी जीव प्रकृति के इन तीनों गुणों को पार कर जाता है तब वह जन्म, मृत्यु, बुढापा तथा सभी प्रकार के कष्टों से मुक्त होकर इसी जीवन में परम-आनन्द स्वरूप अमृत का भोग करता है";
                }else if(i==20){
                    name="कैर्लिङ्\u200Dगैस्त्रीन्गुणानेतानतीतो भवति प्रभो ।\n" +
                            "किमाचारः कथं चैतांस्त्रीन्गुणानतिवर्तते ॥";
                    desc="भावार्थ : अर्जुन ने पूछा - हे प्रभु! प्रकृति के तीनों गुणों को पार किया हुआ मनुष्य किन लक्षणों के द्वारा जाना जाता है और उसका आचरण कैसा होता है तथा वह मनुष्य प्रकृति के तीनों गुणों को किस प्रकार से पार कर पाता है?";
                }else if(i==21){
                    name="प्रकाशं च प्रवृत्तिं च मोहमेव च पाण्डव ।\n" +
                            "न द्वेष्टि सम्प्रवृत्तानि न निवृत्तानि काङ्\u200Dक्षति ॥";
                    desc="भावार्थ : श्री भगवान ने कहा - जो मनुष्य ईश्वरीय ज्ञान रूपी प्रकाश (सतोगुण) तथा कर्म करने में आसक्ति (रजोगुण) तथा मोह रूपी अज्ञान (तमोगुण) के बढने पर कभी भी उनसे घृणा नहीं करता है तथा समान भाव में स्थित होकर न तो उनमें प्रवृत ही होता है और न ही उनसे निवृत होने की इच्छा ही करता है";
                }else if(i==22){
                    name="उदासीनवदासीनो गुणैर्यो न विचाल्यते ।\n" +
                            "गुणा वर्तन्त इत्येव योऽवतिष्ठति नेङ्\u200Dगते ॥";
                    desc="भावार्थ : जो उदासीन भाव में स्थित रहकर किसी भी गुण के आने-जाने से विचलित नही होता है और गुणों को ही कार्य करते हुए जानकर एक ही भाव में स्थिर रहता है";
                }else if(i==23){
                    name="समदुःखसुखः स्वस्थः समलोष्टाश्मकाञ्चनः ।\n" +
                            "तुल्यप्रियाप्रियो धीरस्तुल्यनिन्दात्मसंस्तुतिः ॥";
                    desc="भावार्थ : जो सुख और दुख में समान भाव में स्थित रहता है, जो अपने आत्म-भाव में स्थित रहता है, जो मिट्टी, पत्थर और स्वर्ण को एक समान समझता है, जिसके लिये न तो कोई प्रिय होता है और न ही कोई अप्रिय होता है, तथा जो निन्दा और स्तुति में अपना धीरज नहीं खोता है";
                }else if(i==24){
                    name="मानापमानयोस्तुल्यस्तुल्यो मित्रारिपक्षयोः ।\n" +
                            "सर्वारम्भपरित्यागी गुणातीतः सा उच्यते ॥";
                    desc="भावार्थ : जो मान और अपमान को एक समान समझता है, जो मित्र और शत्रु के पक्ष में समान भाव में रहता है तथा जिसमें सभी कर्मों के करते हुए भी कर्तापन का भाव नही होता है, ऎसे मनुष्य को प्रकृति के गुणों से अतीत कहा जाता है";
                }else if(i==25){
                    name="मां च योऽव्यभिचारेण भक्तियोगेन सेवते ।\n" +
                            "स गुणान्समतीत्येतान्ब्रह्मभूयाय कल्पते ॥";
                    desc="भावार्थ : जो मनुष्य हर परिस्थिति में बिना विचलित हुए अनन्य-भाव से मेरी भक्ति में स्थिर रहता है, वह भक्त प्रकृति के तीनों गुणों को अति-शीघ्र पार करके ब्रह्म-पद पर स्थित हो जाता है";
                }else if(i==26){
                    name="ब्रह्मणो हि प्रतिष्ठाहममृतस्याव्ययस्य च ।\n" +
                            "शाश्वतस्य च धर्मस्य सुखस्यैकान्तिकस्य च ॥";
                    desc="भावार्थ : उस अविनाशी ब्रह्म-पद का मैं ही अमृत स्वरूप, शाश्वत स्वरूप, धर्म स्वरूप और परम-आनन्द स्वरूप एक-मात्र आश्रय हूँ";
                }
            }else if(n==14){
                if(i==0){
                    name="ऊर्ध्वमूलमधः शाखमश्वत्थं प्राहुरव्ययम्\u200C ।\n" +
                            "छन्दांसि यस्य पर्णानि यस्तं वेद स वेदवित्\u200C ৷৷";
                    desc="भावार्थ : श्री भगवान ने कहा - हे अर्जुन! इस संसार को अविनाशी वृक्ष कहा गया है, जिसकी जड़ें ऊपर की ओर हैं और शाखाएँ नीचे की ओर तथा इस वृक्ष के पत्ते वैदिक स्तोत्र है, जो इस अविनाशी वृक्ष को जानता है वही वेदों का जानकार है";
                }else if(i==1){
                    name="अधश्चोर्ध्वं प्रसृतास्तस्य शाखा गुणप्रवृद्धा विषयप्रवालाः ।\n" +
                            "अधश्च मूलान्यनुसन्ततानि कर्मानुबन्धीनि मनुष्यलोके ৷৷";
                    desc="भावार्थ : इस संसार रूपी वृक्ष की समस्त योनियाँ रूपी शाखाएँ नीचे और ऊपर सभी ओर फ़ैली हुई हैं, इस वृक्ष की शाखाएँ प्रकृति के तीनों गुणों द्वारा विकसित होती है, इस वृक्ष की इन्द्रिय-विषय रूपी कोंपलें है, इस वृक्ष की जड़ों का विस्तार नीचे की ओर भी होता है जो कि सकाम-कर्म रूप से मनुष्यों के लिये फल रूपी बन्धन उत्पन्न करती हैं";
                }else if(i==2){
                    name="न रूपमस्येह तथोपलभ्यते नान्तो न चादिर्न च सम्प्रतिष्ठा ।\n" +
                            "अश्वत्थमेनं सुविरूढमूल मसङ्\u200Dगशस्त्रेण दृढेन छित्त्वा৷৷";
                    desc="भावार्थ : इस संसार रूपी वृक्ष के वास्तविक स्वरूप का अनुभव इस जगत में नहीं किया जा सकता है क्योंकि न तो इसका आदि है और न ही इसका अन्त है और न ही इसका कोई आधार ही है, अत्यन्त दृड़ता से स्थित इस वृक्ष को केवल वैराग्य रूपी हथियार के द्वारा ही काटा जा सकता है";
                }else if(i==3){
                    name="ततः पदं तत्परिमार्गितव्यं यस्मिन्गता न निवर्तन्ति भूयः ।\n" +
                            "तमेव चाद्यं पुरुषं प्रपद्ये यतः प्रवृत्तिः प्रसृता पुराणी৷৷";
                    desc="भावार्थ : वैराग्य रूपी हथियार से काटने के बाद मनुष्य को उस परम-लक्ष्य (परमात्मा) के मार्ग की खोज करनी चाहिये, जिस मार्ग पर पहुँचा हुआ मनुष्य इस संसार में फिर कभी वापस नही लौटता है, फिर मनुष्य को उस परमात्मा के शरणागत हो जाना चाहिये, जिस परमात्मा से इस आदि-रहित संसार रूपी वृक्ष की उत्पत्ति और विस्तार होता है";
                }else if(i==4){
                    name="निर्मानमोहा जितसङ्गदोषाअध्यात्मनित्या विनिवृत्तकामाः ।\n" +
                            "द्वन्द्वैर्विमुक्ताः सुखदुःखसञ्ज्ञैर्गच्छन्त्यमूढाः पदमव्ययं तत्\u200C৷৷";
                    desc="भावार्थ : जो मनुष्य मान-प्रतिष्ठा और मोह से मुक्त है तथा जिसने सांसारिक विषयों में लिप्त मनुष्यों की संगति को त्याग दिया है, जो निरन्तर परमात्म स्वरूप में स्थित रहता है, जिसकी सांसारिक कामनाएँ पूर्ण रूप से समाप्त हो चुकी है और जिसका सुख-दुःख नाम का भेद समाप्त हो गया है ऎसा मोह से मुक्त हुआ मनुष्य उस अविनाशी परम-पद (परम-धाम) को प्राप्त करता हैं";
                }else if(i==5){
                    name="न तद्भासयते सूर्यो न शशाङ्को न पावकः ।\n" +
                            "यद्गत्वा न निवर्तन्ते तद्धाम परमं मम৷৷";
                    desc="भावार्थ : उस परम-धाम को न तो सूर्य प्रकाशित करता है, न चन्द्रमा प्रकाशित करता है और न ही अग्नि प्रकाशित करती है, जहाँ पहुँचकर कोई भी मनुष्य इस संसार में वापस नहीं आता है वही मेरा परम-धाम है";
                }else if(i==6){
                    name="ममैवांशो जीवलोके जीवभूतः सनातनः ।\n" +
                            "मनः षष्ठानीन्द्रियाणि प्रकृतिस्थानि कर्षति৷৷";
                    desc="भावार्थ : हे अर्जुन! संसार में प्रत्येक शरीर में स्थित जीवात्मा मेरा ही सनातन अंश है, जो कि मन सहित छहों इन्द्रियों के द्वारा प्रकृति के अधीन होकर कार्य करता है";
                }else if(i==7){
                    name="शरीरं यदवाप्नोति यच्चाप्युत्क्रामतीश्वरः ।\n" +
                            "गृहीत्वैतानि संयाति वायुर्गन्धानिवाशयात्\u200C৷৷";
                    desc="भावार्थ : शरीर का स्वामी जीवात्मा छहों इन्द्रियों के कार्यों को संस्कार रूप में ग्रहण करके एक शरीर का त्याग करके दूसरे शरीर में उसी प्रकार चला जाता है जिस प्रकार वायु गन्ध को एक स्थान से ग्रहण करके दूसरे स्थान में ले जाती है";
                }else if(i==8){
                    name="श्रोत्रं चक्षुः स्पर्शनं च रसनं घ्राणमेव च ।\n" +
                            "अधिष्ठाय मनश्चायं विषयानुपसेवते৷৷";
                    desc="भावार्थ : इस प्रकार दूसरे शरीर में स्थित होकर जीवात्मा कान, आँख, त्वचा, जीभ, नाक और मन की सहायता से ही विषयों का भोग करता है";
                }else if(i==9){
                    name="उत्क्रामन्तं स्थितं वापि भुञ्जानं वा गुणान्वितम्\u200C ।\n" +
                            "विमूढा नानुपश्यन्ति पश्यन्ति ज्ञानचक्षुषः৷৷";
                    desc="भावार्थ : जीवात्मा शरीर का किस प्रकार त्याग कर सकती है, किस प्रकार शरीर में स्थित रहती है और किस प्रकार प्रकृति के गुणों के अधीन होकर विषयों का भोग करती है, मूर्ख मनुष्य कभी भी इस प्रक्रिया को नहीं देख पाते हैं केवल वही मनुष्य देख पाते हैं जिनकी आँखें ज्ञान के प्रकाश से प्रकाशित हो गयी हैं    ";
                }else if(i==10){
                    name="यतन्तो योगिनश्चैनं पश्यन्त्यात्मन्यवस्थितम्\u200C ।\n" +
                            "यतन्तोऽप्यकृतात्मानो नैनं पश्यन्त्यचेतसः৷৷";
                    desc="भावार्थ : योग के अभ्यास में प्रयत्नशील मनुष्य ही अपने हृदय में स्थित इस आत्मा को देख सकते हैं, किन्तु जो मनुष्य योग के अभ्यास में नहीं लगे हैं ऐसे अज्ञानी प्रयत्न करते रहने पर भी इस आत्मा को नहीं देख पाते हैं";
                }else if(i==11){
                    name="यदादित्यगतं तेजो जगद्भासयतेऽखिलम्\u200C ।\n" +
                            "यच्चन्द्रमसि यच्चाग्नौ तत्तेजो विद्धि मामकम्\u200C৷৷";
                    desc="भावार्थ : हे अर्जुन! जो प्रकाश सूर्य में स्थित है जिससे समस्त संसार प्रकाशित होता है, जो प्रकाश चन्द्रमा में स्थित है और जो प्रकाश अग्नि में स्थित है, उस प्रकाश को तू मुझसे ही उत्पन्न समझ";
                }else if(i==12){
                    name="गामाविश्य च भूतानि धारयाम्यहमोजसा ।\n" +
                            "पुष्णामि चौषधीः सर्वाः सोमो भूत्वा रसात्मकः৷৷";
                    desc="भावार्थ : मैं ही प्रत्येक लोक में प्रवेश करके अपनी शक्ति से सभी प्राणीयों को धारण करता हूँ और मैं ही चन्द्रमा के रूप से वनस्पतियों में जीवन-रस बनकर समस्त प्राणीयों का पोषण करता हूँ";
                }else if(i==13){
                    name="अहं वैश्वानरो भूत्वा प्राणिनां देहमाश्रितः ।\n" +
                            "प्राणापानसमायुक्तः पचाम्यन्नं चतुर्विधम्\u200C৷৷";
                    desc="भावार्थ : मैं ही पाचन-अग्नि के रूप में समस्त जीवों के शरीर में स्थित रहता हूँ, मैं ही प्राण वायु और अपान वायु को संतुलित रखते हुए चार प्रकार के (चबाने वाले, पीने वाले, चाटने वाले और चूसने वाले) अन्नों को पचाता हूँ";
                }else if(i==14){
                    name="सर्वस्य चाहं हृदि सन्निविष्टोमत्तः स्मृतिर्ज्ञानमपोहनं च ।\n" +
                            "वेदैश्च सर्वैरहमेव वेद्योवेदान्तकृद्वेदविदेव चाहम्\u200C ৷৷";
                    desc="भावार्थ : मैं ही समस्त जीवों के हृदय में आत्मा रूप में स्थित हूँ, मेरे द्वारा ही जीव को वास्तविक स्वरूप की स्मृति, विस्मृति और ज्ञान होता है, मैं ही समस्त वेदों के द्वारा जानने योग्य हूँ, मुझसे ही समस्त वेद उत्पन्न होते हैं और मैं ही समस्त वेदों को जानने वाला हूँ";
                }else if(i==15){
                    name="द्वाविमौ पुरुषौ लोके क्षरश्चाक्षर एव च ।\n" +
                            "क्षरः सर्वाणि भूतानि कूटस्थोऽक्षर उच्यते ৷৷";
                    desc="भावार्थ : हे अर्जुन! संसार में दो प्रकार के ही जीव होते हैं एक नाशवान (क्षर) और दूसरे अविनाशी (अक्षर), इनमें समस्त जीवों के शरीर तो नाशवान होते हैं और समस्त जीवों की आत्मा को अविनाशी कहा जाता है";
                }else if(i==16){
                    name="उत्तमः पुरुषस्त्वन्यः परमात्मेत्युदाहृतः ।\n" +
                            "यो लोकत्रयमाविश्य बिभर्त्यव्यय ईश्वरः৷৷";
                    desc="भावार्थ : परन्तु इन दोनों के अतिरिक्त एक श्रेष्ठ पुरुष है जिसे परमात्मा कहा जाता है, वह अविनाशी भगवान तीनों लोकों में प्रवेश करके सभी प्राणीयों का भरण-पोषण करता है";
                }else if(i==17){
                    name="यस्मात्क्षरमतीतोऽहमक्षरादपि चोत्तमः ।\n" +
                            "अतोऽस्मि लोके वेदे च प्रथितः पुरुषोत्तमः৷৷";
                    desc="भावार्थ : क्योंकि मैं ही क्षर और अक्षर दोनों से परे स्थित सर्वोत्तम हूँ, इसलिये इसलिए संसार में तथा वेदों में पुरुषोत्तम रूप में विख्यात हूँ";
                }else if(i==18){
                    name="यो मामेवमसम्मूढो जानाति पुरुषोत्तमम्\u200C ।\n" +
                            "स सर्वविद्भजति मां सर्वभावेन भारत ৷৷";
                    desc="भावार्थ : हे भरतवंशी अर्जुन! जो मनुष्य इस प्रकार मुझको संशय-रहित होकर भगवान रूप से जानता है, वह मनुष्य मुझे ही सब कुछ जानकर सभी प्रकार से मेरी ही भक्ति करता है";
                }else if(i==19){
                    name="इति गुह्यतमं शास्त्रमिदमुक्तं मयानघ ।\n" +
                            "एतद्\u200Dबुद्ध्वा बुद्धिमान्स्यात्कृतकृत्यश्च भारत ৷৷";
                    desc="भावार्थ : हे निष्पाप अर्जुन! इस प्रकार यह शास्त्रों का अति गोपनीय रहस्य मेरे द्वारा कहा गया है, हे भरतवंशी जो मनुष्य इस परम-ज्ञान को इसी प्रकार से समझता है वह बुद्धिमान हो जाता है और उसके सभी प्रयत्न पूर्ण हो जाते हैं";
                }
            }else if(n==15){
                if(i==0){
                    name="अभयं सत्त्वसंशुद्धि-र्ज्ञानयोगव्यवस्थितिः । \n" +
                            "दानं दमश्च यज्ञश्च स्वाध्यायस्तप आर्जवम् ॥";
                    desc="श्री भगवान बोले- भय का सर्वथा अभाव, अन्तःकरण की पूर्ण निर्मलता, तत्त्वज्ञान के लिए ध्यान योग में निरन्तर दृढ़ स्थिति और सात्त्विक दान, इन्द्रियों का दमन, भगवान, देवता और गुरुजनों की पूजा तथा अग्निहोत्र आदि उत्तम कर्मों का आचरण एवं वेद-शास्त्रों का पठन-पाठन तथा भगवान्\u200C के नाम और गुणों का कीर्तन, स्वधर्म पालन के लिए कष्टसहन और शरीर तथा इन्द्रियों के सहित अन्तःकरण की सरलता";
                }else if(i==1){
                    name="अहिंसा सत्यमक्रोधस्-त्यागः शान्तिरपैशुनम् ।\n" +
                            "दया भूतेष्वलोलुप्त्वं मार्दवं ह्रीरचापलम् ॥";
                    desc="मन, वाणी और शरीर से किसी प्रकार भी किसी को कष्ट न देना, यथार्थ और प्रिय भाषण (अन्तःकरण और इन्द्रियों के द्वारा जैसा निश्चय किया हो, वैसे-का-वैसा ही प्रिय शब्दों में कहने का नाम 'सत्यभाषण' है), अपना अपकार करने वाले पर भी क्रोध का न होना, कर्मों में कर्तापन के अभिमान का त्याग, अन्तःकरण की उपरति अर्थात्\u200C चित्त की चञ्चलता का अभाव, किसी की भी निन्दादि न करना, सब भूतप्राणियों में हेतुरहित दया, इन्द्रियों का विषयों के साथ संयोग होने पर भी उनमें आसक्ति का न होना, कोमलता, लोक और शास्त्र से विरुद्ध आचरण में लज्जा और व्यर्थ चेष्टाओं का अभाव";
                }else if(i==2){
                    name="क्षमा धृतिः शौचमद्रोहो नातिमानिता ।\n" +
                            "भवन्ति संपदं दैवीम-भिजातस्य भारत ॥";
                    desc="तेज (श्रेष्ठ पुरुषों की उस शक्ति का नाम 'तेज' है कि जिसके प्रभाव से उनके सामने विषयासक्त और नीच प्रकृति वाले मनुष्य भी प्रायः अन्यायाचरण से रुककर उनके कथनानुसार श्रेष्ठ कर्मों में प्रवृत्त हो जाते हैं), क्षमा, धैर्य, बाहर की शुद्धि एवं किसी में भी शत्रुभाव का न होना और अपने में पूज्यता के अभिमान का अभाव- ये सब तो हे अर्जुन! दैवी सम्पदा को लेकर उत्पन्न हुए पुरुष के लक्षण हैं";
                }else if(i==3){
                    name="दम्भो दर्पोऽभिमानश्च क्रोधः पारुष्यमेव च ।\n" +
                            "अज्ञानं चाभिजातस्य पार्थ संपदमासुरीम् ॥";
                    desc="हे पार्थ! दम्भ, घमण्ड और अभिमान तथा क्रोध, कठोरता और अज्ञान भी- ये सब आसुरी सम्पदा को लेकर उत्पन्न हुए पुरुष के लक्षण हैं";
                }else if(i==4){
                    name="दैवी संपद्विमोक्षाय निबन्धायासुरी मता ।\n" +
                            "मा शुचः संपदं दैवीम-भिजातोऽसि पाण्डव ॥";
                    desc="दैवी सम्पदा मुक्ति के लिए और आसुरी सम्पदा बाँधने के लिए मानी गई है। इसलिए हे अर्जुन! तू शोक मत कर, क्योंकि तू दैवी सम्पदा को लेकर उत्पन्न हुआ है";
                }else if(i==5){
                    name="द्वौ भूतसर्गौ लोकेऽ-स्मिन्दैव आसुर एव च ।\n" +
                            "दैवो विस्तरशः प्रोक्त आसुरं पार्थ मे शृणु ॥";
                    desc="हे अर्जुन! इस लोक में भूतों की सृष्टि यानी मनुष्य समुदाय दो ही प्रकार का है, एक तो दैवी प्रकृति वाला और दूसरा आसुरी प्रकृति वाला। उनमें से दैवी प्रकृति वाला तो विस्तारपूर्वक कहा गया, अब तू आसुरी प्रकृति वाले मनुष्य समुदाय को भी विस्तारपूर्वक मुझसे सुन";
                }else if(i==6){
                    name="प्रवृत्तिं च निवृत्तिं च जना न विदुरासुराः ।\n" +
                            "न शौचं नापि चाचारो न सत्यं तेषु विद्यते ॥";
                    desc="आसुर स्वभाव वाले मनुष्य प्रवृत्ति और निवृत्ति- इन दोनों को ही नहीं जानते। इसलिए उनमें न तो बाहर-भीतर की शुद्धि है, न श्रेष्ठ आचरण है और न सत्य भाषण ही है";
                }else if(i==7){
                    name="असत्यमप्रतिष्ठं ते जगदाहुरनीश्वरम् ।\n" +
                            "अपरस्परसंभूतं किमन्यत्कामहैतुकम् ॥";
                    desc="वे आसुरी प्रकृति वाले मनुष्य कहा करते हैं कि जगत्\u200C आश्रयरहित, सर्वथा असत्य और बिना ईश्वर के, अपने-आप केवल स्त्री-पुरुष के संयोग से उत्पन्न है, अतएव केवल काम ही इसका कारण है। इसके सिवा और क्या है?";
                }else if(i==8){
                    name="एतां दृष्टिमवष्टभ्य नष्टात्मानोऽल्पबुद्धयः ।\n" +
                            "प्रभवन्त्युग्रकर्माणः क्षयाय जगतोऽहिताः ॥";
                    desc="इस मिथ्या ज्ञान को अवलम्बन करके- जिनका स्वभाव नष्ट हो गया है तथा जिनकी बुद्धि मन्द है, वे सब अपकार करने वाले क्रुरकर्मी मनुष्य केवल जगत्\u200C के नाश के लिए ही समर्थ होते हैं";
                }else if(i==9){
                    name="काममाश्रित्य दुष्पूरं दम्भमानमदान्विताः ।\n" +
                            "मोहाद्\u200Cगृहीत्वासद्ग्राहान्-प्रवर्तन्तेऽशुचिव्रताः ॥";
                    desc="वे दम्भ, मान और मद से युक्त मनुष्य किसी प्रकार भी पूर्ण न होने वाली कामनाओं का आश्रय लेकर, अज्ञान से मिथ्या सिद्धांतों को ग्रहण करके भ्रष्ट आचरणों को धारण करके संसार में विचरते हैं";
                }else if(i==10){
                    name="चिन्तामपरिमेयां च प्रलयान्तामुपाश्रिताः ।\n" +
                            "कामोपभोगपरमा एतावदिति निश्चिताः ॥";
                    desc="तथा वे मृत्युपर्यन्त रहने वाली असंख्य चिन्ताओं का आश्रय लेने वाले, विषयभोगों के भोगने में तत्पर रहने वाले और 'इतना ही सुख है' इस प्रकार मानने वाले होते हैं";
                }else if(i==11){
                    name="आशापाशशतैर्बद्धाः कामक्रोधपरायणाः ।\n" +
                            "ईहन्ते कामभोगार्थमन्-यायेनार्थसञ्चयान् ॥";
                    desc="वे आशा की सैकड़ों फाँसियों से बँधे हुए मनुष्य काम-क्रोध के परायण होकर विषय भोगों के लिए अन्यायपूर्वक धनादि पदार्थों का संग्रह करने की चेष्टा करते हैं॥";
                }else if(i==12){
                    name="इदमद्य मया लब्धमिमं प्राप्स्ये मनोरथम् ।\n" +
                            "इदमस्तीदमपि मे भविष्यति पुनर्धनम् ॥";
                    desc="वे सोचा करते हैं कि मैंने आज यह प्राप्त कर लिया है और अब इस मनोरथ को प्राप्त कर लूँगा। मेरे पास यह इतना धन है और फिर भी यह हो जाएगा";
                }else if(i==13){
                    name="असौ मया हतः शत्रुर्हनिष्ये चापरानपि ।\n" +
                            "ईश्वरोऽहमहं भोगी सिद्धोऽहं बलवान्सुखी ॥";
                    desc="वे सोचा करते हैं कि मैंने आज यह प्राप्त कर लिया है और अब इस मनोरथ को प्राप्त कर लूँगा। मेरे पास यह इतना धन है और फिर भी यह हो जाएगा";
                }else if(i==14){
                    name="आढ्योऽभिजनवानस्मि कोऽन्योऽस्ति सदृशो मया ।\n" +
                            "यक्ष्ये दास्यामि मोदिष्य इत्यज्ञानविमोहिताः ॥";
                    desc="मैं बड़ा धनी और बड़े कुटुम्ब वाला हूँ। मेरे समान दूसरा कौन है? मैं यज्ञ करूँगा, दान दूँगा और आमोद-प्रमोद करूँगा। इस प्रकार अज्ञान से मोहित रहने वाले तथा अनेक प्रकार से भ्रमित चित्त वाले मोहरूप जाल से समावृत और विषयभोगों में अत्यन्त आसक्त आसुरलोग महान्\u200C अपवित्र नरक में गिरते हैं॥";
                }else if(i==15){
                    name="अनेकचित्तविभ्रान्ता मोहजालसमावृताः ।\n" +
                            "प्रसक्ताः कामभोगेषु पतन्ति नरकेऽशुचौ";
                    desc="";
                }else if(i==16){
                    name="आत्मसंभाविताः स्तब्धा धनमानमदान्विताः ।\n" +
                            "यजन्ते नामयज्ञैस्ते दम्भेनाविधिपूर्वकम्";
                    desc="वे अपने-आपको ही श्रेष्ठ मानने वाले घमण्डी पुरुष धन और मान के मद से युक्त होकर केवल नाममात्र के यज्ञों द्वारा पाखण्ड से शास्त्रविधिरहित यजन करते हैं";
                }else if(i==17){
                    name="अहंकारं बलं दर्पं कामं क्रोधं च संश्रिताः ।\n" +
                            "मामात्मपरदेहेषु प्रद्विषन्तोऽभ्यसूयकाः ॥";
                    desc="वे अहंकार, बल, घमण्ड, कामना और क्रोधादि के परायण और दूसरों की निन्दा करने वाले पुरुष अपने और दूसरों के शरीर में स्थित मुझ अन्तर्यामी से द्वेष करने वाले होते हैं";
                }else if(i==18){
                    name="तानहं द्विषतः क्रुरान्-संसारेषु नराधमान् ।\n" +
                            "क्षिपाम्यजस्रमशुभाना-सुरीष्वेव योनिषु ॥";
                    desc="उन द्वेष करने वाले पापाचारी और क्रूरकर्मी नराधमों को मैं संसार में बार-बार आसुरी योनियों में ही डालता हूँ॥";
                }else if(i==19){
                    name="आसुरीं योनिमापन्ना मूढा जन्मनि जन्मनि ।\n" +
                            "मामप्राप्यैव कौन्तेय ततो यान्त्यधमां गतिम् ॥";
                    desc="हे अर्जुन! वे मूढ़ मुझको न प्राप्त होकर ही जन्म-जन्म में आसुरी योनि को प्राप्त होते हैं, फिर उससे भी अति नीच गति को ही प्राप्त होते हैं अर्थात्\u200C घोर नरकों में पड़ते हैं";
                }else if(i==20){
                    name="त्रिविधं नरकस्येदं द्वारं नाशनमात्मनः ।\n" +
                            "कामः क्रोधस्तथा लोभस्-तस्मादेतत्त्रयं त्यजेत् ";
                    desc="काम, क्रोध तथा लोभ- ये तीन प्रकार के नरक के द्वार ( सर्व अनर्थों के मूल और नरक की प्राप्ति में हेतु होने से यहाँ काम, क्रोध और लोभ को 'नरक के द्वार' कहा है) आत्मा का नाश करने वाले अर्थात्\u200C उसको अधोगति में ले जाने वाले हैं। अतएव इन तीनों को त्याग देना चाहिए";
                }else if(i==21){
                    name="एतैर्विमुक्तः कौन्तेय तमोद्वारैस्त्रिभिर्नरः ।\n" +
                            "आचरत्यात्मनः श्रेयस्-ततो याति परां गतिम्";
                    desc="हे अर्जुन! इन तीनों नरक के द्वारों से मुक्त पुरुष अपने कल्याण का आचरण करता है (अपने उद्धार के लिए भगवदाज्ञानुसार बरतना ही 'अपने कल्याण का आचरण करना' है), इससे वह परमगति को जाता है अर्थात्\u200C मुझको प्राप्त हो जाता है";
                }else if(i==22){
                    name="यः शास्त्रविधिमुत्सृज्य वर्तते कामकारतः ।\n" +
                            "न स सिद्धिमवाप्नोति न सुखं न परां गतिम् ";
                    desc="जो पुरुष शास्त्र विधि को त्यागकर अपनी इच्छा से मनमाना आचरण करता है, वह न सिद्धि को प्राप्त होता है, न परमगति को और न सुख को ही";
                }else if(i==23){
                    name="तस्माच्छास्त्रं प्रमाणं ते कार्याकार्यव्यवस्थितौ ।\n" +
                            "ज्ञात्वा शास्त्रविधानोक्तं कर्म कर्तुमिहार्हसि ॥";
                    desc="इससे तेरे लिए इस कर्तव्य और अकर्तव्य की व्यवस्था में शास्त्र ही प्रमाण है। ऐसा जानकर तू शास्त्र विधि से नियत कर्म ही करने योग्य है";
                }
                if(desc!=null){
                    desc="भावार्थ : "+desc;
                }
            }else if(n==16){
                if(i==0){
                    name="ये शास्त्रविधिमुत्सृज्य यजन्ते श्रद्धयान्विताः । \n" +
                            "तेषां निष्ठा तु का कृष्ण सत्त्वमाहो रजस्तमः ॥";
                    desc="अर्जुन बोले- हे कृष्ण! जो मनुष्य शास्त्र विधि को त्यागकर श्रद्धा से युक्त हुए देवादिका पूजन करते हैं, उनकी स्थिति फिर कौन-सी है? सात्त्विकी है अथवा राजसी किंवा तामसी?";
                }else if(i==1){
                    name="श्रीभगवानुवाच - त्रिविधा भवति श्रद्धा देहिनां सा स्वभावजा । \n" +
                            "सात्त्विकी राजसी चैव तामसी चेति तां शृणु ॥";
                    desc="श्री भगवान्\u200C बोले- मनुष्यों की वह शास्त्रीय संस्कारों से रहित केवल स्वभाव से उत्पन्न श्रद्धा (अनन्त जन्मों में किए हुए कर्मों के सञ्चित संस्कार से उत्पन्न हुई श्रद्धा ''स्वभावजा'' श्रद्धा कही जाती है।) सात्त्विकी और राजसी तथा तामसी- ऐसे तीनों प्रकार की ही होती है। उसको तू मुझसे सुन";
                }else if(i==2){
                    name="सत्त्वानुरूपा सर्वस्य श्रद्धा भवति भारत ।\n" +
                            "श्रद्धामयोऽयं पुरुषो यो यच्छ्रद्धः स एव सः ॥";
                    desc="\tहे भारत! सभी मनुष्यों की श्रद्धा उनके अन्तःकरण के अनुरूप होती है। यह पुरुष श्रद्धामय है, इसलिए जो पुरुष जैसी श्रद्धावाला है, वह स्वयं भी वही है";
                }else if(i==3){
                    name="यजन्ते सात्त्विका देवान्-यक्षरक्षांसि राजसाः ।\n" +
                            "प्रेतान्भूतगणांश्चान्ये यजन्ते तामसा जनाः ॥";
                    desc="सात्त्विक पुरुष देवों को पूजते हैं, राजस पुरुष यक्ष और राक्षसों को तथा अन्य जो तामस मनुष्य हैं, वे प्रेत और भूतगणों को पूजते हैं";
                }else if(i==4){
                    name="अशास्त्रविहितं घोरं तप्यन्ते ये तपो जनाः ।\n" +
                            "दम्भाहंकारसंयुक्ताः कामरागबलान्विताः ॥";
                    desc="जो मनुष्य शास्त्र विधि से रहित केवल मनःकल्पित घोर तप को तपते हैं तथा दम्भ और अहंकार से युक्त एवं कामना, आसक्ति और बल के अभिमान से भी युक्त हैं";
                }else if(i==5){
                    name="कर्षयन्तः शरीरस्थं भूतग्राममचेतसः ।\n" +
                            "मां चैवान्तःशरीरस्थं तान्विद्ध्यासुरनिश्चयान् ॥";
                    desc="जो शरीर रूप से स्थित भूत समुदाय को और अन्तःकरण में स्थित मुझ परमात्मा को भी कृश करने वाले हैं (शास्त्र से विरुद्ध उपवासादि घोर आचरणों द्वारा शरीर को सुखाना एवं भगवान्\u200C के अंशस्वरूप जीवात्मा को क्लेश देना, भूत समुदाय को और अन्तर्यामी परमात्मा को ''कृश करना'' है।), उन अज्ञानियों को तू आसुर स्वभाव वाले जान";
                }else if(i==6){
                    name="आहारस्त्वपि सर्वस्य त्रिविधो भवति प्रियः ।\n" +
                            "यज्ञस्तपस्तथा दानं तेषां भेदमिमं शृणु ॥";
                    desc="भोजन भी सबको अपनी-अपनी प्रकृति के अनुसार तीन प्रकार का प्रिय होता है। और वैसे ही यज्ञ, तप और दान भी तीन-तीन प्रकार के होते हैं। उनके इस पृथक्\u200C-पृथक्\u200C भेद को तू मुझ से सुन";
                }else if(i==7){
                    name="आयुःसत्त्वबलारोग्य सुखप्रीतिविवर्धनाः ।\n" +
                            "रस्याः स्निग्धाः स्थिरा हृद्या आहाराः सात्त्विकप्रियाः ॥";
                    desc="आयु, बुद्धि, बल, आरोग्य, सुख और प्रीति को बढ़ाने वाले, रसयुक्त, चिकने और स्थिर रहने वाले (जिस भोजन का सार शरीर में बहुत काल तक रहता है, उसको स्थिर रहने वाला कहते हैं।) तथा स्वभाव से ही मन को प्रिय- ऐसे आहार अर्थात्\u200C भोजन करने के पदार्थ सात्त्विक पुरुष को प्रिय होते हैं";
                }else if(i==8){
                    name="कट्\u200Cवम्ललवणात्युष्ण-तीक्ष्णरूक्षविदाहिनः ।\n" +
                            "आहारा राजसस्येष्टा- दुःखशोकामयप्रदाः ॥";
                    desc="कड़वे, खट्टे, लवणयुक्त, बहुत गरम, तीखे, रूखे, दाहकारक और दुःख, चिन्ता तथा रोगों को उत्पन्न करने वाले आहार अर्थात्\u200C भोजन करने के पदार्थ राजस पुरुष को प्रिय होते हैं";
                }else if(i==9){
                    name="यातयामं गतरसं पूति पर्युषितं च यत् ।\n" +
                            "उच्छिष्टमपि चामेध्यं भोजनं तामसप्रियम् ॥";
                    desc="जो भोजन अधपका, रसरहित, दुर्गन्धयुक्त, बासी और उच्छिष्ट है तथा जो अपवित्र भी है, वह भोजन तामस पुरुष को प्रिय होता है";
                }else if(i==10){
                    name="अफलाकाङ्क्षिभिर्यज्ञो विधिदृष्टो य इज्यते ।\n" +
                            "यष्टव्यमेवेति मनः समाधाय स सात्त्विकः ॥";
                    desc="जो शास्त्र विधि से नियत, यज्ञ करना ही कर्तव्य है- इस प्रकार मन को समाधान करके, फल न चाहने वाले पुरुषों द्वारा किया जाता है, वह सात्त्विक है";
                }else if(i==11){
                    name="अभिसंधाय तु फलं दम्भार्थमपि चैव यत् ।\n" +
                            "इज्यते भरतश्रेष्ठ तं यज्ञं विद्धि राजसम् ॥";
                    desc="परन्तु हे अर्जुन! केवल दम्भाचरण के लिए अथवा फल को भी दृष्टि में रखकर जो यज्ञ किया जाता है, उस यज्ञ को तू राजस जान";
                }else if(i==12){
                    name="विधिहीनमसृष्टान्नं मन्त्रहीनमदक्षिणम् ।\n" +
                            "श्रद्धाविरहितं यज्ञं तामसं परिचक्षते ॥";
                    desc="शास्त्रविधि से हीन, अन्नदान से रहित, बिना मन्त्रों के, बिना दक्षिणा के और बिना श्रद्धा के किए जाने वाले यज्ञ को तामस यज्ञ कहते हैं";
                }else if(i==13){
                    name="देवद्विजगुरुप्राज्ञपूजनं शौचमार्जवम् ।\n" +
                            "ब्रह्मचर्यमहिंसा च शारीरं तप उच्यते ॥";
                    desc="देवता, ब्राह्मण, गुरु (यहाँ 'गुरु' शब्द से माता, पिता, आचार्य और वृद्ध एवं अपने से जो किसी प्रकार भी बड़े हों, उन सबको समझना चाहिए।) और ज्ञानीजनों का पूजन, पवित्रता, सरलता, ब्रह्मचर्य और अहिंसा- यह शरीर- सम्बन्धी तप कहा जाता है";
                }else if(i==14){
                    name="अनुद्वेगकरं वाक्यं सत्यं प्रियहितं च यत् ।\n" +
                            "स्वाध्यायाभ्यसनं चैव वाङ्मयं तप उच्यते ॥";
                    desc="जो उद्वेग न करने वाला, प्रिय और हितकारक एवं यथार्थ भाषण है (मन और इन्द्रियों द्वारा जैसा अनुभव किया हो, ठीक वैसा ही कहने का नाम 'यथार्थ भाषण' है।) तथा जो वेद-शास्त्रों के पठन का एवं परमेश्वर के नाम-जप का अभ्यास है- वही वाणी-सम्बन्धी तप कहा जाता है";
                }else if(i==15){
                    name="मनः प्रसादः सौम्यत्वं मौनमात्मविनिग्रहः ।\n" +
                            "भावसंशुद्धिरित्येतत्तपो मानसमुच्यते ॥";
                    desc="मन की प्रसन्नता, शान्तभाव, भगवच्चिन्तन करने का स्वभाव, मन का निग्रह और अन्तःकरण के भावों की भलीभाँति पवित्रता, इस प्रकार यह मन सम्बन्धी तप कहा जाता है";
                }else if(i==16){
                    name="श्रद्धया परया तप्तं तपस्-तत्त्रिविधं नरैः ।\n" +
                            "अफलाकाङ्क्षिभिर्युक्तैः सात्त्विकं परिचक्षते ॥";
                    desc="फल को न चाहने वाले योगी पुरुषों द्वारा परम श्रद्धा से किए हुए उस पूर्वोक्त तीन प्रकार के तप को सात्त्विक कहते हैं";
                }else if(i==17){
                    name="सत्कारमानपूजार्थं तपो दम्भेन चैव यत् ।\n" +
                            "क्रियते तदिह प्रोक्तं राजसं चलमध्रुवम् ॥";
                    desc="जो तप सत्कार, मान और पूजा के लिए तथा अन्य किसी स्वार्थ के लिए भी स्वभाव से या पाखण्ड से किया जाता है, वह अनिश्चित ('अनिश्चित फलवाला' उसको कहते हैं कि जिसका फल होने न होने में शंका हो।) एवं क्षणिक फलवाला तप यहाँ राजस कहा गया है";
                }else if(i==18){
                    name="मूढग्राहेणात्मनो यत्पीडया क्रियते तपः ।\n" +
                            "परस्योत्सादनार्थं वा तत्तामसमुदाहृतम् ॥";
                    desc="जो तप मूढ़तापूर्वक हठ से, मन, वाणी और शरीर की पीड़ा के सहित अथवा दूसरे का अनिष्ट करने के लिए किया जाता है- वह तप तामस कहा गया है";
                }else if(i==19){
                    name="दातव्यमिति यद्दानं दीयतेऽनुपकारिणे ।\n" +
                            "देशे काले च पात्रे च तद्दानं सात्त्विकं स्मृतम् ॥";
                    desc="दान देना ही कर्तव्य है- ऐसे भाव से जो दान देश तथा काल (जिस देश-काल में जिस वस्तु का अभाव हो, वही देश-काल, उस वस्तु द्वारा प्राणियों की सेवा करने के लिए योग्य समझा जाता है।) और पात्र के (भूखे, अनाथ, दुःखी, रोगी और असमर्थ तथा भिक्षुक आदि तो अन्न, वस्त्र और ओषधि एवं जिस वस्तु का जिसके पास अभाव हो, उस वस्तु द्वारा सेवा करने के लिए योग्य पात्र समझे जाते हैं और श्रेष्ठ आचरणों वाले विद्वान्\u200C ब्राह्मणजन धनादि सब प्रकार के पदार्थों द्वारा सेवा करने के लिए योग्य पात्र समझे जाते हैं।) प्राप्त होने पर उपकार न करने वाले के प्रति दिया जाता है, वह दान सात्त्विक कहा गया है";
                }else if(i==20){
                    name="यत्तु प्रत्युपकारार्थं फलमुद्दिश्य वा पुनः ।\n" +
                            "दीयते च परिक्लिष्टं तद्दानं राजसं स्मृतम् ॥";
                    desc="किन्तु जो दान क्लेशपूर्वक (जैसे प्रायः वर्तमान समय के चन्दे-चिट्ठे आदि में धन दिया जाता है।) तथा प्रत्युपकार के प्रयोजन से अथवा फल को दृष्टि में (अर्थात्\u200C मान बड़ाई, प्रतिष्ठा और स्वर्गादि की प्राप्ति के लिए अथवा रोगादि की निवृत्ति के लिए।) रखकर फिर दिया जाता है, वह दान राजस कहा गया है";
                }else if(i==21){
                    name="अदेशकाले यद्दानम-पात्रेभ्यश्च दीयते ।\n" +
                            "असत्कृतमवज्ञातं तत्तामसमुदाहृतम् ॥";
                    desc="जो दान बिना सत्कार के अथवा तिरस्कारपूर्वक अयोग्य देश-काल में और कुपात्र के प्रति दिया जाता है, वह दान तामस कहा गया है";
                }else if(i==22){
                    name="ॐतत्सदिति निर्देशो ब्रह्मणस्त्रिविधः स्मृतः ।\n" +
                            "ब्राह्मणास्तेन वेदाश्च यज्ञाश्च विहिताः पुरा ॥";
                    desc="ॐ, तत्\u200C, सत्\u200C-ऐसे यह तीन प्रकार का सच्चिदानन्दघन ब्रह्म का नाम कहा है, उसी से सृष्टि के आदिकाल में ब्राह्मण और वेद तथा यज्ञादि रचे गए";
                }else if(i==23){
                    name="तस्मादोमित्युदाहृत्य यज्ञदानतपःक्रियाः ।\n" +
                            "प्रवर्तन्ते विधानोक्ताः सततं ब्रह्मवादिनाम् ॥";
                    desc="इसलिए वेद-मन्त्रों का उच्चारण करने वाले श्रेष्ठ पुरुषों की शास्त्र विधि से नियत यज्ञ, दान और तपरूप क्रियाएँ सदा 'ॐ' इस परमात्मा के नाम को उच्चारण करके ही आरम्भ होती हैं";
                }else if(i==24){
                    name="तदित्यनभिसन्धाय फलं यज्ञतपःक्रियाः ।\n" +
                            "दानक्रियाश्च विविधाः क्रियन्ते मोक्षकाङ्क्षिभिः ॥";
                    desc="तत्\u200C अर्थात्\u200C 'तत्\u200C' नाम से कहे जाने वाले परमात्मा का ही यह सब है- इस भाव से फल को न चाहकर नाना प्रकार के यज्ञ, तपरूप क्रियाएँ तथा दानरूप क्रियाएँ कल्याण की इच्छा वाले पुरुषों द्वारा की जाती हैं";
                }else if(i==25){
                    name="सद्भावे साधुभावे च सदित्येतत्प्रयुज्यते ।\n" +
                            "प्रशस्ते कर्मणि तथा सच्छब्दः पार्थ युज्यते ॥";
                    desc="'सत्\u200C'- इस प्रकार यह परमात्मा का नाम सत्यभाव में और श्रेष्ठभाव में प्रयोग किया जाता है तथा हे पार्थ! उत्तम कर्म में भी 'सत्\u200C' शब्द का प्रयोग किया जाता है";
                }else if(i==26){
                    name="यज्ञे तपसि दाने च स्थितिः सदिति चोच्यते ।\n" +
                            "कर्म चैव तदर्थीयं सदित्येवाभिधीयते ॥";
                    desc="तथा यज्ञ, तप और दान में जो स्थिति है, वह भी 'सत्\u200C' इस प्रकार कही जाती है और उस परमात्मा के लिए किया हुआ कर्म निश्चयपूर्वक सत्\u200C-ऐसे कहा जाता है॥";
                }else if(i==27){
                    name="अश्रद्धया हुतं दत्तं तपस्-तप्तं कृतं च यत् ।\n" +
                            "असदित्युच्यते पार्थ न च तत्प्रेत्य नो इह ॥";
                    desc="हे अर्जुन! बिना श्रद्धा के किया हुआ हवन, दिया हुआ दान एवं तपा हुआ तप और जो कुछ भी किया हुआ शुभ कर्म है- वह समस्त 'असत्\u200C'- इस प्रकार कहा जाता है, इसलिए वह न तो इस लोक में लाभदायक है और न मरने के बाद ही";
                }
                if(desc!=null){
                    desc="भावार्थ : "+desc;
                }
            }else if(n==17){
                if(i==0){
                    name="संन्यासस्य महाबाहो तत्त्वमिच्छामि वेदितुम् । \n" +
                            "त्यागस्य च हृषीकेश पृथक्केशिनिषूदन ॥";
                    desc="अर्जुन कहते हैं - हे महाबाहो! हे अन्तर्यामिन्\u200C! हे वासुदेव! मैं संन्यास और त्याग के तत्त्व को अलग-अलग जानना चाहता हूँ";
                }else if(i==1){
                    name="काम्यानां कर्मणां न्यासं संन्यासं कवयो विदुः । \n" +
                            "सर्वकर्मफलत्यागं प्राहुस्त्यागं विचक्षणाः ॥";
                    desc="श्री भगवान कहते हैं - कुछ कवि (विद्वान) तो काम्य कर्मों के त्याग को संन्यास समझते हैं पर दूसरे विचारक सभी कर्मों के फल-त्याग को त्याग कहते हैं";
                }else if(i==2){
                    name="त्याज्यं दोषवदित्येके कर्म प्राहुर्मनीषिणः ।\n" +
                            "यज्ञदानतपःकर्म न त्याज्यमिति चापरे ॥";
                    desc="कुछ मनीषी कहते हैं कि सभी कर्म दोषयुक्त हैं, इसलिए त्यागने योग्य हैं और दूसरे कहते हैं कि यज्ञ, दान और तप जैसे रूपी कर्म त्यागने योग्य नहीं हैं";
                }else if(i==3){
                    name="निश्चयं शृणु मे तत्र त्यागे भरतसत्तम ।\n" +
                            "त्यागो हि पुरुषव्याघ्र त्रिविधः संप्रकीर्तितः ॥";
                    desc="हे भरतश्रेष्ठ अर्जुन! इस विषय में त्याग के सम्बन्ध में मेरा निश्चय सुनो। हे पुरुषसिंह त्याग तीन (सात्विक, राजस और तामस) प्रकार का कहा गया है";
                }else if(i==4){
                    name="यज्ञदानतपःकर्म न त्याज्यं कार्यमेव तत् ।\n" +
                            "यज्ञो दानं तपश्चैव पावनानि मनीषिणाम् ॥";
                    desc="यज्ञ, दान और तप रूपी कर्म त्याग करने के योग्य नहीं है, वे तो अवश्य करने चाहिए क्योंकि यज्ञ, दान और तप मनीषियों को भी पवित्र करने वाले हैं";
                }else if(i==5){
                    name="एतान्यपि तु कर्माणि सङ्गं त्यक्त्वा फलानि च ।\n" +
                            "कर्तव्यानीति मे पार्थ निश्चितं मतमुत्तमम् ॥";
                    desc="इसलिए हे पार्थ! इन यज्ञ, दान और तपरूप कर्मों को तथा और भी सम्पूर्ण कर्तव्यकर्मों को आसक्ति और फलों का त्याग करके अवश्य करना चाहिए, यह मेरा निश्चय किया हुआ उत्तम मत है";
                }else if(i==6){
                    name="नियतस्य तु संन्यासः कर्मणो नोपपद्यते ।\n" +
                            "मोहात्तस्य परित्यागस्-तामसः परिकीर्तितः ॥";
                    desc="स्वरूप से त्याग करना उचित नहीं है। इसलिए मोह के कारण उसका त्याग कर देना तामस त्याग कहा गया है";
                }else if(i==7){
                    name="दुःखमित्येव यत्कर्म कायक्लेशभयात्त्यजेत् ।\n" +
                            "स कृत्वा राजसं त्यागं नैव त्यागफलं लभेत् ॥";
                    desc="जो कुछ कर्म है वह सब दुःखरूप ही है- ऐसा समझकर यदि कोई शारीरिक क्लेश के भय से कर्तव्य-कर्मों का त्याग कर दे, तो वह ऐसा राजस त्याग करके त्याग के फल को किसी प्रकार भी नहीं पाता";
                }else if(i==8){
                    name="कार्यमित्येव यत्कर्म नियतं क्रियतेऽर्जुन ।\n" +
                            "सङ्गं त्यक्त्वा फलं चैव स त्यागः सात्त्विको मतः ॥";
                    desc="हे अर्जुन! जो शास्त्रविहित कर्म करना कर्तव्य है- इसी भाव से आसक्ति और फल का त्याग करके किया जाता है- वही सात्त्विक त्याग माना गया है";
                }else if(i==9){
                    name="न द्वेष्ट्यकुशलं कर्म कुशले नानुषज्जते ।\n" +
                            "त्यागी सत्त्वसमाविष्टो मेधावी छिन्नसंशयः ॥";
                    desc="जो मनुष्य अकुशल कर्म से तो द्वेष नहीं करता और कुशल कर्म में आसक्त नहीं होता- वह शुद्ध सत्त्वगुण से युक्त पुरुष संशयरहित, बुद्धिमान और सच्चा त्यागी है";
                }else if(i==10){
                    name="न हि देहभृता शक्यं त्यक्तुं कर्माण्यशेषतः ।\n" +
                            "यस्तु कर्मफलत्यागी स त्यागीत्यभिधीयते ॥";
                    desc="क्योंकि शरीरधारी किसी भी मनुष्य द्वारा सम्पूर्णता से सब कर्मों का त्याग किया जाना शक्य नहीं है, इसलिए जो कर्मफल त्यागी है, वही त्यागी है- यह कहा जाता है";
                }else if(i==11){
                    name="अनिष्टमिष्टं मिश्रं च त्रिविधं कर्मणः फलम् ।\n" +
                            "भवत्यत्यागिनां प्रेत्य न तु संन्यासिनां क्वचित् ॥";
                    desc="कर्मफल का त्याग न करने वाले मनुष्यों के कर्मों का तो अच्छा, बुरा और मिला हुआ- ऐसे तीन प्रकार का फल मरने के पश्चात अवश्य होता है, किन्तु कर्मफल का त्याग कर देने वाले मनुष्यों के कर्मों का फल किसी काल में भी नहीं होता";
                }else if(i==12){
                    name="पञ्चैतानि महाबाहो कारणानि निबोध मे ।\n" +
                            "सांख्ये कृतान्ते प्रोक्तानि सिद्धये सर्वकर्मणाम् ॥";
                    desc="हे महाबाहो! सम्पूर्ण कर्मों की सिद्धि के ये पाँच हेतु कर्मों का अंत करने के लिए उपाय बतलाने वाले सांख्य-शास्त्र में कहे गए हैं, उनको तू मुझसे भलीभाँति जान॥";
                }else if(i==13){
                    name="अधिष्ठानं तथा कर्ता करणं च पृथग्विधम् ।\n" +
                            "विविधाश्च पृथक्चेष्टा दैवं चैवात्र पञ्चमम् ॥";
                    desc="इस विषय में अर्थात कर्मों की सिद्धि में अधिष्ठान (जिसके आश्रय कर्म किए जाएँ, उसका नाम अधिष्ठान है) और कर्ता तथा भिन्न-भिन्न प्रकार के करण (जिन-जिन इंद्रियादिकों और साधनों द्वारा कर्म किए जाते हैं, उनका नाम करण है) एवं नाना प्रकार की अलग-अलग चेष्टाएँ और वैसे ही पाँचवाँ हेतु दैव (पूर्वकृत शुभाशुभ कर्मों के संस्कारों का नाम दैव है) है";
                }else if(i==14){
                    name="शरीरवाङ्\u200Cमनोभिर्यत्-कर्म प्रारभते नरः ।\n" +
                            "न्याय्यं वा विपरीतं वा पञ्चैते तस्य हेतवः ॥";
                    desc="मनुष्य मन, वाणी और शरीर से शास्त्रानुकूल अथवा विपरीत जो कुछ भी कर्म करता है- उसके ये पाँचों कारण हैं॥";
                }else if(i==15){
                    name="तत्रैवं सति कर्तारमात्-मानं केवलं तु यः ।\n" +
                            "पश्यत्यकृतबुद्धित्वान्-न स पश्यति दुर्मतिः ॥";
                    desc="परन्तु ऐसा होने पर भी जो मनुष्य अशुद्ध बुद्धि होने के कारण उस विषय में यानी कर्मों के होने में केवल शुद्ध स्वरूप आत्मा को कर्ता समझता है, वह मलीन बुद्धि वाला अज्ञानी यथार्थ नहीं समझता";
                }else if(i==16){
                    name="यस्य नाहंकृतो भावो बुद्धिर्यस्य न लिप्यते ।\n" +
                            "हत्वापि स इमाँल्लोकान्न हन्ति न निबध्यते ॥";
                    desc="जिस पुरुष के अन्तःकरण में 'मैं कर्ता हूँ' ऐसा भाव नहीं है तथा जिसकी बुद्धि सांसारिक पदार्थों में और कर्मों में लिपायमान नहीं होती, वह पुरुष इन सब लोकों को मारकर भी वास्तव में न तो मरता है और न पाप से बँधता है। (जैसे अग्नि, वायु और जल द्वारा प्रारब्धवश किसी प्राणी की हिंसा होती देखने में आए तो भी वह वास्तव में हिंसा नहीं है, वैसे ही जिस पुरुष का देह में अभिमान नहीं है और स्वार्थरहित केवल संसार के हित के लिए ही जिसकी सम्पूर्ण क्रियाएँ होती हैं, उस पुरुष के शरीर और इन्द्रियों द्वारा यदि किसी प्राणी की हिंसा होती हुई लोकदृष्टि में देखी जाए, तो भी वह वास्तव में हिंसा नहीं है क्योंकि आसक्ति, स्वार्थ और अहंकार के न होने से किसी प्राणी की हिंसा हो ही नहीं सकती तथा बिना कर्तृत्वाभिमान के किया हुआ कर्म वास्तव में अकर्म ही है, इसलिए वह पुरुष 'पाप से नहीं बँधता'।)";
                }else if(i==17){
                    name="ज्ञानं ज्ञेयं परिज्ञाता त्रिविधा कर्मचोदना ।\n" +
                            "करणं कर्म कर्तेति त्रिविधः कर्मसंग्रहः ॥";
                    desc="ज्ञाता (जानने वाले का नाम 'ज्ञाता' है।), ज्ञान (जिसके द्वारा जाना जाए, उसका नाम 'ज्ञान' है। ) और ज्ञेय (जानने में आने वाली वस्तु का नाम 'ज्ञेय' है।)- ये तीनों प्रकार की कर्म-प्रेरणा हैं और कर्ता (कर्म करने वाले का नाम 'कर्ता' है।), करण (जिन साधनों से कर्म किया जाए, उनका नाम 'करण' है।) तथा क्रिया (करने का नाम 'क्रिया' है।)- ये तीनों प्रकार का कर्म-संग्रह है";
                }else if(i==18){
                    name="ज्ञानं कर्म च कर्ता च त्रिधैव गुणभेदतः ।\n" +
                            "प्रोच्यते गुणसंख्याने यथावच्छृणु तान्यपि ॥";
                    desc="गुणों की संख्या करने वाले शास्त्र में ज्ञान और कर्म तथा कर्ता गुणों के भेद से तीन-तीन प्रकार के ही कहे गए हैं, उनको भी तु मुझसे भलीभाँति सुन";
                }else if(i==19){
                    name="सर्वभूतेषु येनैकं भावमव्ययमीक्षते ।\n" +
                            "अविभक्तं विभक्तेषु तज्ज्ञानं विद्धि सात्त्विकम् ॥";
                    desc="जिस ज्ञान से मनुष्य पृथक-पृथक सब भूतों में एक अविनाशी परमात्मभाव को विभागरहित समभाव से स्थित देखता है, उस ज्ञान को तू सात्त्विक जान";
                }else if(i==20){
                    name="पृथक्त्वेन तु यज्ज्ञानं नानाभावान्पृथग्विधान् ।\n" +
                            "वेत्ति सर्वेषु भूतेषु तज्ज्ञानं विद्धि राजसम् ॥";
                    desc="किन्तु जो ज्ञान अर्थात जिस ज्ञान के द्वारा मनुष्य सम्पूर्ण भूतों में भिन्न-भिन्न प्रकार के नाना भावों को अलग-अलग जानता है, उस ज्ञान को तू राजस जान";
                }else if(i==21){
                    name="यत्तु कृत्स्नवदेकस्मिन्-कार्ये सक्तमहैतुकम् ।\n" +
                            "अतत्त्वार्थवदल्पं च तत्तामसमुदाहृतम् ॥";
                    desc="परन्तु जो ज्ञान एक कार्यरूप शरीर में ही सम्पूर्ण के सदृश आसक्त है तथा जो बिना युक्तिवाला, तात्त्विक अर्थ से रहित और तुच्छ है- वह तामस कहा गया है";
                }else if(i==22){
                    name="नियतं सङ्गरहितमरागद्वेषतः कृतम् ।\n" +
                            "अफलप्रेप्सुना कर्म यत्तत्सात्त्विकमुच्यते ॥";
                    desc="जो कर्म शास्त्रविधि से नियत किया हुआ और कर्तापन के अभिमान से रहित हो तथा फल न चाहने वाले पुरुष द्वारा बिना राग-द्वेष के किया गया हो- वह सात्त्विक कहा जाता है";
                }else if(i==23){
                    name="यत्तु कामेप्सुना कर्म साहंकारेण वा पुनः ।\n" +
                            "क्रियते बहुलायासं तद्राजसमुदाहृतम् ॥";
                    desc="परन्तु जो कर्म बहुत परिश्रम से युक्त होता है तथा भोगों को चाहने वाले पुरुष द्वारा या अहंकारयुक्त पुरुष द्वारा किया जाता है, वह कर्म राजस कहा गया है";
                }else if(i==24){
                    name="अनुबन्धं क्षयं हिंसा-मनवेक्ष्य च पौरुषम् ।\n" +
                            "मोहादारभ्यते कर्म यत्तत्तामसमुच्यते ॥";
                    desc="जो कर्म परिणाम, हानि, हिंसा और सामर्थ्य को न विचारकर केवल अज्ञान से आरंभ किया जाता है, वह तामस कहा जाता है";
                }else if(i==25){
                    name="मुक्तसङ्गोऽनहंवादी धृत्युत्साहसमन्वितः ।\n" +
                            "सिद्ध्यसिद्ध्योर्निर्विकारः कर्ता सात्त्विक उच्यते ॥";
                    desc="जो कर्ता संगरहित, अहंकार के वचन न बोलने वाला, धैर्य और उत्साह से युक्त तथा कार्य के सिद्ध होने और न होने में हर्ष -शोकादि विकारों से रहित है- वह सात्त्विक कहा जाता है";
                }else if(i==26){
                    name="रागी कर्मफलप्रेप्सुर्लुब्धो हिंसात्मकोऽशुचिः ।\n" +
                            "हर्षशोकान्वितः कर्ता राजसः परिकीर्तितः ॥";
                    desc="जो कर्ता आसक्ति से युक्त कर्मों के फल को चाहने वाला और लोभी है तथा दूसरों को कष्ट देने के स्वभाववाला, अशुद्धाचारी और हर्ष-शोक से लिप्त है वह राजस कहा गया है";
                }else if(i==27){
                    name="अयुक्तः प्राकृतः स्तब्धः शठो नैष्कृतिकोऽलसः ।\n" +
                            "विषादी दीर्घसूत्री च कर्ता तामस उच्यते ॥";
                    desc="जो कर्ता अयुक्त, शिक्षा से रहित घमंडी, धूर्त और दूसरों की जीविका का नाश करने वाला तथा शोक करने वाला, आलसी और दीर्घसूत्री (दीर्घसूत्री उसको कहा जाता है कि जो थोड़े काल में होने लायक साधारण कार्य को भी फिर कर लेंगे, ऐसी आशा से बहुत काल तक नहीं पूरा करता। ) है वह तामस कहा जाता है";
                }else if(i==28){
                    name="बुद्धेर्भेदं धृतेश्चैव गुणतस्त्रिविधं शृणु ।\n" +
                            "प्रोच्यमानमशेषेण पृथक्त्वेन धनंजय ॥";
                    desc="हे धनंजय ! अब तू बुद्धि का और धृति का भी गुणों के अनुसार तीन प्रकार का भेद मेरे द्वारा सम्पूर्णता से विभागपूर्वक कहा जाने वाला सुन";
                }else if(i==29){
                    name="प्रवृत्तिं च निवृत्तिं च कार्याकार्ये भयाभये ।\n" +
                            "बन्धं मोक्षं च या वेत्ति बुद्धिः सा पार्थ सात्त्विकी ॥";
                    desc="हे पार्थ ! जो बुद्धि प्रवृत्तिमार्ग और निवृत्ति मार्ग को, कर्तव्य और अकर्तव्य को, भय और अभय को तथा बंधन और मोक्ष को यथार्थ जानती है- वह बुद्धि सात्त्विकी है ";
                }else if(i==30){
                    name="यया धर्ममधर्मं च कार्यं चाकार्यमेव च ।\n" +
                            "अयथावत्प्रजानाति बुद्धिः सा पार्थ राजसी ॥";
                    desc="हे पार्थ! मनुष्य जिस बुद्धि के द्वारा धर्म और अधर्म को तथा कर्तव्य और अकर्तव्य को भी यथार्थ नहीं जानता, वह बुद्धि राजसी है";
                }else if(i==31){
                    name="अधर्मं धर्ममिति या मन्यते तमसावृता ।\n" +
                            "सर्वार्थान्विपरीतांश्च बुद्धिः सा पार्थ तामसी ॥";
                    desc="हे अर्जुन! जो तमोगुण से घिरी हुई बुद्धि अधर्म को भी 'यह धर्म है' ऐसा मान लेती है तथा इसी प्रकार अन्य संपूर्ण पदार्थों को भी विपरीत मान लेती है, वह बुद्धि तामसी है";
                }else if(i==32){
                    name="धृत्या यया धारयते मनःप्राणेन्द्रियक्रियाः।\n" +
                            "योगेनाव्यभिचारिण्या धृतिः सा पार्थ सात्त्विकी ॥";
                    desc="हे पार्थ! जिस अव्यभिचारिणी धारण शक्ति (भगवद्विषय के सिवाय अन्य सांसारिक विषयों को धारण करना ही व्यभिचार दोष है, उस दोष से जो रहित है वह 'अव्यभिचारिणी धारणा' है।) से मनुष्य ध्यान योग के द्वारा मन, प्राण और इंद्रियों की क्रियाओं ( मन, प्राण और इंद्रियों को भगवत्प्राप्ति के लिए भजन, ध्यान और निष्काम कर्मों में लगाने का नाम 'उनकी क्रियाओं को धारण करना' है।) को धारण करता है, वह धृति सात्त्विकी है";
                }else if(i==33){
                    name="यया तु धर्मकामार्थान्धृत्या धारयतेऽर्जुन ।\n" +
                            "प्रसङ्गेन फलाकाङ्क्षी धृतिः सा पार्थ राजसी ॥";
                    desc="परंतु हे पृथापुत्र अर्जुन! फल की इच्छावाला मनुष्य जिस धारण शक्ति के द्वारा अत्यंत आसक्ति से धर्म, अर्थ और कामों को धारण करता है, वह धारण शक्ति राजसी है";
                }else if(i==34){
                    name="यया स्वप्नं भयं शोकं विषादं मदमेव च ।\n" +
                            "न विमुञ्चति दुर्मेधा धृतिः सा पार्थ तामसी ॥";
                    desc="हे पार्थ! दुष्ट बुद्धिवाला मनुष्य जिस धारण शक्ति के द्वारा निद्रा, भय, चिंता और दु:ख को तथा उन्मत्तता को भी नहीं छोड़ता अर्थात धारण किए रहता है- वह धारण शक्ति तामसी है";
                }else if(i==35){
                    name="सुखं त्विदानीं त्रिविधं शृणु मे भरतर्षभ ।\n" +
                            "अभ्यासाद्रमते यत्र दुःखान्तं च निगच्छति ॥";
                    desc="हे भरतश्रेष्ठ! अब तीन प्रकार के सुख को भी तू मुझसे सुन। जिस सुख में साधक मनुष्य भजन, ध्यान और सेवादि के अभ्यास से रमण करता है और जिससे दुःखों के अंत को प्राप्त हो जाता है, जो ऐसा सुख है, वह आरंभकाल में यद्यपि विष के तुल्य प्रतीत (जैसे खेल में आसक्ति वाले बालक को विद्या का अभ्यास मूढ़ता के कारण प्रथम विष के तुल्य भासता है वैसे ही विषयों में आसक्ति वाले पुरुष को भगवद्भजन, ध्यान, सेवा आदि साधनाओं का अभ्यास मर्म न जानने के कारण प्रथम 'विष के तुल्य प्रतीत होता' है) होता है, परन्तु परिणाम में अमृत के तुल्य है, इसलिए वह परमात्मविषयक बुद्धि के प्रसाद से उत्पन्न होने वाला सुख सात्त्विक कहा गया है";
                }else if(i==36){
                    name="यत्तदग्रे विषमिव परिणामेऽमृतोपमम् ।\n" +
                            "तत्सुखं सात्त्विकं प्रोक्तमात्मबुद्धिप्रसादजम् ॥";
                    desc="";
                }else if(i==37){
                    name="विषयेन्द्रियसंयोगाद्यत्त-दग्रेऽमृतोपमम् ।\n" +
                            "परिणामे विषमिव तत्सुखं राजसं स्मृतम् ॥";
                    desc="जो सुख विषय और इंद्रियों के संयोग से होता है, वह पहले- भोगकाल में अमृत के तुल्य प्रतीत होने पर भी परिणाम में विष के तुल्य (बल, वीर्य, बुद्धि, धन, उत्साह और परलोक का नाश होने से विषय और इंद्रियों के संयोग से होने वाले सुख को 'परिणाम में विष के तुल्य' कहा है) है इसलिए वह सुख राजस कहा गया है";
                }else if(i==38){
                    name="यदग्रे चानुबन्धे च सुखं मोहनमात्मनः ।\n" +
                            "निद्रालस्यप्रमादोत्थं तत्तामसमुदाहृतम् ॥";
                    desc="जो सुख भोगकाल में तथा परिणाम में भी आत्मा को मोहित करने वाला है, वह निद्रा, आलस्य और प्रमाद से उत्पन्न सुख तामस कहा गया है";
                }else if(i==39){
                    name="न तदस्ति पृथिव्यां वा दिवि देवेषु वा पुनः ।\n" +
                            "सत्त्वं प्रकृतिजैर्मुक्तं यदेभिःस्यात्त्रिभिर्गुणैः ॥";
                    desc="पृथ्वी में या आकाश में अथवा देवताओं में तथा इनके सिवा और कहीं भी ऐसा कोई भी सत्त्व नहीं है, जो प्रकृति से उत्पन्न इन तीनों गुणों से रहित हो";
                }else if(i==40){
                    name="ब्राह्मणक्षत्रियविशां शूद्राणां च परन्तप ।\n" +
                            "कर्माणि प्रविभक्तानि स्वभावप्रभवैर्गुणैः ॥";
                    desc="हे परंतप! ब्राह्मण, क्षत्रिय और वैश्यों के तथा शूद्रों के कर्म स्वभाव से उत्पन्न गुणों द्वारा विभक्त किए गए हैं";
                }else if(i==41){
                    name="शमो दमस्तपः शौचं क्षान्तिरार्जवमेव च ।\n" +
                            "ज्ञानं विज्ञानमास्तिक्यं ब्रह्मकर्म स्वभावजम् ॥";
                    desc="अंतःकरण का निग्रह करना, इंद्रियों का दमन करना, धर्मपालन के लिए कष्ट सहना, बाहर-भीतर से शुद्ध रहना, दूसरों के अपराधों को क्षमा करना, मन, इंद्रिय और शरीर को सरल रखना, वेद, शास्त्र, ईश्वर और परलोक आदि में श्रद्धा रखना, वेद-शास्त्रों का अध्ययन-अध्यापन करना और परमात्मा के तत्त्व का अनुभव करना- ये सब-के-सब ही ब्राह्मण के स्वाभाविक कर्म हैं";
                }else if(i==42){
                    name="शौर्यं तेजो धृतिर्दाक्ष्यं युद्धे चाप्यपलायनम् ।\n" +
                            "दानमीश्वरभावश्च क्षात्रं कर्म स्वभावजम् ॥";
                    desc="शूरवीरता, तेज, धैर्य, चतुरता और युद्ध में न भागना, दान देना और स्वामिभाव- ये सब-के-सब ही क्षत्रिय के स्वाभाविक कर्म हैं";
                }else if(i==43){
                    name="कृषिगौरक्ष्यवाणिज्यं वैश्यकर्म स्वभावजम् ।\n" +
                            "परिचर्यात्मकं कर्म शूद्रस्यापि स्वभावजम् ॥";
                    desc="खेती, गोपालन और क्रय-विक्रय रूप सत्य व्यवहार (वस्तुओं के खरीदने और बेचने में तौल, नाप और गिनती आदि से कम देना अथवा अधिक लेना एवं वस्तु को बदलकर या एक वस्तु में दूसरी या खराब वस्तु मिलाकर दे देना अथवा अच्छी ले लेना तथा नफा, आढ़त और दलाली ठहराकर उससे अधिक दाम लेना या कम देना तथा झूठ, कपट, चोरी और जबरदस्ती से अथवा अन्य किसी प्रकार से दूसरों के हक को ग्रहण कर लेना इत्यादि दोषों से रहित जो सत्यतापूर्वक पवित्र वस्तुओं का व्यापार है उसका नाम 'सत्य व्यवहार' है।) ये वैश्य के स्वाभाविक कर्म हैं तथा सब वर्णों की सेवा करना शूद्र का भी स्वाभाविक कर्म है";
                }else if(i==44){
                    name="स्वे स्वे कर्मण्यभिरतः संसिद्धिं लभते नरः ।\n" +
                            "स्वकर्मनिरतः सिद्धिं यथा विन्दति तच्छृणु ॥";
                    desc="अपने-अपने स्वाभाविक कर्मों में तत्परता से लगा हुआ मनुष्य भगवत्प्राप्ति रूप परमसिद्धि को प्राप्त हो जाता है। अपने स्वाभाविक कर्म में लगा हुआ मनुष्य जिस प्रकार से कर्म करके परमसिद्धि को प्राप्त होता है, उस विधि को तू सुन";
                }else if(i==45){
                    name="यतः प्रवृत्तिर्भूतानां येन सर्वमिदं ततम् ।\n" +
                            "स्वकर्मणा तमभ्यर्च्य सिद्धिं विन्दति मानवः ॥";
                    desc="जिस परमेश्वर से संपूर्ण प्राणियों की उत्पत्ति हुई है और जिससे यह समस्त जगत्\u200C व्याप्त है (जैसे बर्फ जल से व्याप्त है, वैसे ही संपूर्ण संसार सच्चिदानंदघन परमात्मा से व्याप्त है), उस परमेश्वर की अपने स्वाभाविक कर्मों द्वारा पूजा करके (जैसे पतिव्रता स्त्री पति को सर्वस्व समझकर पति का चिंतन करती हुई पति के आज्ञानुसार पति के ही लिए मन, वाणी, शरीर से कर्म करती है, वैसे ही परमेश्वर को ही सर्वस्व समझकर परमेश्वर का चिंतन करते हुए परमेश्वर की आज्ञा के अनुसार मन, वाणी और शरीर से परमेश्वर के ही लिए स्वाभाविक कर्तव्य कर्म का आचरण करना 'कर्म द्वारा परमेश्वर को पूजना' है) मनुष्य परमसिद्धि को प्राप्त हो जाता है";
                }else if(i==46){
                    name="श्रेयान्स्वधर्मो विगुणः परधर्मात्स्वनुष्ठितात् ।\n" +
                            "स्वभावनियतं कर्म कुर्वन्नाप्नोति किल्बिषम् ॥";
                    desc="अच्छी प्रकार आचरण किए हुए दूसरे के धर्म से गुणरहित भी अपना धर्म श्रेष्ठ है, क्योंकि स्वभाव से नियत किए हुए स्वधर्मरूप कर्म को करता हुआ मनुष्य पाप को नहीं प्राप्त होता";
                }else if(i==47){
                    name="सहजं कर्म कौन्तेय सदोषमपि न त्यजेत् ।\n" +
                            "सर्वारम्भा हि दोषेण धूमेनाग्निरिवावृताः ॥";
                    desc="अतएव हे कुन्तीपुत्र! दोषयुक्त होने पर भी सहज कर्म (प्रकृति के अनुसार शास्त्र विधि से नियत किए हुए वर्णाश्रम के धर्म और सामान्य धर्मरूप स्वाभाविक कर्म हैं उनको ही यहाँ स्वधर्म, सहज कर्म, स्वकर्म, नियत कर्म, स्वभावज कर्म, स्वभावनियत कर्म इत्यादि नामों से कहा है) को नहीं त्यागना चाहिए, क्योंकि धूएँ से अग्नि की भाँति सभी कर्म किसी-न-किसी दोष से युक्त हैं";
                }else if(i==48){
                    name="असक्तबुद्धिः सर्वत्र जितात्मा विगतस्पृहः ।\n" +
                            "नैष्कर्म्यसिद्धिं परमां संन्यासेनाधिगच्छति ॥";
                    desc="सर्वत्र आसक्तिरहित बुद्धिवाला, स्पृहारहित और जीते हुए अंतःकरण वाला पुरुष सांख्ययोग के द्वारा उस परम नैष्कर्म्यसिद्धि को प्राप्त होता है";
                }else if(i==49){
                    name="सिद्धिं प्राप्तो यथा ब्रह्म तथाप्नोति निबोध मे ।\n" +
                            "समासेनैव कौन्तेय निष्ठा ्ञानस्य या परा ॥";
                    desc="जो कि ज्ञान योग की परानिष्ठा है, उस नैष्कर्म्य सिद्धि को जिस प्रकार से प्राप्त होकर मनुष्य ब्रह्म को प्राप्त होता है, उस प्रकार को हे कुन्तीपुत्र! तू संक्षेप में ही मुझसे समझ";
                }else if(i==50){
                    name="बुद्ध्या विशुद्ध्या युक्तो धृत्यात्मानं नियम्य च ।\n" +
                            "शब्दादीन्विषयांस्त्यक्त्वा रागद्वेषौ व्युदस्य च ॥";
                    desc="विशुद्ध बुद्धि से युक्त तथा हलका, सात्त्विक और नियमित भोजन करने वाला, शब्दादि विषयों का त्याग करके एकांत और शुद्ध देश का सेवन करने वाला, सात्त्विक धारण शक्ति के द्वारा अंतःकरण और इंद्रियों का संयम करके मन, वाणी और शरीर को वश में कर लेने वाला, राग-द्वेष को सर्वथा नष्ट करके भलीभाँति दृढ़ वैराग्य का आश्रय लेने वाला तथा अहंकार, बल, घमंड, काम, क्रोध और परिग्रह का त्याग करके निरंतर ध्यान योग के परायण रहने वाला, ममतारहित और शांतियुक्त पुरुष सच्चिदानन्दघन ब्रह्म में अभिन्नभाव से स्थित होने का पात्र होता है";
                }else if(i==51){
                    name="विविक्तसेवी लघ्वाशी यतवाक्कायमानसः ।\n" +
                            "ध्यानयोगपरो नित्यं वैराग्यं समुपाश्रितः ॥";
                    desc="";
                }else if(i==52){
                    name="अहंकारं बलं दर्पं कामं क्रोधं परिग्रहम् ।\n" +
                            "विमुच्य निर्ममः शान्तो ब्रह्मभूयाय कल्पते ॥";
                    desc="";
                }else if(i==53){
                    name="ब्रह्मभूतः प्रसन्नात्मा न शोचति न काङ्क्षति ।\n" +
                            "समः सर्वेषु भूतेषु मद्भक्तिं लभते पराम् ॥";
                    desc="फिर वह सच्चिदानन्दघन ब्रह्म में एकीभाव से स्थित, प्रसन्न मनवाला योगी न तो किसी के लिए शोक करता है और न किसी की आकांक्षा ही करता है। ऐसा समस्त प्राणियों में समभाव वाला  योगी मेरी पराभक्ति को ( जो तत्त्व ज्ञान की पराकाष्ठा है तथा जिसको प्राप्त होकर और कुछ जानना बाकी नहीं रहता वही यहाँ पराभक्ति, ज्ञान की परानिष्ठा, परम नैष्कर्म्यसिद्धि और परमसिद्धि इत्यादि नामों से कही गई है) प्राप्त हो जाता है";
                }else if(i==54){
                    name="भक्त्या मामभिजानाति यावान्यश्चास्मि तत्त्वतः ।\n" +
                            "ततो मां तत्त्वतो ज्ञात्वा िशते तदनन्तरम् ॥";
                    desc="उस पराभक्ति के द्वारा वह मुझ परमात्मा को, मैं जो हूँ और जितना हूँ, ठीक वैसा-का-वैसा तत्त्व से जान लेता है तथा उस भक्ति से मुझको तत्त्व से जानकर तत्काल ही मुझमें प्रविष्ट हो जाता है";
                }else if(i==55){
                    name="सर्वकर्माण्यपि सदा कुर्वाणो मद्व्यपाश्रयः ।\n" +
                            "मत्प्रसादादवाप्नोति शाश्वतं पदमव्ययम् ॥";
                    desc="मेरे परायण हुआ कर्मयोगी तो संपूर्ण कर्मों को सदा करता हुआ भी मेरी कृपा से सनातन अविनाशी परमपद को प्राप्त हो जाता है";
                }else if(i==56){
                    name="चेतसा सर्वकर्माणि मयि संन्यस्य मत्परः ।\n" +
                            "बुद्धियोगमुपाश्रित्य मच्चित्तः सततं भव ॥";
                    desc="सब कर्मों को मन से मुझमें अर्पण करके तथा समबुद्धि रूप योग को अवलंबन करके मेरे परायण और निरंतर मुझमें चित्तवाला हो";
                }else if(i==57){
                    name="मच्चित्तः सर्वदुर्गाणि मत्प्रसादात्तरिष्यसि ।\n" +
                            "अथ चेत्त्वमहंकारान्न श्रोष्यसि विनङ्क्ष्यसि ॥";
                    desc="उपर्युक्त प्रकार से मुझमें चित्तवाला होकर तू मेरी कृपा से समस्त संकटों को अनायास ही पार कर जाएगा और यदि अहंकार के कारण मेरे वचनों को न सुनेगा तो नष्ट हो जाएगा अर्थात परमार्थ से भ्रष्ट हो जाएगा";
                }else if(i==58){
                    name="यदहंकारमाश्रित्य न योत्स्य इति मन्यसे ।\n" +
                            "मिथ्यैष व्यवसायस्ते प्रकृतिस्त्वां नियोक्ष्यति ॥";
                    desc="जो तू अहंकार का आश्रय लेकर यह मान रहा है कि 'मैं युद्ध नहीं करूँगा' तो तेरा यह निश्चय मिथ्या है, क्योंकि तेरा स्वभाव तुझे जबर्दस्ती युद्ध में लगा देगा";
                }else if(i==59){
                    name="स्वभावजेन कौन्तेय निबद्धः स्वेन कर्मणा ।\n" +
                            "कर्तुं नेच्छसि यन्मोहात्-करिष्यस्यवशोऽपि तत् ॥";
                    desc="हे कुन्तीपुत्र! जिस कर्म को तू मोह के कारण करना नहीं चाहता, उसको भी अपने पूर्वकृत स्वाभाविक कर्म से बँधा हुआ परवश होकर करेगा";
                }else if(i==60){
                    name="ईश्वरः सर्वभूतानां हृद्देशेऽर्जुन तिष्ठति ।\n" +
                            "भ्रामयन्सर्वभूतानि यन्त्रारूढानि मायया ॥";
                    desc="हे अर्जुन! शरीर रूप यंत्र में आरूढ़ हुए संपूर्ण प्राणियों को अन्तर्यामी परमेश्वर अपनी माया से उनके कर्मों के अनुसार भ्रमण कराता हुआ सब प्राणियों के हृदय में स्थित है";
                }else if(i==61){
                    name="तमेव शरणं गच्छ सर्वभावेन भारत ।\n" +
                            "तत्प्रसादात्परां शान्तिं स्थानं प्राप्स्यसि शाश्वतम् ॥";
                    desc="हे भारत! तू सब प्रकार से उस परमेश्वर की ही शरण में (लज्जा, भय, मान, बड़ाई और आसक्ति को त्यागकर एवं शरीर और संसार में अहंता, ममता से रहित होकर एक परमात्मा को ही परम आश्रय, परम गति और सर्वस्व समझना तथा अनन्य भाव से अतिशय श्रद्धा, भक्ति और प्रेमपूर्वक निरंतर भगवान के नाम, गुण, प्रभाव और स्वरूप का चिंतन करते रहना एवं भगवान का भजन, स्मरण करते हुए ही उनके आज्ञा अनुसार कर्तव्य कर्मों का निःस्वार्थ भाव से केवल परमेश्वर के लिए आचरण करना यह 'सब प्रकार से परमात्मा के ही शरण' होना है) जा। उस परमात्मा की कृपा से ही तू परम शांति को तथा सनातन परमधाम को प्राप्त होगा";
                }else if(i==62){
                    name="इति ते ज्ञानमाख्यातं गुह्याद्\u200Cगुह्यतरं मया ।\n" +
                            "विमृश्यैतदशेषेण यथेच्छसि तथा कुरु ॥";
                    desc="इस प्रकार यह गोपनीय से भी अति गोपनीय ज्ञान मैंने तुमसे कह दिया। अब तू इस रहस्ययुक्त ज्ञान को पूर्णतया भलीभाँति विचार कर, जैसे चाहता है वैसे ही कर";
                }else if(i==63){
                    name="सर्वगुह्यतमं भूयः शृणु मे परमं वचः ।\n" +
                            "इष्टोऽसि मे दृढमिति ततो वक्ष्यामि ते हितम् ॥";
                    desc="संपूर्ण गोपनीयों से अति गोपनीय मेरे परम रहस्ययुक्त वचन को तू फिर भी सुन। तू मेरा अतिशय प्रिय है, इससे यह परम हितकारक वचन मैं तुझसे कहूँगा";
                }else if(i==64){
                    name="मन्मना भव मद्भक्तो मद्याजी मां नमस्कुरु ।\n" +
                            "मामेवैष्यसि सत्यं ते प्रतिजाने प्रियोऽसि मे ॥";
                    desc="हे अर्जुन! तू मुझमें मनवाला हो, मेरा भक्त बन, मेरा पूजन करने वाला हो और मुझको प्रणाम कर। ऐसा करने से तू मुझे ही प्राप्त होगा, यह मैं तुझसे सत्य प्रतिज्ञा करता हूँ क्योंकि तू मेरा अत्यंत प्रिय है";
                }else if(i==65){
                    name="सर्वधर्मान्परित्यज्य मामेकं शरणं व्रज ।\n" +
                            "अहं त्वां सर्वपापेभ्यो मोक्षयिष्यामि मा शुचः ॥";
                    desc="संपूर्ण धर्मों को अर्थात संपूर्ण कर्तव्य कर्मों को मुझमें त्यागकर तू केवल एक मुझ सर्वशक्तिमान, सर्वाधार परमेश्वर की ही शरण में आ जा। मैं तुझे संपूर्ण पापों से मुक्त कर दूँगा, तू शोक मत कर";
                }else if(i==66){
                    name="इदं ते नातपस्काय नाभक्ताय कदाचन ।\n" +
                            "न चाशुश्रूषवे वाच्यं न च मां योऽभ्यसूयति ॥";
                    desc="तुझे यह गीत रूप रहस्यमय उपदेश किसी भी काल में न तो तपरहित मनुष्य से कहना चाहिए, न भक्ति-(वेद, शास्त्र और परमेश्वर तथा महात्मा और गुरुजनों में श्रद्धा, प्रेम और पूज्य भाव का नाम 'भक्ति' है।)-रहित से और न बिना सुनने की इच्छा वाले से ही कहना चाहिए तथा जो मुझमें दोषदृष्टि रखता है, उससे तो कभी भी नहीं कहना चाहिए";
                }else if(i==67){
                    name="य इमं परमं गुह्यं मद्भक्तेष्वभिधास्यति ।\n" +
                            "भक्तिं मयि परां कृत्वा मामेवैष्यत्यसंशयः ॥";
                    desc="जो पुरुष मुझमें परम प्रेम करके इस परम रहस्ययुक्त गीताशास्त्र को मेरे भक्तों में कहेगा, वह मुझको ही प्राप्त होगा- इसमें कोई संदेह नहीं है";
                }else if(i==68){
                    name="न च तस्मान्मनुष्येषु कश्चिन्मे प्रियकृत्तमः ।\n" +
                            "भविता न च मे तस्मा-दन्यः प्रियतरो भुवि ॥";
                    desc="उससे बढ़कर मेरा प्रिय कार्य करने वाला मनुष्यों में कोई भी नहीं है तथा पृथ्वीभर में उससे बढ़कर मेरा प्रिय दूसरा कोई भविष्य में होगा भी नहीं";
                }else if(i==69){
                    name="अध्येष्यते च य इमं धर्म्यं संवादमावयोः ।\n" +
                            "ज्ञानयज्ञेन तेनाहमिष्टः स्यामिति मे मतिः";
                    desc="जो पुरुष इस धर्ममय हम दोनों के संवाद रूप गीताशास्त्र को पढ़ेगा, उसके द्वारा भी मैं ज्ञानयज्ञ से पूजित होऊँगा- ऐसा मेरा मत है";
                }else if(i==70){
                    name="श्रद्धावाननसूयश्च शृणुया-दपि यो नरः ।\n" +
                            "सोऽपि मुक्तः शुभाँल्लोकान्-प्राप्नुयात्पुण्यकर्मणाम् ॥";
                    desc="जो मनुष्य श्रद्धायुक्त और दोषदृष्टि से रहित होकर इस गीताशास्त्र का श्रवण भी करेगा, वह भी पापों से मुक्त होकर उत्तम कर्म करने वालों के श्रेष्ठ लोकों को प्राप्त होगा";
                }else if(i==71){
                    name="कच्चिदेतच्छ्रुतं पार्थ त्वयैकाग्रेण चेतसा ।\n" +
                            "कच्चिदज्ञानसंमोहः प्रनष्टस्ते धनंजय ॥";
                    desc="हे पार्थ! क्या इस (गीताशास्त्र) को तूने एकाग्रचित्त से श्रवण किया? और हे धनञ्जय! क्या तेरा अज्ञानजनित मोह नष्ट हो गया?";
                }else if(i==72){
                    name="नष्टो मोहः स्मृतिर्लब्धा त्वत्प्रसादान्मयाच्युत । \n" +
                            "स्थितोऽस्मि गतसन्देहः करिष्ये वचनं तव ॥";
                    desc="अर्जुन बोले- हे अच्युत! आपकी कृपा से मेरा मोह नष्ट हो गया और मैंने स्मृति प्राप्त कर ली है, अब मैं संशयरहित होकर स्थिर हूँ, अतः आपकी आज्ञा का पालन करूँगा॥";
                }else if(i==73){
                    name="इत्यहं वासुदेवस्य पार्थस्य च महात्मनः । \n" +
                            "संवादमिममश्रौष-मद्भुतं रोमहर्षणम् ॥";
                    desc="संजय बोले- इस प्रकार मैंने श्री वासुदेव के और महात्मा अर्जुन के इस अद्\u200Dभुत रहस्ययुक्त, रोमांचकारक संवाद को सुना";
                }else if(i==74){
                    name="व्यासप्रसादाच्छ्रुत-वानेतद्गुह्यमहं परम् ।\n" +
                            "योगं योगेश्वरात्कृष्णात्-साक्षात्कथयतः स्वयम् ॥";
                    desc="श्री व्यासजी की कृपा से दिव्य दृष्टि पाकर मैंने इस परम गोपनीय योग को अर्जुन के प्रति कहते हुए स्वयं योगेश्वर भगवान श्रीकृष्ण से प्रत्यक्ष सुना";
                }else if(i==75){
                    name="राजन्संस्मृत्य संस्मृत्य संवादमिममद्भुतम् ।\n" +
                            "केशवार्जुनयोः पुण्यं हृष्यामि च मुहुर्मुहुः ॥";
                    desc="हे राजन! भगवान श्रीकृष्ण और अर्जुन के इस रहस्ययुक्त, कल्याणकारक और अद्\u200Dभुत संवाद को पुनः-पुनः स्मरण करके मैं बार-बार हर्षित हो रहा हूँ";
                }else if(i==76){
                    name="तच्च संस्मृत्य संस्मृत्य रूपमत्यद्भुतं हरेः ।\n" +
                            "विस्मयो मे महान् राजन्-हृष्यामि च पुनः पुनः ॥";
                    desc="हे राजन्\u200C! श्रीहरि (जिसका स्मरण करने से पापों का नाश होता है उसका नाम 'हरि' है) के उस अत्यंत विलक्षण रूप को भी पुनः-पुनः स्मरण करके मेरे चित्त में महान आश्चर्य होता है और मैं बार-बार हर्षित हो रहा हूँ";
                }else if(i==77){
                    name="यत्र योगेश्वरः कृष्णो यत्र पार्थो धनुर्धरः ।\n" +
                            "तत्र श्रीर्विजयो भूतिर्ध्रुवा \n" +
                            "नीतिर्मतिर्मम ॥";
                    desc=" हे राजन! जहाँ योगेश्वर भगवान श्रीकृष्ण हैं और जहाँ गाण्डीव-धनुषधारी अर्जुन है, वहीं पर श्री, विजय, विभूति और अचल नीति है- ऐसा मेरा मत है॥";
                }
                if(!desc.equals("")){
                    desc="भावार्थ : "+desc;
                }
            }
        if(!desc.equals("")){
                desc=desc+"||"+(i+1)+"||";
        }
        if(!name.equals("")){
                name=name+""+(i+1)+"||";
        }
        }

    }
}


